{"title":"The Long Shadow of the Civil War","uid":6572660,"size":1512177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:006ae9ad88225e91e5ef0da49cb7a18ab15858fb&amp;dn=The+Long+Shadow+of+the+Civil+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1312038868,"description":"Victoria E. Bynum, &quot;The Long Shadow of the Civil War: Southern Dissent and Its Legacies&quot; \nThe Univ ersity of N orth Caro lina Press | 2010 | ISBN: 0807833819 | PDF | 272 pages | 1.44 MB \n\nBynum (Unruly Women: The Politics of Social and Sexual Control in the Old South), a historian at Texas State University, offers an analysis of home front schisms in three Confederate regions: Big Thicket in eastern Texas, Piedmont North Carolina's Quaker Belt, and the counties in Mississippi's Piney Woods known as the Free State of Jones. Geographically and culturally isolated, they were largely populated by nonslaveholding subsistence farmers whose relationships with slaves and free blacks often generated a lively interracial subculture and even interracial family networks. Conscription policies favoring planters and manufacturers, together with food requisitions and taxes collected in kind by force, contributed to a sense of rich man's war, poor man's fight that made civilian-supported desertion and draft-evasion endemic. Defiance escalated to insurgency; Bynum quotes one unrepentant de facto Unionist: we fought [Confederates] like dogs, and we buried them like asses.... The collapse of Reconstruction left these dissenters marginalized by a race-based legal system and a lost cause mythology. Bynum highlights the solid South as a construction and even more successfully presents the importance of kinship, community, and place in sustaining resistance to oppression. 9 illus., 1 map.","torrent":{"xt":"urn:btih:006ae9ad88225e91e5ef0da49cb7a18ab15858fb","amp;dn":"The+Long+Shadow+of+the+Civil+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"006ae9ad88225e91e5ef0da49cb7a18ab15858fb","infoHashBuffer":{"type":"Buffer","data":[0,106,233,173,136,34,94,145,229,239,13,164,156,183,161,138,177,88,88,251]},"announce":[],"urlList":[]}}