{"title":"Bruce Springsteen - Born To Run","uid":4625520,"size":60520174,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:00947d0d3b4b524c5d3070db00d08e257ae2f617&amp;dn=Bruce+Springsteen+-+Born+To+Run&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Blindpew","files":-1,"time":1231196364,"description":"Live concert footage\n640x480\nxvid-tvrip\n\nBorn to Run was the third album by the American rock singer-songwriter Bruce Springsteen. It was released on August 25, 1975 through Columbia Records. It captured the heaviness of Springsteen's earlier releases while displaying a more diverse range of influences.\nBorn to Run was a critical and commercial success and became Springsteen's breakthrough album. It peaked at number three on the Billboard 200 and reached high positions on charts worldwide. Two singles were released from the album: &quot;Born to Run&quot; and &quot;Tenth Avenue Freeze-Out&quot;, the first helped Springsteen to reach mainstream popularity. The tracks &quot;Thunder Road&quot; and &quot;Jungleland&quot; became staples of album-oriented rock radio and Springsteen concert high points. The album has been placed on several &quot;best ever&quot; lists and is listed in the Library of Congress' National Recording Registry of historic recordings.\n\nLyrics:\n\nIn the day we sweat it out in the streets of a runaway american dream\nAt night we ride through mansions of glory in suicide machines\nSprung from cages out on highway 9,\nChrome wheeled, fuel injected and steppin out over the line\nBaby this town rips the bones from your back\nIts a death trap, its a suicide rap\nWe gotta get out while were young\n`cause tramps like us, baby we were born to run\n\nWendy let me in I wanna be your friend\nI want to guard your dreams and visions\nJust wrap your legs round these velvet rims\nAnd strap your hands across my engines\nTogether we could break this trap\nWell run till we drop, baby well never go back\nWill you walk with me out on the wire\n`cause baby Im just a scared and lonely rider\nBut I gotta find out how it feels\nI want to know if love is wild, girl I want to know if love is real\n\nBeyond the palace hemi-powered drones scream down the boulevard\nThe girls comb their hair in rearview mirrors\nAnd the boys try to look so hard\nThe amusement park rises bold and stark\nKids are huddled on the beach in a mist\nI wanna die with you wendy on the streets tonight\nIn an everlasting kiss\n\nThe highways jammed with broken heroes on a last chance power drive\nEverybodys out on the run tonight but theres no place left to hide\nTogether wendy well live with the sadness\nIll love you with all the madness in my soul\nSomeday girl I dont know when were gonna get to that place\nWhere we really want to go and well walk in the sun\nBut till then tramps like us baby we were born to run","torrent":{"xt":"urn:btih:00947d0d3b4b524c5d3070db00d08e257ae2f617","amp;dn":"Bruce+Springsteen+-+Born+To+Run","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00947d0d3b4b524c5d3070db00d08e257ae2f617","infoHashBuffer":{"type":"Buffer","data":[0,148,125,13,59,75,82,76,93,48,112,219,0,208,142,37,122,226,246,23]},"announce":[],"urlList":[]}}