{"title":"The Mystic Art of Paul Laffoley","uid":5676147,"size":20245651,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:00e4232d824ba0504de388bc4f38c7a3a01fda03&amp;dn=The+Mystic+Art+of+Paul+Laffoley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":73,"time":1278535102,"description":"The Mystic Art of Paul Laffoley\n\n\n\nPaul Laffoley (born August 14, 1940) is a U.S. artist and architect. As an architect, Laffoley worked for 18 months on design for the World Trade Center Tower II. As a painter, his work is usually classified as visionary art or outsider art.\n\nWorks\n\nAs of 2004, Laffoley claims to have executed over 800 works. His work over the last forty years is a dizzying mix of precise architectural-quality painting and ideas (both societally accepted and far on the fringe) from ancient times to the present. Laffoley has called his work a blend of the purely rational, Apollonian impulse and the purely emotional, Dionysian impulse.\n\nBritish writer Michael Bracewell, in his collection of essays, when surface was depth, has made some particularly eloquent observations about his work, such as:\n\n&quot;If Laffoley's work within the Boston Visionary Cell can be said to have one principal preoccupation - a common denominator of his eclectic scholarship and practice - then that preoccupation would be to understand the process by which one goes from becoming to being.&quot;\n\nAnd:\n\n&quot;The Boston Visionary Cell, as a concretized manifestation of its inhabitant's work and preoccupations, describes the way in which a chaos of data - no less than a chaos of marble - can be sculpted by research to release the perfect forms within it.&quot;\n\nHe works in many types of media, including oil, acrylic, silkscreen, and pen and ink, and include both images and text. Lately he has concentrated on large paintings with sculptural and mixed media elements.\n","torrent":{"xt":"urn:btih:00e4232d824ba0504de388bc4f38c7a3a01fda03","amp;dn":"The+Mystic+Art+of+Paul+Laffoley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00e4232d824ba0504de388bc4f38c7a3a01fda03","infoHashBuffer":{"type":"Buffer","data":[0,228,35,45,130,75,160,80,77,227,136,188,79,56,199,163,160,31,218,3]},"announce":[],"urlList":[]}}