{"title":"Magic Butt - Interactive ass! Android","uid":7036531,"size":1539099,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:01c2f128619723be6bb27fcd17ab204c9f00232d&amp;dn=Magic+Butt+-+Interactive+ass%21+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cad40","files":1,"time":1329401716,"description":"A truly interactive live wallpaper: Magic Butt! Touch, stretch, rub &amp; shake it!\nA live wallpaper with a sexy girl that reacts to touching and shaking your phone or tablet.\nSee for yourself - watch the video!\nThe price is the lowest allowed by Android Market!\n________________________________________\nIMPORTANT: We've noticed that some users (maybe 5%) experience some problems. These are some types of errors that they get:\n1. LICENSE ERROR - please check your internet connection and Google account synchronization on the phone or tablet. The internet connection should be required only for the first launch.\nIf you still encounter this error, please contact us!\n2. Operation failed because of Market internal error.\n3. &quot;This application cannot be installed on your device&quot; - if you have an Android 2.1 and a touchscreen, Market should let you install the app! We've noticed this isn't related to particular phones or countries. It might be related to particular carriers or SIM card presence. You could also try logging into Market App on the phone using Wi-Fi connection. If it finally works for you, please let us know how you did it so we can update these instructions.\n4. Market's stuck on &quot;Downloading...&quot; - some users report that the wallpaper eventually gets installed later automatically (that's listed under the Market's known issues).\nWe've contacted Market support about problems 2 and 3 but they were unable to resolve them, just gave us some suggestions. You might want to try emailing them directly so we get more attention.\n________________________________________\nHOW TO LAUNCH:\nAfter you install Magic Butt, the OPEN option will be inactive - that's normal. All you have to do is:\n1. Press the HOME button. Launcher appears.\n2. Hold your launcher's background until a menu appears.\n3. Select 'Wallpapers'.\n4. Select 'Live wallpapers'.\n5. Select 'Magic Butt'.\n6. Select 'Set wallpaper'.\n7. Touch and shake that booty!\nIf you experience any problems, try above steps again, so the wallpaper relaunches.\nIf you still have any problems with Magic Butt, please contact us!\nHowever, first make sure that you have updated Magic Butt to the latest version.\n________________________________________\nIf you're a guy:\nTesting confirmed that Magic Butt makes girlfriends extremely jealous.\nIf you're a girl:\nTesting also confirmed that giving Magic Butt to a boyfriend gives the girl a chance to finally rest.\nSupports multitouch screen and accelerometer (for shaking).\nDoesn't ask for any unnecessary permissions.\nThere are no ads.\nIf you like it, install it and we get a free beer. Thanks! :)\nTransactions are handled by Google, so there's nothing to be afraid of.\nIf you like it - please rate it!\n________________________________________\nTESTED ON:\nHTC Wildfire S\nHTC Desire\nSamsung Galaxy S\nSony Ericsson Xperia neo V\nSony Ericsson Xperia arc S\nAsus Eee Pad Transformer (tablet)\nAndroid 2.2 Emulator\nAndroid 4.x (ICS) Emulator\nShould work on any device with Android 2.1 or higher without any problems. Android Market won't let you install it on an older Android version.\n________________________________________\nWhen you install Magic Butt, it is bound to your Google account, so you can use it on as many devices (Android phones and tablets) as you want to.\nCopy protection is disabled, so you can install Magic Butt on a device with root access.\nHowever, we use Android Market licensing service, so the internet connection is required during the first launch. Also, license is sometimes re-checked; we're not sure, how often would it be, because the whole process is managed by Google's Android Market licensing server.","torrent":{"xt":"urn:btih:01c2f128619723be6bb27fcd17ab204c9f00232d","amp;dn":"Magic+Butt+-+Interactive+ass%21+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01c2f128619723be6bb27fcd17ab204c9f00232d","infoHashBuffer":{"type":"Buffer","data":[1,194,241,40,97,151,35,190,107,178,127,205,23,171,32,76,159,0,35,45]},"announce":[],"urlList":[]}}