{"title":"Coast to Coast AM December 12 2012","uid":7917680,"size":56420308,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:02e28b2dbb5a747ca150d0bc5badc37c0c11e63e&amp;dn=Coast+to+Coast+AM+December+12+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":5,"time":1355403807,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-12-12\nHost: \tGeorge Noory\nGuests: \tL. A. Marzulli, Dr. John McDougall\n\nAuthor and researcher L.A. Marzulli discussed his ongoing work on his Watchers DVD-series (in collaboration with film producer Richard Shaw), and the various topics they investigated. They went into the lab with Dr. Roger Leir to examine a removed alien implant, and found under high magnification a substance coating the foreign object, as well as evidence that the implant had been connected to nerve endings. Marzulli speculates that the implants could be prototypes for the 'Mark of the Beast' prophesied in the Book of Revelation, and eventually presented to the populace as a kind of genetic upgrade that will increase lifespans.\n\nHe detailed prophecy expert Gary Stearman's inexplicable UFO encounter during a flight on his Cessna from Dallas to Lubbock, in which he heard a voice announce the presence of a UFO, and then saw a beautiful glowing metal object. He arrived four hours late, though the plane didn't contain enough gas for such a long trip. Marzulli conjectured that a kind of time/space displacement occurs when flying near certain craft. He also recounted his interviews with special effects expert Bob Williams, who concluded that the startling &quot;Skinny Bob&quot; footage of gray aliens posted on YouTube was faked.\n\nLooking into Planet X, Marzulli spoke with Marshall Masters who believes the rogue planet is heading our way and will cause a pole shift, and researcher Chris White who debunked the theory, and said &quot;second sun&quot; photos are simply lens flares. Marzulli also delved into cases of the Black-Eyed Children, in which people encounter sinister kids with completely black irises and sclera. A witness told him it was like &quot;looking down two dark corridors to a pool of evil below.&quot; He's concluded that these children are hybrids-- part of a breeding project by aliens/fallen angels. For more, check out a preview of Watchers 5.\nDiet &amp; Health\n\nFirst hour guest, author and Board certified internist Dr. John McDougall argued that a starch-based diet (rice, corn, potatoes, sweet potatoes, and beans, along with some fruit and vegetables) is the healthiest for people to consume, and that a vegetarian diet is actually associated with greater longevity, according to a recent study. He also spoke about a slight drop in the rate of childhood obesity, which he suggested was due to greater awareness of nutrition, bans on such items as trans fats, and government involvement. For more, check out a video of Dr. McDougall's recent TEDx presentation.\n\nNews segment guests: Glynis McCants, Mish Shedlock\nWebsite(s):\n\n    lamarzulli.net\n   \n    drmcdougall.com\n\nVideo(s):\n\n    Watchers 5-DVD Set\n\nBook(s):\n\n    The Starch Solution\n\n","torrent":{"xt":"urn:btih:02e28b2dbb5a747ca150d0bc5badc37c0c11e63e","amp;dn":"Coast+to+Coast+AM+December+12+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02e28b2dbb5a747ca150d0bc5badc37c0c11e63e","infoHashBuffer":{"type":"Buffer","data":[2,226,139,45,187,90,116,124,161,80,208,188,91,173,195,124,12,17,230,62]},"announce":[],"urlList":[]}}