{"title":"Sweet Sinner Filmography (2009)","uid":6676848,"size":16572330706,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:032936c7f5b8ff9d9e6b0a6eba3b665856de0232&amp;dn=Sweet+Sinner+Filmography+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nicanoelle","files":17,"time":1316061799,"description":"This torrent consists of the Sweet Sinner 2009 filmography. Enjoy.\n\n-----------------------\nThe Stepmother 1 (2009)\n-----------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-03-25\n\nStarring: Stephanie Swift, Michelle Lay, Jay Huntington, Johnny Castle, Alan Stafford, Ann Marie Rios, Tera Dice.\n\nDirector: Nica Noelle\n\nDescription:\nStepmothers have been associated with bad, even evil behavior. Which is why young Tera Dice is more than a little suspicious of Dad's hot, new wife (Michelle Lay). When Tera brings her fiancÃƒÂ©s Alan Stafford home to meet the family, Michelle can't hide her burning attraction to her young future son-in-law. \n\nWill husband Jay Huntington learn of Michelle's secret passion? Or will vengeful housekeeper Ann Marie have a different plan in store? Stephanie Swift costars in a scorching encounter with Johnny Castle, in this tale of seduction, forbidden desires, and passion.\n\nCategory: Couples, Erotica, Milf, Young.\n\n-----------------------\nThe Stepmother 2 (2009)\n-----------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-04-29\n\nStarring: Michelle Lay, Scott Styles, Jay Huntington, Alan Stafford, Ann Marie Rios, Tera Dice.\n\nDirector: Nica Noelle\n\nDescription:\nThe drama continues in part 2 of Sweet Sinner's tale of lust and deception, as troubled maid Sophie (Ann Marie Rois) sees a chance to seek revenge on trophy wife Delores (Michelle Lay). Will new husband Jim (Jay Huntington) be able to resist Sophie's charms? \n\nAnd how far will Jack (Alan Stafford) go to keep Sophie's mouth shut about his romp with Delores? In a final explosive showdown, find out which scheming beauty gets the upper hand once and for all.\n\nCategory: Couples, Erotica, Milf.\n\n\n-----------------------------\nMy Daughters Boyfriend (2009)\n-----------------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-05-20\n\nStarring: Trinity Post, Nina Hartley, Melissa Monet, Christian, Jay Crew, James Deen.\n\nDirector: Nica Noelle\n\nDescription:\nAs devoted wife and mother Melissa Monet enters middle-age, she finds herself struggling with a sudden lust for much younger men. When daughter Trinity brings home a new boyfriend, Melissa's attraction to the young man is as powerful as it is forbidden. \n\nWill her husband be able to save their marriage before it's too late? Or will she succumb to the sexiness of the younger man? I predict her urges will get the best of her and she'll get fucked like she hasn't in years!\n\nCategory: Couples, Erotica, Milf.\n\n------------------------\nNaughty Neighbors (2009)\n------------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-06-17\n\nStarring: Shayla La Veaux, Jay Crew, James Dean, Jandi Lin, Alex Mackay\n\nDirector: Nica Noelle\n\nDescription:\nMiddle aged couple Shayla and Jay are suffering from empty nest syndrome since their kids moved away. To spice up their lives, they rent out the back house to an artsy newlywed couple, James and Jandi Lin.\nBut the hot young couple wants more than just a place to stay, and Shayla and Jay are soon in way over their heads. Will Jay be able to resist the advances of hot Asian temptress Jandi? What will Shayla do when young James sets his sights on the sexy older blonde?\nAre the young hotties in love with the older couple, or is it all just a sick game? Shayla Laveaux, Jay Crew, James Deen, and Jandi Lin star in this tale of deception, seduction and sizzling hardcore sex.\n\nCategory: Couples, Erotica, Milf.\n\n------------------------\nOffice Seductions (2009)\n------------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-07-29\n\nStarring: Tyler Knight, Derrick Pierce, Darryl Hanah, Satine Phoenix, Misty Stone, Alan Stafford, Magdalena St. Michaels.\n\nDirector: Nica Noelle\n\nDescription:\nIt's not easy to work your way up the corporate ladder, and for ex-fetish model Satine Phoenix it's even harder. Will sexy copy boy Derrick Pierce expose the new secretary's secret past? Or is blackmail better suited for his purpose. Meanwhile, boss from hell Magdalene St. Michaels demands some late night help from gorgeous young Alan Stafford. Will hot wife Misty Stone get suspicious, or does she just want him to get the promotion? And ambitious blonde Darryl Hanah tries to impress CEO Tyler Knight with her dedication, but Tyler needs a &quot;special kind of assistant.&quot; Will Darryl prove her &quot;team spirit&quot; to her demanding boss? Seduction, lust and power plays abound in this new series by Sweet Sinner Video.\n\nCategory: Couples, Erotica, Milf.\n\n---------------------\nThe Babysitter (2009)\n---------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-08-12\n\nStarring: Ben English, Jay Crew, James Deen, Nicole Ray, Heather Silk, Magdalene St. Michaels.\n\nDirector: Nica Noelle\n\nDescription:\nMature married couple Jay and Magdalene have been in a rut since their kids were born, so they decide to call a babysitter and go out for a &quot;date night&quot;. The problem is, the couples new babysitter Nicole makes Jay crazy with lust. While they're out, Nicole invites boyfriend James Deen over to keep her company, and they have wild, hot sex on the older couple's couch. But is Nicole secretly lusting for Jay? She asks friend Heather Silk for advice, and Heather recalls her own sexy romp with Ben English. Will Nicole reveal her true feelings to Jay? Are Jay and Magdalene's marriage vows strong enough to fight his lust for Nicole? It's a tale of seduction, love, and age play.\n\nCategory: Couples, Erotica, Milf, Young.\n\n-----------------------\nMy Sisters Lover (2009)\n-----------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-09-30\n\nStarring: Kylie Ireland, Michelle Lay, Lindsay Meadows, Aaron Wilcox, Tyler Knight, Nick Manning.\n\nDirector: Nica Noelle\n\nDescription:\nTrophy wife Kylie Ireland is tired of being \nignored by ambitious, cheating husband Nick Manning. To stave off her loneliness, she invites younger sister Lindsey Meadows to move in. But when Lindsey brings home new boyfriend Tyler Knight, Kylie can't deny an overwhelming attraction to the gorgeous, African-American stud. Is the older redhead doomed to stay in a loveless marriage, or will she give in to her sexual temptation? When Lindsay's life takes an unexpected turn, Kylie knows it's now or never. Will she give up her pampered lifestyle with a man she doesn't love, or finally give in to her forbidden lust? Michelle Lay and Aaron Wilcox costar in this tale of deception, forbidden desires and true love.\n\nCategory: Erotica, Interracial, Milf.\n\n-----------------\nOpen House (2009)\n-----------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-10-21\n\nStarring: Michelle Lay, James Deen, Lexi Belle, Brittany O'Connell and Mark Davis.\n\nDirector: Nica Noelle\n\nDescription:\nReal estate agent Michelle Lay has a house to sell, and hot, young buyer James Deen wants more than a typical walk-through. But when Michelle's daughter Lexi Belle returns home with her new fiancÃƒÂ©e, Michelle realizes she just had sex with her son-in-law to be! Will she let Lexi marry a man who can't be trusted -- or will she keep their forbidden secret hidden? Meanwhile, Michelle's lesbian lover Brittany O'Connell is harboring secrets too, one of which includes Michelle's resentful ex-husband, Mark Davis. Deceptions abound in this tale of emotional and sexual intrigue, and the power of forbidden lust.\n\nCategory: Couples, Erotica, Milf.\n\n------------------------\nA Man With a Maid (2009)\n------------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-11-18\n\nStarring: Stephanie Swift, Ben English, Nicole Ray, Elexis Monroe, Magdalene St. Michaels, James Deen.\n\nDirector: Nica Noelle\n\nDescription:\nGentleman Jack (Ben English) holds a secret grudge against young, blonde maid Alice (Nicole Ray) and is awaiting the chance to take vengeance on the for her rejection of his advances. One rainy day he gets the opportunity - and ravishes the young virgin in an intense, emotion-filled scene that explodes off the screen. Intoxicated by their afternoon of lust, Jack and Alice set out to sexually liberate the repressed ladies around them. Their first &quot;victim&quot; is fellow maid Fanny (Stephanie Swift), followed by pushy, wealthy matron Mrs. Blunt (Magdalene St. Michaels) and her passive daughter Molly (Elexis Monroe). Jack's nephew (James Deen) gets in on the action in a sizzling 3-way (with Magdalene and Elexis). Vivid contract girl Nikki Jayne goes topless in a cameo role in this delightful tale of vengeance and lust -Victorian style.\nFilmed in a landmark Victorian mansion, with real period costumes and Elizabethan dialogue.\nBased on the classic erotic tale Man With a Maid. Script by Nica Noelle.\n\nCategory: Couples, Erotica.\n\n------------------\nThe Deviant (2009)\n------------------\n\nStudio: Sweet Sinner\n\nRelease date: 2009-12-16\n\nStarring: Kylie Ireland, Manuel Ferrara, Mr Pete, Elexis Monroe, Dana Dearmond.\n\nDirector: Nica Noelle\n\nDescription:\nSweet Sinner introduces adult superstar Manuel Ferrara in this riveting tale of deception, greed, and insatiable lust. Manuel suspects wife Kylie Ireland of secretly planning to divorce him, and he enlists good friend Mr. Pete to help him uncover the truth. But are Pete and Kylie unknowingly caught in an even bigger web of deception? And how will Manuel lure Pete's wife Elexis into his sick, twisted game? A psycho-sexual tale of suspence that will leave you breathless until the final explosive scene. Starring Manuel Ferrara, Kylie Ireland, Mr. Pete, Dana DeArmond, and Sweetheart Video contract star Elexis Monroe in her first boy/girl scene.\n\nCategory: Couples, Erotica.\n","torrent":{"xt":"urn:btih:032936c7f5b8ff9d9e6b0a6eba3b665856de0232","amp;dn":"Sweet+Sinner+Filmography+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"032936c7f5b8ff9d9e6b0a6eba3b665856de0232","infoHashBuffer":{"type":"Buffer","data":[3,41,54,199,245,184,255,157,158,107,10,110,186,59,102,88,86,222,2,50]},"announce":[],"urlList":[]}}