{"title":"My Family Seasons 1 &amp; 2","uid":4728176,"size":4053014528,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:034363593e80e0f38c1b6eb1af54e34dd0773a21&amp;dn=My+Family+Seasons+1+%26+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"argwonden","files":21,"time":1234861942,"description":"Great comedy!, 20 July 2004\nAuthor: Thomas Jolliffe (supertom-3) from Marlow, England\n\n\nMy Family is a great comedy. It's rare these days that a sitcom can stand the test of time but this has lasted 4 years all ready ad is still as funny as it was to start with, and it was funny to start with which is also important. It's very exaggerated but very much based in real life and everyone can see trademarks of their own families in the Harpers.\n\nThe characters are excellent and well portrayed. Firstly there's the mother played by Zoe Wannamaker, who as Jonathan Ross once said, has a strange kind of sexiness. She's the woman with the mad hair and a kind of Witch like, everything in the pot, attitude to cooking, with each episode having her come up with new disgusting recipes like Roast Chicken with chocolate topping. Then there's Ben Harper the father but not head of the household it must be said. Played superbly by another comedic veteran, Robert Lindsey. His sarcastic and biting delivery to everything is hilarious and the banter between him and Wannamaker is the centre piece of the show. Also superb is Kris Marshall as the eldest son Nick, the gormless, unemployable idiot who is the bane of his father's existence. Marshall plays him superbly and generally Nick has had some of the best scenes in the whole of the run. The most recent series was unfortunate as Marshall has reduced his role to an occasional cameo because essentially he is becoming too old to play the part. Marshall is 31 and Nick is only in his early 20's. Marshall can pass for that because I thought he was Nick's age but also at some point it is inevitable someone aspiring to be a respected actor would not want to become to related to a certain part and become typecast. Gabriel Thompson is also very good as the youngest Harper, the geeky Michael who throughout the series has grown into a sort of amoral shady businessmen, taking friends and family for mugs and making money off them. Daniella Denby Ashe plays the daughter and like Marshall is now an extended cameo. She's the bitchy, spoilt little IT girl who wants things for nothing and is now a mother herself. The newest family member is Abby played excellently by Siobhan Hayes who is another gormless idiot.\n\nThis is one of the finest examples of recent British sitcom and certainly relatable worldwide. Excellent stuff! \n","torrent":{"xt":"urn:btih:034363593e80e0f38c1b6eb1af54e34dd0773a21","amp;dn":"My+Family+Seasons+1+%26+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"034363593e80e0f38c1b6eb1af54e34dd0773a21","infoHashBuffer":{"type":"Buffer","data":[3,67,99,89,62,128,224,243,140,27,110,177,175,84,227,77,208,119,58,33]},"announce":[],"urlList":[]}}