{"title":"Canadas.Handyman.Challenge.S03E02.Winnipeg.HDTV.x264-CLDD","uid":9541486,"size":422335342,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0448eaf06dd138298fcf54ad3a9ee12ac21962b9&amp;dn=Canadas.Handyman.Challenge.S03E02.Winnipeg.HDTV.x264-CLDD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"duranie","files":1,"time":1391053713,"description":"Canadas.Handyman.Challenge.S03E02.Winnipeg.HDTV.x264-CLDD.mp4\n\nAirdate: January 28, 2014\n\n\n\nIn this episode, Host Jenn and Judges, Scott, Paul and Bryan travel to Winnipeg where they meet an exuberant group of contestants who &quot;pitch&quot; their pre-made plywood projects. The Judges select the ten best. The top ten's first challenge is to create a slingshot/catapult-type device that will launch a bag of sugar further than anyone else. The three contestants with the worst device or the shortest distance are going home. The remaining seven contestants must build a unique, properly functioning &quot;land canoe&quot; that will not only function, but support the judges, all with the materials provided. They have two and a half hours to build the structure and at the end three more contestants will be set packing. The remaining four are declared the Manitoba finalists.\n\n\n\n-----------------------------------------------------------------------\n\n\n\nABOUT THE SHOW:\n\nCanada's Handyman Challenge returns for a third season with more creative and resourceful challenges than ever before. This season HGTV Canada's biggest stars Bryan Baeumler (Leave It To Bryan, House of Bryan), Scott McGillivray (Income Property) and Paul Lafrance (Decked Out, Disater Decks) are on a nationwide search stopping in Calgary, Winnipeg, Toronto and Halifax to find Canada's top amateur handyman talent. Along with host Jennifer Robertson, the all-star judging panel will challenge contestants like never before as they whittle down the competition. With bragging rights on the line, the contestant that best handles the pressure and staves off elimination will walk away with the $25,000 prize. ","torrent":{"xt":"urn:btih:0448eaf06dd138298fcf54ad3a9ee12ac21962b9","amp;dn":"Canadas.Handyman.Challenge.S03E02.Winnipeg.HDTV.x264-CLDD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0448eaf06dd138298fcf54ad3a9ee12ac21962b9","infoHashBuffer":{"type":"Buffer","data":[4,72,234,240,109,209,56,41,143,207,84,173,58,158,225,42,194,25,98,185]},"announce":[],"urlList":[]}}