{"title":"Hoo.Tech.MIDI.to.MP3.Converter.v3.3.927-LAXiTY","uid":6461041,"size":7992050,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0463394d62b08df403e3e2a6f432e31253fc60f5&amp;dn=Hoo.Tech.MIDI.to.MP3.Converter.v3.3.927-LAXiTY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":5,"time":1307774677,"description":"HooTech MIDI to MP3 Converter 3.3.927\n\n\nMIDI to MP3 Converter converts MIDI to MP3. It's an ALL-IN-ONE audio converter that could convert more than 120 audio and video files to AAC, AAC for iPod/iPhone/iPad/iTunes/DSi, AC3, AIFF, ALAC, AMR, CAF, FLAC, M4A, M4B, M4R, MP2, MP3, MP4 (audio track), OGG, WAV, WMA, and so on. The software is full compatible with Vista and Windows 7.\n\nYou can change encoding parameters of target files such as sample frequency, bit rate, channels, and quality. MIDI to MP3 Converter could convert a large-size file to a smaller one. And, the software adds or keeps ID3 tag when converting. The software supports to change sound volume as well.\n\nMIDI to MP3 Converter also supports batch conversion. You can convert or resample a batch of files at a time.\n\nTop 10 Benefits of MIDI to MP3 Converter\n\nConvert WMA to MP3\nMIDI to MP3 Converter convert your MIDI files to MP3 format for playing them in your MP3 or iPod player.\n\nConvert MIDI to WAV\nIf you want to burn your MIDI onto a CD and play in your CD player you should convert them into WAV format first.\n\nConvert MIDI to M4R (iPhone Ringtone)\nYou could convert MIDI file to M4R that could be used in iPhone as ringtone.\n\nSupport more than 120 file formats\nMIDI to MP3 Converter is an ALL-IN-ONE audio converter that supports almost all audio and video files. And it's full compatible with Vista and Windows 7.\n\nID3 tag\nThe software supports to add, keep, or transfer ID3 tag such as title, artist, album, year, comment, and genre when converting or resampling.\n\nChange sound volume\nIf the sound of your files is too low or high, you can use the software to increase or decrease sound volume.\n\nSplit left and right channels into two files\nMany karaoke songs got the music on one channel and music + voice on the other channel, and this would be a way to create files with only music on both channels and also to create files with music + voice on both channels. You can get rid of a channel of a stereo file by the program.\n\nBatch conversion\nTo save your time, MIDI to MP3 Converter supports batch conversion. You can add multiple files, and then click &quot;Convert&quot; to convert all file in batch.\n\nOutput destination files to another folder and keep the original directory tree path\nIf you have bulk of files within different folders, and you want to convert them and output to another folder and keep the original tree path, you can use the feature we designed for you.\n\nNo experience of MIDI, MP3, and WAV necessary\n\nMIDI to MP3 Converter is very easy-to-use without knowledge of MIDI, MP3, and WAV files.\n\nHome Page - http://www.hootech.com/midi-to-mp3-converter/\n\n","torrent":{"xt":"urn:btih:0463394d62b08df403e3e2a6f432e31253fc60f5","amp;dn":"Hoo.Tech.MIDI.to.MP3.Converter.v3.3.927-LAXiTY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0463394d62b08df403e3e2a6f432e31253fc60f5","infoHashBuffer":{"type":"Buffer","data":[4,99,57,77,98,176,141,244,3,227,226,166,244,50,227,18,83,252,96,245]},"announce":[],"urlList":[]}}