{"title":"Nau Do Gyarah (1957) Xvid 2cd - No Subs - Dev Anand, Kalpana Kar","uid":11225206,"size":1476426444,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:04648e8f1f6af7742e32b079d87c2e3dab822c08&amp;dn=Nau+Do+Gyarah+%281957%29+Xvid+2cd+-+No+Subs+-+Dev+Anand%2C+Kalpana+Kar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1413427597,"description":"Nau Do Gyarah (1957) Xvid 2cd - No Subs - Dev Anand, Kalpana Kartik [DDR]\n\nNau Do Gyarah (English: Nine Two Eleven, the Hindi idiom means 'to run away') is a 1957 Hindi film produced by Dev Anand. \nThis was his brother, Vijay Anand's, directorial debut. The film stars Dev Anand, Kalpana Kartik, Madan Puri, Shashikala and Jeevan. \nThe film's music is by S. D. Burman and the lyrics are by Majrooh Sultanpuri.\n\nCAST:- Dev Anand, Kalpana Kartik, Shashikala, Jeewan, Lalita Pawar, Helen, Madan Puri, Tun Tun\n\nDirected and Written by Vijay Anand\nProduced by Dev Anand\nMusic by S.D. Burman\nLyricist: Majrooh Sultanpuri\nPlayback SIngers:- Asha Bhosle, Mohammed Rafi, Kishore Kumar, Geeta Dutt\n\nSongs are included in MP3 (Many thanks to Surjit)\nNau Do Gyarah (1957) 00. Title Music and Screen Credits, S.D. Burman\nNau Do Gyarah (1957) 01. Hum Hain Raahi Pyar Ke, Kishore Kumar, Majrooh Sultanpuri, S.D. Burman\nNau Do Gyarah (1957) 02. Kali Ke Roop Mein, Rafi, Asha, Majrooh Sultanpuri, S.D. Burman\nNau Do Gyarah (1957) 03. Aankhon Mein Kya J, Kishore Kumar, Asha, Majrooh Sultanpuri, S.D. Burman\nNau Do Gyarah (1957) 04. Aaja Panchhi Akela Hai, Rafi, Asha, Majrooh Sultanpuri, S.D. Burman\nNau Do Gyarah (1957) 05. Kya Ho Phir Jo Din Rangeela Ho, Asha, Geeta Dutt, Majrooh Sultanpuri, S.D. Burman\nNau Do Gyarah (1957) 06. Dhalki Jaye Chundariya Hamari, Asha Bhosle, Majrooh Sultanpuri, S.D. Burman\nNau Do Gyarah (1957) 07. Jane Jigar Haye Haye, Asha Bhosle, Majrooh Sultanpuri, S.D. Burman\nNau Do Gyarah (1957) 08. See Le Zuban, Geeta Dutt, Majrooh Sultanpuri, S.D. Burman\n\nSYNOPSIS:- Nau Do Gyarah (1957)\nThe film starts with Madan Gopal (Dev Anand) being thrown out of his house for not paying the rent. He goes to visit his friend, who has been helping him collect his mail, and finds a letter from his uncle, Manoharlal. Manoharlal writes that he is willing eleven lakh rupees (nine lakhs of cash and two lakhs worth of property), to Madan. It was originally willed to his sister-in-law's son, Kuldeep (Krishan Dhawan). After seeing Kuldeep's bad behaviour, though, Manoharlal decides to give the money to Madan.\n\nMadan promptly gets a truck and sets off for Bombay, and on the way, his friend drags him to a wedding. The two discuss the wedding, with Madan saying that if he was in the girl's place, he would run away. True enough, when an eavesdropping friend tells the bride, Raksha (Kalpana Kartik) that the groom, Surjit (Jeevan), she decides to run away and hide in Madan's truck.\n\nRaksha disguises herself as a Sikh boy with the psedonym of Sardar Nihal Singh and hides in his truck. Madan discovers &quot;him&quot; and the two quarrel nonstop, but Madan is compelled to take him along because the boy has money, food and water. The disguise soon comes loose and Sardar Nihal Singh is revealed to be a girl. Madan doesn't know her past, but the two of them fall in love, with Madan teasing her on several occasions, calling her a &quot;thief&quot;. Raksha, who was unhappy with her marriage, finally finds happiness travelling with Madan.\n\nWhen the two of them reach Bombay, Madan goes off to see his friend, Radheshyam (Madan Puri), but is informed that Manoharlal has died. A shocked Madan takes out the letter and finds out that it is a few months old. Radheshyam says that all the property has gone to Kuldeep and his mother (Lalita Pawar).\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: Xvid ISO MPEG-4\nVideo Bitrate: 856 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Hindi\nRunTime: 2:34:26\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 2:34:26","torrent":{"xt":"urn:btih:04648e8f1f6af7742e32b079d87c2e3dab822c08","amp;dn":"Nau+Do+Gyarah+%281957%29+Xvid+2cd+-+No+Subs+-+Dev+Anand%2C+Kalpana+Kar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04648e8f1f6af7742e32b079d87c2e3dab822c08","infoHashBuffer":{"type":"Buffer","data":[4,100,142,143,31,106,247,116,46,50,176,121,216,124,46,61,171,130,44,8]},"announce":[],"urlList":[]}}