{"title":"1994 - Deep Purple - Come Hell Or High Water - BSCD2","uid":10269303,"size":607042515,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04c8cadd6f96c04aea14d9a9348fe4a3ea34164e&amp;dn=1994+-+Deep+Purple+-+Come+Hell+Or+High+Water+-+BSCD2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"willemdevries","files":19,"time":1401557274,"description":"CD rip with art Blue specs this time for stunning sound.\n\n\n &lt;a href=&quot;\nhttp://bayimg.com/DAoKHAAFh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DAoKHAAFh&lt;/a&gt;\n\n\n\nCome Hell or High Water is a CD and DVD by the hard rock group Deep Purple. It was recorded on 16 October 1993 in &quot;Hanns-Martin-Schleyer-Halle&quot; in Stuttgart, Germany and in Birmingham on 9 November.\n\nThe album is one of the last to feature Ritchie Blackmore, as he quit after the concert on 17 November 1993 in Helsinki, Finland. He was replaced by Joe Satriani for the rest of the tour and later by Steve Morse.\n\nBlackmore's issues with the presence of a cameraman on his side of the stage at the start of the Birmingham concert prompted the guitarist to return to his dressing room until the cameraman was removed. This leads to a longer than usual 'guitar-free' intro into 'Highway Star' and several truncated guitar solo spots through the show. The rest of the band's dissatisfaction with the behavior of their soon to be departed guitarist is evident in their interviews on the DVD.\n\nThe CD features songs from the Stuttgart show, with the exception of &quot;Anyone's Daughter&quot;, taken from Birmingham.\n\nThe full concert versions of the Stuttgart and Birmingham shows were released in 2006 as a four CD box-set Live in Europe 1993 by Sony/BMG, each concert having its own gatefold sleeve and paper CD-liners. In 2007 each show had a separate release, in a jewel-case, but the Birmingham show was soon deleted, due to Ian Gillan's protest about it being re-released.","torrent":{"xt":"urn:btih:04c8cadd6f96c04aea14d9a9348fe4a3ea34164e","amp;dn":"1994+-+Deep+Purple+-+Come+Hell+Or+High+Water+-+BSCD2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04c8cadd6f96c04aea14d9a9348fe4a3ea34164e","infoHashBuffer":{"type":"Buffer","data":[4,200,202,221,111,150,192,74,234,20,217,169,52,143,228,163,234,52,22,78]},"announce":[],"urlList":[]}}