{"title":"WWE Smackdown vs Raw 2011 [PAL][Spanish][Wii][www.consolasatope.","uid":5918323,"size":4699980130,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:06ae875bd091dfb22cc2b1e54ed57335e161c103&amp;dn=WWE+Smackdown+vs+Raw+2011+%5BPAL%5D%5BSpanish%5D%5BWii%5D%5Bwww.consolasatope.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"consolasatope","files":3,"time":1288317238,"description":"El juego de lucha libre mÃƒÂ¡s vendido de todos los tiempos vuelve a marcar tus momentos finales de WWE, dÃƒÂ¡ndote mÃƒÂ¡s libertad y creatividad a la hora de tomar decisiones en tu camino por el Universo WWE.\n\nEn WWE SmackDown vs Raw 2011 los jugadores ahora mÃƒÂ¡s que nunca podrÃƒÂ¡n decidir su destino y experiencia de juego en un entorno WWE dinÃƒÂ¡mico y siempre cambiante. Durante tu recorrido, tus decisiones influirÃƒÂ¡n en los escenarios de juego, permitiÃƒÂ©ndote movimientos mÃƒÂ¡s espontÃƒÂ¡neos dentro y fuera del ring. Disfruta de un mayor nivel de interactividad que te permitirÃƒÂ¡ personalizar tu experiencia en el mundo WWE y controlar tus progresos en todas las nuevas campaÃƒÂ±as.\n\nWWE SmackDown vs Raw 2011 ofrecerÃƒÂ¡ a todos sus fans la oferta mÃƒÂ¡s grande de contenidos. Los jugadores cuentan con herramientas mÃƒÂ¡s creativas que nunca para personalizar sus Superestrellas, sus golpes mortales y diseÃƒÂ±os de historias. AdemÃƒÂ¡s, buscar y compartir contenido serÃƒÂ¡ mucho mÃƒÂ¡s fÃƒÂ¡cil con mejoras en la prestigiosa Comunidad WWE gracias a la funciÃƒÂ³n de Creaciones, que generÃƒÂ³ casi 10 millones de descargas, incluyendo mÃƒÂ¡s de 7,5 millones de superestrellas creadas, 500.000 diseÃƒÂ±os de historias y 500.000 golpes mortales en su debut como franquicia.\n\nSiempre representando la autentica WWE al 100%, WWE SmackDown vs Raw 2011 contarÃƒÂ¡ con uno de los planteles mÃƒÂ¡s extensos de luchadores, incluyendo mÃƒÂ¡s de 70 superestrellas y divas mÃƒÂ¡s populares de hoy en dÃƒÂ­a en la WWE . Cada Superestrella contarÃƒÂ¡ con nuevas texturas de la piel y una nueva tecnologÃƒÂ­a de movimiento, ofreciendo a las Superestrellas y Divas el aspecto y el movimiento mÃƒÂ¡s realista jamÃƒÂ¡s visto en un juego de la WWE. AdemÃƒÂ¡s, un nuevo sistema de simulaciÃƒÂ³n fÃƒÂ­sica asegurarÃƒÂ¡ que todos los encuentros y las interacciones entre los objetos aporten una sensaciÃƒÂ³n ÃƒÂºnica, dinÃƒÂ¡mica e indescriptible.\n\nHas visto a las mÃƒÂ¡s grandes superestrellas del momento en la programaciÃƒÂ³n de la WWE. Los has compartido y vivido a travÃƒÂ©s de la televisiÃƒÂ³n, en la web, y en el cuadrilÃƒÂ¡tero. Ahora, es el momento de definir tu propio momento WWE, en la experiencia mÃƒÂ¡s interactiva con el Universo de la WWE. Este es tu momento.\n\n","torrent":{"xt":"urn:btih:06ae875bd091dfb22cc2b1e54ed57335e161c103","amp;dn":"WWE+Smackdown+vs+Raw+2011+%5BPAL%5D%5BSpanish%5D%5BWii%5D%5Bwww.consolasatope.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06ae875bd091dfb22cc2b1e54ed57335e161c103","infoHashBuffer":{"type":"Buffer","data":[6,174,135,91,208,145,223,178,44,194,177,229,78,213,115,53,225,97,193,3]},"announce":[],"urlList":[]}}