{"title":"Mafia II  [R.Free][Multi5][Xbox360][Spanish][www.consolasatope.c","uid":6096240,"size":7139466590,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:077ad2c856bf03a57bf54e88dc663fcd66f8d65b&amp;dn=Mafia+II++%5BR.Free%5D%5BMulti5%5D%5BXbox360%5D%5BSpanish%5D%5Bwww.consolasatope.c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"consolasatope","files":72,"time":1294788451,"description":"\nPlataforma: Xbox 360\nNÃ‚Âº de Jugadores: 1\nOnline: Si\nGÃƒÂ©nero: AcciÃƒÂ³n y aventura\nDesarrollador: 2K Czech\nFabricante: 2K Games\nClasificaciÃƒÂ³n de juego: A partir de 18 aÃƒÂ±os\nVideo: Region Free\n\nMafia II es un juego de gran factura que permite adentrarnos en el implacable mundo de la Mafia y que incluye tiroteos espectaculares, peleas brutales y vertiginosas persecuciones en una experiencia cinematogrÃƒÂ¡fica propia de Hollywood. Disfruta con la fascinante historia de Vito Scaletta y su descenso al mundo del crimen organizado con Joe, su amigo de la infancia. Ambos intentarÃƒÂ¡n demostrar su valÃƒÂ­a ante la Mafia y labrarse una reputaciÃƒÂ³n en la calle. Para ello, Vito y Joe empezarÃƒÂ¡n con delitos de poca monta, como atracos y robos de coches, e irÃƒÂ¡n ascendiendo rÃƒÂ¡pidamente por el escalafÃƒÂ³n... aunque la vida de un mafioso no es tan glamurosa como parece.\n\nCaracteristicas\n\nEn MafiaÃ‚Â® II, Vito Scaletta ha empezado a labrarse una reputaciÃƒÂ³n en las calles de Empire Bay como tipo en el que se puede confiar para realizar &quot;trabajitos&quot;. Junto a su compaÃƒÂ±ero Joe, se estÃƒÂ¡ esforzando por demostrarle su valÃƒÂ­a a la Mafia, y estÃƒÂ¡ ascendiendo rÃƒÂ¡pidamente en el escalafÃƒÂ³n de la familia con crÃƒÂ­menes de mayores recompensas, estatus y consecuencias, pero... la vida de mafioso no es tan intocable como parece.\n\n * Juego repleto de acciÃƒÂ³n: Persecuciones automovilÃƒÂ­sticas de infarto, viscerales peleas cuerpo a cuerpo e intensos tiroteos... por eso y mucho mÃƒÂ¡s hay que pasar para convertirse en un hombre digno de la mafia.\n * Historia de gÃƒÂ¡ngsteres ÃƒÂ©pica: Los personajes y la presentaciÃƒÂ³n cinematogrÃƒÂ¡fica, con inspiraciÃƒÂ³n en la Mafia legendaria, consiguen cautivar a los jugadores para que les resulte imposible salir de esta oscura vida.\n * Mundo de Empire City: La II Guerra Mundial estÃƒÂ¡ en pleno apogeo en Europa, y la arquitectura, los coches, la mÃƒÂºsica y la ropa pertenecen todos a esa ÃƒÂ©poca. A medida que transcurre el tiempo, va apareciendo la moda de los aÃƒÂ±os 50 y podemos escuchar la mejor mÃƒÂºsica del momento que anuncia el nacimiento de una nueva era: la edad dorada de los gÃƒÂ¡ngsters americanos.\n * Banda sonora de la ÃƒÂ©poca: SumÃƒÂ©rgete en la Edad Dorada de Estados Unidos con la banda sonora de Mafia II, en la que se incluyen algunos de los artistas mÃƒÂ¡s influyentes del momento.\n","torrent":{"xt":"urn:btih:077ad2c856bf03a57bf54e88dc663fcd66f8d65b","amp;dn":"Mafia+II++%5BR.Free%5D%5BMulti5%5D%5BXbox360%5D%5BSpanish%5D%5Bwww.consolasatope.c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"077ad2c856bf03a57bf54e88dc663fcd66f8d65b","infoHashBuffer":{"type":"Buffer","data":[7,122,210,200,86,191,3,165,123,245,78,136,220,102,63,205,102,248,214,91]},"announce":[],"urlList":[]}}