{"title":"Lord Peter Wimsey - Murder Must Advertise","uid":6746739,"size":8198461487,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:077af8131ac378710337f21da1059780c4d04b2b&amp;dn=Lord+Peter+Wimsey+-+Murder+Must+Advertise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":3,"time":1318719825,"description":"&quot;There is something going on in the organization that is very undesirable and might lead to serious consequences,&quot; reads a note that the ill-fated Victor Dean wrote to his superior just before he took a fatal fall down the metal staircase at Pym's Publicity Ltd. These darned suspicious circumstances lead Pym to hire Lord Peter Wimsey to determine whether Dean's death was an accident or murder or eh, what? Ian Carmichael returns in his signature role as Dorothy L. Sayers's aristocratic sleuth in this characteristically impeccable 1973 BBC miniseries. The chaotic advertising agency is a ripe setting for intrigue (Sayers herself worked in a prominent London ad agency in the 1920s). Wimsey has a high time masquerading incognito as the firm's new copywriter, as well as the mysterious costumed Harlequin, a ruse he adopts to obtain information from the notorious socialite Dian de Momerie (Bridget Armstrong), whose lovers (Dean, among them) all come to bad ends, and whose den of iniquity is fronted by Major Milligan (Peter Bowles, of To the Manor Born), a drug dealer who corrupts bright young things.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:077af8131ac378710337f21da1059780c4d04b2b","amp;dn":"Lord+Peter+Wimsey+-+Murder+Must+Advertise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"077af8131ac378710337f21da1059780c4d04b2b","infoHashBuffer":{"type":"Buffer","data":[7,122,248,19,26,195,120,113,3,55,242,29,161,5,151,128,196,208,75,43]},"announce":[],"urlList":[]}}