{"title":"Epicnor Rigby - No Audible Dialogue","uid":10400113,"size":5202671,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:07bf92c1cf3cf644e1853b1cae3462c429719ecc&amp;dn=Epicnor+Rigby+-+No+Audible+Dialogue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"noad1818","files":-1,"time":1403348244,"description":"Hello again Pirate Bay users! My name is Isaac Benjamin. I am a music composer and producer, as well as a game developer. I currently just released a single on Bandcamp for fifty cents (That was as low as they would let me make it) that is an incredibly epic remix of the Beatles song Elinor Rigby. \n\nI have a soundcloud under my artist and &quot;company&quot; name &quot;No Audible Dialogue&quot; where over 90% of what I make is released for free. This is one of the few songs I've tried charging for. \n\nIf you can spare anything for the track after listening to, and wanting to keep it it would mean a lot if you show you're support in one of two ways by doing the following: \n\n1) Search &quot;No Audible Dialogue&quot; into Google, don't worry I'll show up in the top results, my Soundcloud and Bandcamp are usually the top hits. \n\n2) When you arrive at the Bandcamp get the song official and pay whatever you think it's worth. The 50 cents or whatever it's up to you. They let you pay more if you want. Or, the next option - nothing but sharing on social media site. \n\n3) (Optional) Don't pay but keep you're Torrent download and share the Bandcamp or Souindcloud link on Facebook or twitter or something. That would mean just as much as paying for it, honestly. It's about people heari and enjoying the music at the core of it. \n\nLastly please seed back. Really it's so important you have no idea. If you look at my other torrents here they all died because people kept leaching over and over and I was go over my bandwidth limits because of it. Thankfully this is a small torrent, but please, have a heart a seed back the 7mb lol. \n\nEnjoy the song and please do check out my other work! Looking forward to talking to some of you guys! ","torrent":{"xt":"urn:btih:07bf92c1cf3cf644e1853b1cae3462c429719ecc","amp;dn":"Epicnor+Rigby+-+No+Audible+Dialogue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07bf92c1cf3cf644e1853b1cae3462c429719ecc","infoHashBuffer":{"type":"Buffer","data":[7,191,146,193,207,60,246,68,225,133,59,28,174,52,98,196,41,113,158,204]},"announce":[],"urlList":[]}}