{"title":"Lego Batman [PAL] [WiiTorrentZ]","uid":5270640,"size":3028147089,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:086afe5eba48711ec8caab8dfa17e444f8f21b44&amp;dn=Lego+Batman+%5BPAL%5D+%5BWiiTorrentZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ecabuk","files":-1,"time":1263043145,"description":"NAME: Lego Batman\nLANG: MULTI5\nREGION: PAL\nSIZE: 99mb x 29\n      17mb x 1\n      \n      Total:2.81GB\n\n\nProduct Description\n\nThe villains are on the loose\n\nTake control of the Dynamic Duo, Batman and Robin, as you build, drive, swing, and fight your way through Gotham City capturing escaped villains and putting them back in Arkham Asylum where they belong. Battle against legendary villains including The Joker, The Penguin, Catwoman and more to keep the streets of Gotham clean. Then, for the first time, jump into the story from the other side and play as Batman's foes. Enjoy the power you wield as you spread chaos throughout the city.\n\n\nKey Features\n\nFight for justice as Batman and Robin or create chaos as The Joker, Catwoman and other villains, as you save or destroy Gotham City.\nRocket through sewers and bound across rooftops as you take the fight to the criminals across classic locations in Gotham City.\nFight on land, sea and in the air using a number of powerful Batman, Robin and villain-controlled vehicles, including the rocket-powered Batmobile, sleek Batboat and stealthy Batwing\nEnhance the abilities of the Dynamic Duo with all new power suits, including the Magnetic Suit\nEnjoy numerous game modes and levels:\n-Play through the game in Story Mode from both the hero and villain sides \n-Replay any level in Freeplay Mode with any characters you've unlocked. Access previously hidden areas to find additional rewards and bonus content \n-Collect LEGO studs and special LEGO bricks throughout the game to unlock tons of extra content including special power-ups and bonus levels","torrent":{"xt":"urn:btih:086afe5eba48711ec8caab8dfa17e444f8f21b44","amp;dn":"Lego+Batman+%5BPAL%5D+%5BWiiTorrentZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"086afe5eba48711ec8caab8dfa17e444f8f21b44","infoHashBuffer":{"type":"Buffer","data":[8,106,254,94,186,72,113,30,200,202,171,141,250,23,228,68,248,242,27,68]},"announce":[],"urlList":[]}}