{"title":"Wild.Ireland.Series.1.3of6.720p.HDTV.x264.AAC.MVGroup.org","uid":11945846,"size":550390045,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:08fb8effcc12a405dc4dd69ab87e3261dd44da90&amp;dn=Wild.Ireland.Series.1.3of6.720p.HDTV.x264.AAC.MVGroup.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"artistharry","files":1,"time":1432075054,"description":"Wild Ireland (ITV)\n\nNature, Travel Documentary hosted by Christine Bleakley, published by ITV in 2015 - English narration \nalso known as\n*\n &lt;a href=&quot;\nhttp://docuwiki.net/images/2/2c/Wild-Ireland-ITV-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/2/2c/Wild-Ireland-ITV-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nWild Ireland\nWild Ireland is a six-part series which sees presenter Christine Bleakley going home to Ireland to travel the length of its 1500 mile west coast - the longest continuous coastal route - known as the Wild Atlantic Way. \nDuring the series, Christine will meet a host of fascinating characters, discover a landscape of natural wonders and reveal the coastline's hidden treasures as she explores the entire route from Malin Head in the north, to Clonakilty in the south.\nStarting at the most northerly point of the island, where Christine learns the story of how Ireland first got its name, she then drives, bikes, hikes, swims and kayaks her way along the coastline. On her travels, Christine visits numerous historical sites, takes on some extreme sports, learns about harvesting and preparing local food delicacies and introduces the viewer to some of the most spectacularly landscapes and fascinating history in the world. \nFrom climbing Knocknarea Mountain and visiting a large Cairn older than the Pyramids, to learning how to prepare wild salmon; from trying to master the wild Atlantic waves which attracts surfers from around the world, to joining star-gazers at Dark Sky Reserve - one of only three locations in the world that is free of light pollution, Christine offers a captivating commentary on the Wild Atlantic Way.\n\n\n1)  Part 1 \nIn episode one, Christine heads to Louisburgh in County Mayo to experience 'coasteering' - a mixture of swimming, climbing and cliff jumping. After practicing her cliff-jumping technique on smaller cliffs, Christine reaches the edge of a 25ft vertical drop into the cold Atlantic Ocean. A nervous Christine watches the rest of the group complete the jump before tackling it for herself, saying: &quot;I purposely didn't look over the edge until the very last second, and now that I have done it's put me completely off. I have not got the courage to go first. It's ridiculously high.&quot;\n\n2)  Part 2 \nChristine Bleakley climbs Knocknarea Mountain in Co Sligo, learns how to cut turf, explores sea arches and caves by kayak, and visits Blacksod Lighthouse on the Mullet Peninsula in Co Mayo, as she continues her exploration of the 1,500-mile Wild Atlantic Way on the west coast of Ireland.\n\n3)  Part 3 \nChristine follows the pilgrims' trail to Croagh Patrick, Ireland's holy mountain, which many people traditionally climb barefoot. She also enjoys a surfing lesson, visits the fjord of Killary Harbour on the border between Co Galway and Co Mayo, and helps out on a mussel farm for the day.\n\n4)  Part 4 \nOn the fourth leg of her journey, Christine learns to sail on a classic fishing boat, the Galway Hooker, and visits Ireland's most popular natural attraction - the Cliffs of Moher in Co Clare, which tower above the Atlantic. She also travels by ferry to the Aran Islands, where she explores the landscape riding a traditional pony and trap.\n\n5)  Part 5 \nOn leg five of her journey along the 1,500-mile-long Wild Atlantic way, Christine Bleakley reaches Co Kerry, where she kayaks out into the Dingle bay in search of the famed dolphin, Fungie. Later, she explores the country's love of horse riding with a lesson on the beach, before staying up late to join a band of local star-gazers at the Dark Sky Reserve.\n\n6)  Part 6 \nChristine Bleakley travels across open ocean in Ireland's only cable car, before exploring the treacherous waters of Mizen Head, where she joins the coastguard for a day. Finally, she casts her line to catch some fish as her 1500-mile journey along the longest continual coastal route comes to an end.\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1c54757b745c5028322d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3174 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/sVBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 25mins\n * Framerate: 25 fps\n * Number of Parts: 6\n * Container Mp4\n * Part Size: 545 MB\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:08fb8effcc12a405dc4dd69ab87e3261dd44da90","amp;dn":"Wild.Ireland.Series.1.3of6.720p.HDTV.x264.AAC.MVGroup.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08fb8effcc12a405dc4dd69ab87e3261dd44da90","infoHashBuffer":{"type":"Buffer","data":[8,251,142,255,204,18,164,5,220,77,214,154,184,126,50,97,221,68,218,144]},"announce":[],"urlList":[]}}