{"title":"Dewey Redman - 1992 - Choices FLAC","uid":11285614,"size":285760497,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:09c205b0aa35f1d0253d2ebf3cf6203780dd4c77&amp;dn=Dewey+Redman+-+1992+-+Choices+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"eika256","files":-1,"time":1414273996,"description":"Dewey Redman - 1992 - Choices\n\nThis is a curious set for saxophonist Dewey Redman, featuring a killer band that includes bassist Cameron Brown, drummer Leon Parker, and the first appearance of his son, Joshua, on tenor in duet on a couple of tracks. Redman himself is in fine form, playing with all of the deep, steamy lyricism he showcased so brilliantly with Ornette Coleman and in Old and New Dreams, but there is something else too, as evidenced by the track selection, and that is a new reverence for the tradition. Redman was always a melodic player, even in his most fiery avant encounters, but his love for jazz tradition, particularly its formalist considerations, was never really apparent until now. Here Redman selects the nugget &quot;Everything Happens to Me&quot; as the place to showcase his reverential balladic style. Over the course of ten minutes, he allows the hidden blues in the tune to come out and haunt him as he explores each nuance with minimal accompaniment. Also, the Van Heusen nugget &quot;Imagination&quot; is read here with such eloquence, grace, and heartbreaking sensitivity that it's almost a blues. The melodic invention Redman displays here makes this version a contender for being the definitive one. The Eastern edge is here in &quot;O'Besso,&quot; with Joshua playing tenor and Dewey playing musette. It begins as a modal Eastern theme onto which the changes are gradually built. The melody seeps out, almost unexpectedly, and becomes a flower of interwoven harmonic figures traded between father and son. There's also plenty of the traditional Redman fire in place too, such as on &quot;Le Clit,&quot; the original that was supposed to be recorded for the 1980/1981 sessions he did with Pat Metheny. Whether it was or not is anybody's guess, but it has never surfaced if it was. Here Dewey and Joshua, on alto and tenor, respectively, trade eights in the bridge between their solos and come to grips with a monster of their own creation -- deeply lyric, yes, but also fathomlessly dark and brooding. Finally, Redman's &quot;For Mo&quot; features both men on tenor and it's more of a dovetailing ride than a battle, which is as it should be. The singing goes deep here and Parker and Brown push the pair into corners of rhythmic invention that demand resolution. This is a wonderful and unexpected surprise from Dewey and a welcome entrance onto the scene from Joshua. (AllMusic)\n\nTrack list:\n01 - Le Clit\n02 - Everything Happens To Me\n03 - O Besso\n04 - Imagination\n05 - For Mo\n\nPersonnel:\nDewey Redman - tenor saxophone, alto saxophone, musette\nJoshua Redman - tenor saxophone\nCameron Brown - bass\nLeon Parker - drums\n\nXLD rip, not EAC.\nEnjoy and share!","torrent":{"xt":"urn:btih:09c205b0aa35f1d0253d2ebf3cf6203780dd4c77","amp;dn":"Dewey+Redman+-+1992+-+Choices+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09c205b0aa35f1d0253d2ebf3cf6203780dd4c77","infoHashBuffer":{"type":"Buffer","data":[9,194,5,176,170,53,241,208,37,61,46,191,60,246,32,55,128,221,76,119]},"announce":[],"urlList":[]}}