{"title":"The Croods.avi","uid":8296820,"size":365800560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a3cafd9cad90e5cc5dd4ff8d4b719ce632a0ee6&amp;dn=The+Croods.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1364163316,"description":"* AVI XVID  * CAM  * 01H30M18S  * 640x400  * 20 frames  * Audio: mpga48000Hz 128kb/s\n\n\n\n* Plot :\n\nThe film starts with Eep (Emma Stone), a girl in a family of Neanderthal Cavemen (homo neanderthalensis) living in pre-historic times, talking about how her family is one of the few to survive nearby, mainly due to the strict rules of her overprotective father Grug (Nicolas Cage). When in their cave home, Grug tells a story to the rest of the family which includes his wife Ugga (Catherine Keener), his daughter Sandy (Randy Thom), his son Thunk (Clark Duke), and his mother-in-law (Cloris Leachman) with a character that mirrors Eep's curious nature. He uses this story to warn the family that exploration and 'new things' pose a threat to their survival. This irritates the bored and adventurous Eep, and when the family falls asleep after dark, she ignores her father's advice, and leaves the cave.\n\nWhile venturing off, she meets Guy (Ryan Reynolds), an intelligent caveboy (homo sapien). She becomes fascinated with the fire he manages to create and is eager to learn more. He tells her about his theory that the world is reaching its 'end,' before giving her a noise-making horn to call him if she feels the need for help. He then abandons Eep, who is then caught by Grug (who had been frantically searching for her). Much later, he brings her back home, only to find that their cave home has collapsed from an earthquake. All the family then climb over the wreckage to discover an other-worldly land, much different from their usual surroundings of rocky terrain.\n\n\n\n* enjoy ...","torrent":{"xt":"urn:btih:0a3cafd9cad90e5cc5dd4ff8d4b719ce632a0ee6","amp;dn":"The+Croods.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a3cafd9cad90e5cc5dd4ff8d4b719ce632a0ee6","infoHashBuffer":{"type":"Buffer","data":[10,60,175,217,202,217,14,92,197,221,79,248,212,183,25,206,99,42,14,230]},"announce":[],"urlList":[]}}