{"title":"L'Homme irrationnel FRENCH DVDRiP x264 2015","uid":13106292,"size":567735034,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a9b31b85bbbaa74a8b64d30945720ccbd89e084&amp;dn=L%27Homme+irrationnel+FRENCH+DVDRiP+x264+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"annuaireweb","files":1,"time":1451296329,"description":"Irrational.Man.2015.FRENCH.BDRiP.x264-AViTECH\r\n\r\nProfesseur de philosophie, Abe Lucas est un homme dévasté sur le plan affectif, qui a perdu toute joie de vivre. Il a le sentiment que quoi qu’il ait entrepris - militantisme politique ou enseignement - n’a servi à rien.Peu de temps après son arrivée dans l’université d’une petite ville, Abe entame deux liaisons. D’abord, avec Rita Richards, collègue en manque de compagnie qui compte sur lui pour lui faire oublier son mariage désastreux. Ensuite, avec Jill Pollard, sa meilleure étudiante, qui devient aussi sa meilleure amie. Si Jill est amoureuse de son petit copain Roy, elle trouve irrésistibles le tempérament torturé et fantasque d’Abe, comme son passé exotique. Et tandis que les troubles psychologiques de ce dernier s’intensifient, Jill est de plus en plus fascinée par lui. Mais quand elle commence à lui témoigner ses sentiments, il la rejette. C’est alors que le hasard le plus total bouscule le destin de nos personnages dès lors qu’Abe et Jill surprennent la conversation d’un étranger et s’y intéressent tout particulièrement. Après avoir pris une décision cruciale, Abe est de nouveau à même de jouir pleinement de la vie. Mais ce choix déclenche une série d’événements qui le marqueront, lui, Jill et Rita à tout jamais","torrent":{"xt":"urn:btih:0a9b31b85bbbaa74a8b64d30945720ccbd89e084","amp;dn":"L%27Homme+irrationnel+FRENCH+DVDRiP+x264+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a9b31b85bbbaa74a8b64d30945720ccbd89e084","infoHashBuffer":{"type":"Buffer","data":[10,155,49,184,91,187,170,116,168,182,77,48,148,87,32,204,189,137,224,132]},"announce":[],"urlList":[]}}