{"title":"Jack Katz - The First Kingdom","uid":8675958,"size":1001311171,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0b777cb66f25c5907fb64a394d1a4dabb100077a&amp;dn=Jack+Katz+-+The+First+Kingdom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1373593565,"description":"Issues 1-24 of 'The First Kingdom'\n\nComics &amp; Comix Co./Bud Plant, 1974-1986, (approx.) 768 pages\n\nWritten and Illustrated by Jack Katz\n\nIssues 1-6 are a scan of my personal copy of the over-sized Wallaby Pocket Books edition from 1978. The rest of the issues have been restored (image correction and re-sizing) so they maintain the same look and page size throughout. \n\n----------------------------------------------------------------------------------------\n\nMoving to California in the early 1970s led to Katz's introduction to underground comics. Through independent publishing he saw the potential to create his own story without editorial interference. The First Kingdom is a 24-issue, 768-page graphic novel that took Katz twelve years to complete, outside of writing the story. He finished two books per year, intentionally totaling twenty-four in order to mirror the number of books in Homer's Iliad and Odyssey. During Kingdom's creation, many sacrifices were made and harships endured by Katz and his wife at the time, Carolyn. For this reason, every issue is dedicated to her.\n\nThe epic was published by Comics &amp; Comix Co. from 1974 to 1977, at which point publication was taken over by Bud Plant (a Comics &amp; Comix co-founder) and completed in 1986. Early praise for Kingdom came from Playboy magazine and the Rocket's Blast Comicollector fanzine, but it was never a commercial success due in part to the frequency with which it came out and its adult content. Another contributing factor may have been that Kingdom was sold strictly through mail-order and specialty comic stores.\n\nAttempts have been made to reissue Kingdom as collected volumes. Wallaby Pocket Books published a large-format version of the first six books in 1978. In 2005, Century Comics (under its former name, Mecca Comics Group) released the first volume of an anticipated four-volume set, collecting issues 1-6. The second volume collected issues 7-12 and followed months later, but Century Comics went out of business before it could publish the final two volumes. In May of 2013, Titan Comics announced plans to reprint the series in six volumes, remastered from the original art and re-lettered. (REALLY hoping this actually happens! Right now Vol 1-3 are available for pre-order on Amazon with release dates of Sep &amp; Dec, 2013 and Mar, 2014.)\n\nContinued below...","torrent":{"xt":"urn:btih:0b777cb66f25c5907fb64a394d1a4dabb100077a","amp;dn":"Jack+Katz+-+The+First+Kingdom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b777cb66f25c5907fb64a394d1a4dabb100077a","infoHashBuffer":{"type":"Buffer","data":[11,119,124,182,111,37,197,144,127,182,74,57,77,26,77,171,177,0,7,122]},"announce":[],"urlList":[]}}