{"title":"FS2004 - Adobe AI Traffic Pack (full with TANTRiS GA+Mil Addon).","uid":3513204,"size":430030694,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0bdda0c7d4fb62819edbee3005f46e62f1158949&amp;dn=FS2004+-+Adobe+AI+Traffic+Pack+%28full+with+TANTRiS+GA%2BMil+Addon%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rrodger99","files":1,"time":1155794753,"description":"Thanks to MoBig for the great post.\n\nAdobe AI Package.\n\nThis includes the Tantris Gen Av &amp; Military addon.\n\nFrom the description from usenet:\n\nCheck this out.  I have used EVERY single commercial AI traffic \npackage out there: Ultimate Traffic, Traffic 2005, MyTraffic 2004, \nMilitary AI Traffic, LiveTraffic, blah blah blah.  But last time I \nre-installed FS9, I decided to do something different and take a \nchance on a little freeware package that I had heard about on the \nAvsim forums: the Adobe AI Traffic Package.\n\nAVSIM buried all the posts about it because some enterprising \nKoreans (bless &amp;#039;em) had put together what was supposedly the finest \ntraffic package with only the best, most frame-rate friendly models \nand called it &quot;Adobe AI&quot; (they also made an addon for GA and \nMilitary Traffic called the &quot;Tantris&quot; package).  The AVSIM forum \nmoderators buried all this info because these Koreans had used all \nthe best models from AI-Aardvark and other freeware AI packages and \nstuck them together into one, no-brainer installation.  To me, this \nmade sense as for years the only way to get these kinds of models \ninto FS9 was to learn all this complicated AI scripting and copying-\nand-pasting of AI flight plans, creating bunches of subfolders, \nediting config files.... that&amp;#039;s why most people didn&amp;#039;t do it and \nopted for a simpler commercial traffic package. The people at \nProjectAI, AI-Aardvark screamed bloody murder that their creativity \nwas being violated; I just thought that it was great the vast \nmajority could finally use all those great models without having to \nattain a Ph.D. in FS9 trafficology. :)\n\nAnyway, since my install was fresh and there wasn&amp;#039;t any risk of \nmessing a bunch of stuff up, I installed the Adobe package.\n\nOh my god... it was night and day compared to ANY of the commercial \ntraffic packages.  The traffic was wide and varied, the models were \nof a quality I had never seen, and I had MORE traffic at every \nairport than I had with any of the commercial packages.  I have to \ntell you: everytime you see a screenshot with fantastic AI on the \nscreenshot forums, I can assure you that those people are using the \nAdobe traffic package.  It&amp;#039;s a well-kept secret and no one gives it \naway since the subject was buried.\n\nI don&amp;#039;t use anything else; and I guarantee you -- if you&amp;#039;ve had \nexperience with other packages -- that you won&amp;#039;t need anything else.  \nAnd, amazingly, it&amp;#039;s free, simple to install, and no headaches. My \nhunch is that it wasn&amp;#039;t just the freeware AI model creators that \nwent nuts; it was the commercial AI developers who put pressure on \nAVSIM to kill all posts with any links to Adobe AI. :)  Yes, \nMartha... developers do that and AVSIM caves in to that stuff. \n\nLong post. :)  Hope it helps.\n\nRegards,\n\n- Mo.\n\n\n====================== Not Tested Download at your on risk ===================","torrent":{"xt":"urn:btih:0bdda0c7d4fb62819edbee3005f46e62f1158949","amp;dn":"FS2004+-+Adobe+AI+Traffic+Pack+%28full+with+TANTRiS+GA%2BMil+Addon%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bdda0c7d4fb62819edbee3005f46e62f1158949","infoHashBuffer":{"type":"Buffer","data":[11,221,160,199,212,251,98,129,158,219,238,48,5,244,110,98,241,21,137,73]},"announce":[],"urlList":[]}}