{"title":"WPS Office 10.1.0.5507 Premium Portable by BurSoft (2016) Eng/Ru","uid":13891696,"size":76526904,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0d2314814772fb2896b599eec5a38a9d7e936ec6&amp;dn=WPS+Office+10.1.0.5507+Premium+Portable+by+BurSoft+%282016%29+Eng%2FRu&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1458217662,"description":"WPS Office 10.1.0.5507 Premium Portable by BurSoft (2016) Eng/Rus\r\n\r\nWPS Office - office suite is a set of the most essential tools. The program is a valuable alternative to the standard Microsoft Office office suite. The package includes three programs: a word processor Kingsoft Writer for word processing, spreadsheet Kingsoft Spreadsheets to work with spreadsheets and a tool for creating presentations Kingsoft Presentation. All of these programs can be a full replacement for Microsoft Office, since it is fully compatible with the formats (docx, xlsx, ppts ...).\r\nAdditional Information\r\nThe main features of WPS Office:\r\nFully compatible with Microsoft PowerPoint, Word and Excel (97/2000/2003/2007/2010/2013)\r\nSupport for * .doc, * .docx, * .xlsx; * .XLS, * .DBF, CSV, PPT, PPTX, TXT, etc.\r\nEasily switch between open documents using the Tabs priority function\r\nQuick exchange of e-mail documents\r\nDocument protection with encryption\r\nNot large size of the program\r\nAdditional language packs available for spell checking\r\nAutosave documents\r\nExport to PDF-File;\r\nCoding before saving;\r\nPreparing to print multiple new documents;\r\nSupport for OLE Automation\r\nPackage Contents:\r\nKingsoft Office (KSOffice) Writer: tool for creating professional-looking documents. It can open Microsoft Word files or save your documents in Word files. It allows you to open, view and edit documents in different file formats, as well as the latest Word files (. DOCX).\r\nFamiliar style, layout, and functionality such as in Microsoft of Office, which means that you can easily move the Microsoft Office environment between Writer and Kingsoft Writer. Moreover, Kingsoft Office 2012 provides powerful features such as built-in PDF conversion, Document Tab Switching, choice of various print, cross-references, and an integrated Google Search toolbar which are not available with Microsoft Office.\r\nKingsoft Office (KSOffice) Presentation: helps you create multimedia presentations using creative approach to meet customer needs. It can open, edit and save as *. PPT, PPS *, * files (template) and support *. PPTX file (Microsoft Office 2007).\r\nIt is fully interoperable, allowing you to save presentations saved in Power Point format and PDF-format effortlessly. Kingsoft Presentation offers a unique function in the dual-screen environment.\r\nKingsoft Office (KSOffice) Spreadsheet: You can open edit and save *. XLS, *. hee (templates) *. DBF, *. txt, *. CSV, and is compatible with *. XLSX files (Microsoft Office 2007). This gives you more efficiency and flexibility to accomplish your goals.\r\nIt contains a variety of functions and array formulas that helps you manage, analyze and calculate data easier and faster. It provides eight types of encryption RC4, which is very difficult to decipher. Thus, it is possible to protect the document against copying your changes.\r\n\r\n\r\n\r\nDeveloper: KINGSOFT Office Software\r\nLanguage: English + Russian\r\nCrack:Not required","torrent":{"xt":"urn:btih:0d2314814772fb2896b599eec5a38a9d7e936ec6","amp;dn":"WPS+Office+10.1.0.5507+Premium+Portable+by+BurSoft+%282016%29+Eng%2FRu","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d2314814772fb2896b599eec5a38a9d7e936ec6","infoHashBuffer":{"type":"Buffer","data":[13,35,20,129,71,114,251,40,150,181,153,238,197,163,138,157,126,147,110,198]},"announce":[],"urlList":[]}}