{"title":"Inspired Philanthropy: Your Step-by-Step Guide to Creating a Giv","uid":6435696,"size":1601093,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ee479f8b3b3ee5fe5bfcbc2facd3af7714e73cb&amp;dn=Inspired+Philanthropy%3A+Your+Step-by-Step+Guide+to+Creating+a+Giv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":3,"time":1306801531,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51mFf-jIDXL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51mFf-jIDXL._SS500_.jpg&lt;/a&gt;\n\n\n\n\n\n\n\n[\n\n\nInspired Philanthropy: Your Step-by-Step Guide to Creating a Giving Plan and Leaving a Legacy \n\n\n\nPublisher: Jossey-Bass\nTracy Gary\n3 Edition (November 16, 2007) \nISBN-10: 0787996521 \nISBN-13: 978-0787996529 \n336 Pages \nPDF \n1.48 MB\n\n\n\nThis newest edition of the classic book shows how anyone can align and integrate values, passions, and dreams for their communities and families into their plans. Inspired Philanthropy explains how to make a difference by creating giving and legacy plans, tells what questions to ask nonprofits, and spells out how to help partner with advisors and nonprofit leaders for inspired outcomes. In addition to overall updates to statistics, the new edition includes a discussion of the implications of the Buffett gift to the Gates Foundation; new legacy planning tools; expanded resources on youth, giving circles, and communities of color; key questions for advisors and donors; and worksheets and resources available on the enclosed CD.\n\nFrom the Back Cover\nThe newest edition of this classic book shows how anyone can align and integrate values, passions, and dreams for their communities and families into their giving plans. Inspired Philanthropy explains how to make a difference by creating giving and legacy plans, tells what questions to ask nonprofits, and spells out how to partner with advisors and nonprofit leaders for inspired outcomes. In addition to overall updates to statistics, the new edition includes a discussion of the implications of the Buffett gift to the Gates Foundation; new legacy planning tools; expanded resources on youth, giving circles, and communities of color; and key questions for advisors and donors. Additional resources are available on the enclosed CD-ROM. Praise for Inspired Philanthropy..................................\n\n\n\n\n[/color][/quote][/b]","torrent":{"xt":"urn:btih:0ee479f8b3b3ee5fe5bfcbc2facd3af7714e73cb","amp;dn":"Inspired+Philanthropy%3A+Your+Step-by-Step+Guide+to+Creating+a+Giv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ee479f8b3b3ee5fe5bfcbc2facd3af7714e73cb","infoHashBuffer":{"type":"Buffer","data":[14,228,121,248,179,179,238,95,229,191,203,194,250,205,58,247,113,78,115,203]},"announce":[],"urlList":[]}}