{"title":"BACKROOM CASTING COUCH - Chloe - Tiny Asian Anal Angel *NEW*","uid":9868150,"size":188785314,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0fa188c94fedad60c88d6d060553ae2ab759c145&amp;dn=BACKROOM+CASTING+COUCH+-+Chloe+-+Tiny+Asian+Anal+Angel+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beta2008x","files":1,"time":1396388265,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=jve3f_coe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=jve3f_coe.jpg&lt;/a&gt;\n \n\n\n\nBehold the tiny Asian anal angel that descendeth upon the office today, for she cummeth easily and maketh my cock look ginormous. I devour all of Chloe's spinnerific 4 foot 9 inches before convincing her that taking it up her juicy ass is the way to make a proper demo tape. Chloe already claims to have banged enough guys and girls to populate a small village so this shouldn't be a problem. She braves through the anal like a champ. I do love her facial expressions and how she desperately tries to find something to hold on to as I fuck her ass harder and harder. You'll see all that happen in real time thanks to the split screens. Speaking of, let me know if I'm overdoing them or if you want more of that. I find it shows a lot of what's going on but really it's your call. Anyway, I finish the little lady off with a creampie in her ass because it feels good and because I can. The polite and submissive Asian cutie she is, there are no complaints or freakouts from Chloe, just a happy, hopeful face kissing the camera goodbye, then she gets dressed in anticipation of that phone call inviting her to start her pornstar career... Keywords: asian, orgasms, anal, anal creampie, ","torrent":{"xt":"urn:btih:0fa188c94fedad60c88d6d060553ae2ab759c145","amp;dn":"BACKROOM+CASTING+COUCH+-+Chloe+-+Tiny+Asian+Anal+Angel+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fa188c94fedad60c88d6d060553ae2ab759c145","infoHashBuffer":{"type":"Buffer","data":[15,161,136,201,79,237,173,96,200,141,109,6,5,83,174,42,183,89,193,69]},"announce":[],"urlList":[]}}