{"title":"Spice Shop Mystery Series - Leslie Budewitz","uid":13337201,"size":1371883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:101f58309d72e5cf808bd4ce1403e04f07daf30f&amp;dn=Spice+Shop+Mystery+Series+-+Leslie+Budewitz&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":6,"time":1453996268,"description":"01. Assault and Pepper [Spice Shop Mystery, #1] - Leslie Budewitz\r\n\r\n\r\n\r\nThe Agatha Award-winning author of Crime Rib is proud to introduce Pepper Reece, the owner of the Seattle Spice Shop who thinks she can handle any kind of salty customer—until a murderer ends up in the mix…\r\n\r\nAfter leaving a dicey marriage and losing a beloved job in a corporate crash, Pepper Reece has found a new zest for life running a busy spice and tea shop in Seattle’s Pike Place Market. Her aromatic creations are the talk of the town, and everyone stops by for a cup of her refreshing spice tea, even other shopkeepers and Market regulars. But when a panhandler named Doc shows up dead on the store’s doorstep, a Seattle Spice Shop cup in his hand, the local gossip gets too hot for Pepper to handle—especially after the police arrest one of Pepper’s staffers, Tory Finch, for murder.\r\n\r\nTory seems to know why she’s a suspect, but she refuses to do anything to curry favor with the cops. Convinced her reticent employee is innocent, Pepper takes it on herself to sniff out some clues. Only, if she’s not careful, Pepper’s nosy ways might make her next on the killer’s list…\r\n\r\n02. Guilty as Cinnamon [Spice Shop Mystery, #2] - Leslie Budewitz\r\n\r\n\r\n\r\nMurder heats up Seattle’s Pike Place Market in the next Spice Shop mystery from the national bestselling author of Assault and Pepper.\r\n\r\nSpringtime in Seattle’s Pike Place Market means tasty foods and wide-eyed tourists, and Pepper’s Spice Shop is ready for the crowds. With flavorful combinations and a fresh approach, she’s sure to win over the public. Even better, she’s working with several local restaurants as their chief herb and spice supplier. Business is cooking, until one of Pepper’s potential clients, a young chef named Tamara Langston, is found dead, her life extinguished by the dangerously hot ghost chili—a spice Pepper carries in her shop.\r\n\r\nNow stuck in the middle of a heated police investigation, Pepper must use all her senses to find out who wanted to keep Tamara’s new café from opening—before someone else gets burned…","torrent":{"xt":"urn:btih:101f58309d72e5cf808bd4ce1403e04f07daf30f","amp;dn":"Spice+Shop+Mystery+Series+-+Leslie+Budewitz","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"101f58309d72e5cf808bd4ce1403e04f07daf30f","infoHashBuffer":{"type":"Buffer","data":[16,31,88,48,157,114,229,207,128,139,212,206,20,3,224,79,7,218,243,15]},"announce":[],"urlList":[]}}