{"title":"The New Jim Crow: Mass Incarceration in the Age of Colorblindnes","uid":12915318,"size":440374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1090e8970892972730eb7899c6134a1ff42bdd1d&amp;dn=The+New+Jim+Crow%3A+Mass+Incarceration+in+the+Age+of+Colorblindnes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1449338342,"description":"The New Jim Crow: Mass Incarceration in the Age of Colorblindness\r\n\r\n\r\nOnce in a great while a book comes along that changes the way we see the world and helps to fuel a nationwide social movement. The New Jim Crow is such a book. Praised by Harvard Law professor Lani Guinier as &quot;brave and bold,&quot; this book directly challenges the notion that the election of Barack Obama signals a new era of colorblindness. With dazzling candor, legal scholar Michelle Alexander argues that &quot;we have not ended racial caste in America; we have merely redesigned it.&quot; By targeting black men through the War on Drugs and decimating communities of color, the U.S. criminal justice system functions as a contemporary system of racial control—relegating millions to a permanent second-class status—even as it formally adheres to the principle of colorblindness. In the words of Benjamin Todd Jealous, president and CEO of the NAACP, this book is a &quot;call to action.&quot;\r\n\r\nCalled &quot;stunning&quot; by Pulitzer Prize–winning historian David Levering Lewis, &quot;invaluable&quot; by the Daily Kos, &quot;explosive&quot; by Kirkus, and &quot;profoundly necessary&quot; by the Miami Herald, this updated and revised paperback edition of The New Jim Crow, now with a foreword by Cornel West, is a must-read for all people of conscience.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:1090e8970892972730eb7899c6134a1ff42bdd1d","amp;dn":"The+New+Jim+Crow%3A+Mass+Incarceration+in+the+Age+of+Colorblindnes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1090e8970892972730eb7899c6134a1ff42bdd1d","infoHashBuffer":{"type":"Buffer","data":[16,144,232,151,8,146,151,39,48,235,120,153,198,19,74,31,244,43,221,29]},"announce":[],"urlList":[]}}