{"title":"Dee Dee Ramone","uid":4092526,"size":181552669,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1211aa92c227091e92b2776ae806e0b32de9c64f&amp;dn=Dee+Dee+Ramone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekv2000","files":58,"time":1206133301,"description":"I feel so safe flying on a ray on the highest trails above\n\nDee Dee Ramone was one of the founding members of Ramones. With that band he more or less teached the world how to play punk rock. He was a big part of the live sound of the band. The speeding up the songs like taking a 4 min song and play it in two and the 1-2-3 was his inventions. Unfortunately heroin took over. Deeply into the fog he left the band 1989 to discover a new kind of music Punk Rap. I am not sure anyone besides him understood what that is or supposed to be and the record itself was voted the worse record ever released by several publications. Still there are a few gold corns in there. He gave up the idea of punk rap music and turned into more rockier punkier sound with the next 3 albums on with several of Ramones members also contributed. On the last studio recording he was joined by Joey Ramone and three of the tracks ended up on Adios Amigos record by Ramone also. \n\nDee Dee died of an overdose of heroin 5th of June 2002 and is buried at Hollywood forever cemetery in California. I feel so safe... is on his gravestone. At the base is his quote: Ok...I gotta go now.\n\nThis are the four full length studio albums he made as a solo artist. \n\n1989 Standing in the Spotlight\n1994 I Hate Freaks Like You\n1997 Zonked\n2000 Hop Around","torrent":{"xt":"urn:btih:1211aa92c227091e92b2776ae806e0b32de9c64f","amp;dn":"Dee+Dee+Ramone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1211aa92c227091e92b2776ae806e0b32de9c64f","infoHashBuffer":{"type":"Buffer","data":[18,17,170,146,194,39,9,30,146,178,119,106,232,6,224,179,45,233,198,79]},"announce":[],"urlList":[]}}