{"title":"Mario Salieri - Discesa all`Inferno (1991) - DVDrip.xvid","uid":4781686,"size":742459392,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:138cb928125367598b7e0251390486c94e7ee840&amp;dn=Mario+Salieri+-+Discesa+all%60Inferno+%281991%29+-+DVDrip.xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"pure_screens","files":1,"time":1237405225,"description":"Mario Salieri - Discesa all`Inferno (1991) - Spanish version\n\n\n\n\n\n\nscreens (+ DVD-covers):\n &lt;a href=&quot;\nhttp://dandy.blogbugs.org/7850009/Discesa-all-Inferno---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dandy.blogbugs.org/7850009/Discesa-all-Inferno---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nZara Whites and her husband are having sexual problems, so he takes her to an unconventional therapist his friend has recommended. This man introduces her to a male assistant (Roberto Malone) who will 'treat' her. This he does by making her have outrageous sex in various situations, to 'unlock her animal instincts'.\n\n    * Roberto Malone and Zara are having a meal in a restaurant. (This is realistically a restaurant - extras have been hired to play other diners, which greatly contributes to the eroticism.) He notices that the male in another couple (female Jeanna Fine) is looking at Zara and makes her play up to him by showing a lot of leg. Then he makes Zara go to the rest room so that the male can follow her. Zara is very reluctant but does so in a huff. The male follows her in and fondles her from behind but she refuses to do anything there, so he suggests they go to a private room upstairs. This is already occupied by five men eating at a table, but he carries on making love to her and undressing her, asking the men if they mind when she objects. They obviously don't and even join in, especially the oldest one who comes close to look, touch and grope while she is being slowly undressed. She gives the male a blowjob while being groped by the old chap and then another of the diners gets a blowjob while she is fucked. Meanwhile Jeanna Fine is wondering where her partner has got to and goes upstairs. She watches from the doorway and Roberto Malone comes up behind her and gropes her. He then sends the five diners away and the two couples fuck - Zara and Roberto and Jeanna and the other bloke. Jeanna takes a facial and Roberto cums on Zara's hand and she licks it off.\n    * The therapist phones up the husband of a former patient to borrow his wife for Zara's next course of treatment. The wife is Sunny McKay and there follows a sex scene between her and her husband. Facial.\n    * Roberto drives Zara and Sunny into the country at night in a Rolls convertible with the top down. He stops the car among a group of male peeping toms hiding in the bushes. He then gets out and walks away and the voyeurs approach and begin to grope the two girls. We then cut away to some large hall where a blonde is surrounded by naked wanking men and one who is dressed and telling her what to do. Back at the car the groping is proceeding to the discomfort of the two girls. Roberto arrives at the nascent gang bang and is told that they are ready for Zara. He goes out to fetch her and she runs up to him before the car is in sight. Sunny has run away in the other direction and out of the film entirely. At the gang bang the blonde is being fucked (reverse cowgirl anal) and Zara is made to get up close and fondle and kiss her. Then Zara is made to join in and is fucked and gives several men blowjobs. The blonde takes a facial and Zara takes a cumshot over her bum and one directly into her mouth.\n    * Roberto drives Zara up to a mansion in the Rolls. They go in and find a black man with a brunette and a foursome ensues. Meanwhile a blonde and brunette are having lesbian sex in an outhouse watched by a man. This turns into a threesome. It is a bit of a filler in terms of the plot and Zara.\n    * Zara is made to have lesbian sex with Misty McCaine (appearing under an alias, possibly Ida Ivanovich). The lesbian stuff is brief and then the man joins in and fucks them both in turn while the other kisses the girl being fucked. This is not well lit but Misty appears to take a reverse cowgirl anal. They share the facial.\n\nHer treatment successfully completed, Zara is taken to meet her tutor in the same warehouse as she met him originally. He asks to fuck her one last time, without sharing her with anyone. This time she shows no reluctance in agreeing.\n\nIn spite of some melodramatic acting and cheesy dubbed dialogue, this is a very erotic film. The plot relates to sex and there are some outrageous situations. I wish there were more films like these being made.\n\n\nActresses\n\n    * Jeanna Fine\n    * Sunny McKay\n    * Misty McCaine\n    * Ida Fabry as Ida Ivanovic\n    * Jennifer Toth\n    * Luana Borgia as Laura Borgia\n    * Marina Licastro\n    * Serena Lipari\n    * Zara Whites as Zara White\n\nMales:\n\n    * Richard Lengin as Richard Voicin\n    * Roberto Malone as Robert Malone\n    * Rally Wodman\n    * Carmelo Petix\n    * Sean Michaels, uncredited\n    * Yves Baillat, uncredited\n\nAlternate Titles\n\n    * Bajada al Infernio\n    * L'Enfer Italien\n    * Italian Inferno 1998 USA\n    * Sarah and Friends 12 SAP, includes Discesa al'inferno\n    * Sarah Young Directors Cut Special Edition 2 includes Discesa al'inferno\n    * Satanic Inferno Germany, S.A.P.\n    * Die Therapie \n\n\nReleased: \t1991\nDirector: \tMario Salieri\nResolution:     640 x424\nFormat:         AVI\nDuration:       01:15:52\nLanguage:       Spanish (dubbed)\n\n\n\n\n\n\n.\n\n","torrent":{"xt":"urn:btih:138cb928125367598b7e0251390486c94e7ee840","amp;dn":"Mario+Salieri+-+Discesa+all%60Inferno+%281991%29+-+DVDrip.xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"138cb928125367598b7e0251390486c94e7ee840","infoHashBuffer":{"type":"Buffer","data":[19,140,185,40,18,83,103,89,139,126,2,81,57,4,134,201,78,126,232,64]},"announce":[],"urlList":[]}}