{"title":"Wolf Hall S01E04 - The Devil's Spit HDTV x264 - GHOST DOG","uid":12139889,"size":350520694,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:139ec512bfcb9e54349fd99c0aa7f039f77ddf44&amp;dn=Wolf+Hall+S01E04+-+The+Devil%27s+Spit+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"marxph","files":2,"time":1437325485,"description":"Historical drama chronicling the rise of Thomas Cromwell, the son of a humble blacksmith who became King Henry VIII's chief minister, as he navigated the corridors of power in the Tudor court.\n\nEpisode 4 of 6: The Devil's Spit\n\nAnne gives birth to a baby girl, Elizabeth, and Henry does little to hide his disappointment. Anne is aware that her power in court rests on producing a male heir and in her paranoia cracks appear in her relationship with Cromwell.\n\nThe 'Holy Maid of Kent', Elizabeth Barton, has been prophesising that if Henry marries Anne Boleyn he will die within the year. Cromwell's spies know that she is touting new candidates for the throne - the old Plantagenet families whom the Tudors displaced and supporters of Katherine who are loyal to Rome. Cromwell interviews the Holy Maid but counsels the king to show mercy to her supporters. However, until Henry has a male heir, the Tudor line remains vulnerable. Cromwell decrees that everyone in public life must take an oath to recognise Henry's supremacy as head of the church and the legality of his marriage to Anne Boleyn.\n\nThomas More advises his family to take the oath but, despite pressure from Cromwell, will not take it himself and is committed to the tower. More is tried, found guilty of treason and sentenced to death. Cromwell did not want him dead - he wanted to bend More's will and make him take the oath, but More's stubbornness left him with no choice. Recovering from serious illness, Cromwell plans the king's royal progress to include a trip to Wolf Hall, the home of Sir John Seymour and his daughter Jane.\n\n===================================================================================\nSource.......: HDTV\nSize.........: 334MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:139ec512bfcb9e54349fd99c0aa7f039f77ddf44","amp;dn":"Wolf+Hall+S01E04+-+The+Devil%27s+Spit+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"139ec512bfcb9e54349fd99c0aa7f039f77ddf44","infoHashBuffer":{"type":"Buffer","data":[19,158,197,18,191,203,158,84,52,159,217,156,10,167,240,57,247,125,223,68]},"announce":[],"urlList":[]}}