{"title":"Big Lurch - It's All Bad","uid":5661555,"size":57518215,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:150ca6e3f1130de149710a3dab16a03b8bb7944c&amp;dn=Big+Lurch+-+It%5C%27s+All+Bad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"coltron0","files":14,"time":1277993453,"description":"&quot;Antron Singleton (born September 15, 1976), better known by his stage name Big Lurch, is an American rapper. He is serving a life sentence for murdering 21-year-old female acquaintance Tynisha Ysais and eating parts of her body in April 2002.\n\nOn April 10, 2002, 25-year-old Singleton murdered Tynisha Ysais in her Los Angeles, California, apartment.[3] Her boyfriend Thomas Moore testified that he and Singleton spent the evening prior to the murder smoking PCP.\n\nThe victim was found in her apartment by her friend Alisa Allen. Her chest had been torn open and a three-inch blade was found broken off in her shoulder blade. Tooth marks were found on her face and on her lungs, which had been torn from her chest. Eyewitnesses reported that when Singleton was picked up by police, he was naked, covered in blood, standing in the middle of the street and staring at the sky. A medical examination performed shortly after his capture found human flesh in his stomach which was not his own.[1]\n\nOn November 7, 2003, Singleton was sentenced to life in prison.[3] He had been convicted of murder and aggravated mayhem the previous June after pleading not guilty by reason of insanity at the time of the murder. The court ruled that his intoxication and claimed insanity were not satisfactory reasons for committing the crime.\n\nIn 2004, Stress Free Ent. and Black Market Records released a solo LP on behalf of Singleton, It's All Bad. Features included Killa Tay, C-Bo, Lil Keke, Roger Troutman II and Too $hort.&quot;\n\nInterested in psychology? Serial killers? Black people? PCP? This is the album for you.  ","torrent":{"xt":"urn:btih:150ca6e3f1130de149710a3dab16a03b8bb7944c","amp;dn":"Big+Lurch+-+It%5C%27s+All+Bad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"150ca6e3f1130de149710a3dab16a03b8bb7944c","infoHashBuffer":{"type":"Buffer","data":[21,12,166,227,241,19,13,225,73,113,10,61,171,22,160,59,139,183,148,76]},"announce":[],"urlList":[]}}