{"title":"HISTORY OF POP AND ROCK MUSIC - part 409","uid":7639407,"size":1566051678,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:151e73b36f162b229ff281e1ceb42b8813547c0c&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+409&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1347738380,"description":"                             \n\n\n\n\n                           PART  409\n\n\n                    \n          12.02  NEW WAWE -  SYNTHOPOP AND NEW ROMANTICISM \n\n\n          ICEHOUSE  - Hey.Little.Girl   (1982)\n          KAJAGOOGOO  -  Too Shy  (1983) \n          EURYTHMICS  - Sweet Dreams (Are Made Of This)  (1983)\n          THE ALAN PARSONS PROJECT  -  Don't Answer Me (1984)\n          THE ALAN PARSONS PROJECT  -  Prime Time  (1984)      \n          LIMAHL  -   The NeverEnding Story  (1984)   \n          LIMAHL  -   The NeverEnding Story  (1984) (film version)             \n\n\n\n\n    &quot;Hey Little Girl&quot; is a single released by Australian band Icehouse, the second single from the band's 1982 album, &quot;Primitive Man&quot;. It peaked at number seven on the Australian singles chart and #2 in Switzerland, #5 in Germany, Top 20 in UK, Sweden and Netherlands, and #31 on the Billboard Mainstream Rock chart.  \n   &quot;Too Shy is a song written and recorded by English New Wave/pop music band Kajagoogoo, released in 1983. The first single from their debut album &quot;White Feathers&quot;, the song was an immediate hit and reached no.1 (for two weeks) on the UK Singles Chart. It was also very successful in other European countries, spending 5 weeks at no.1 in Germany, and reaching no.2 in Switzerland, no.4 in Sweden and Austria, and no.4 in the Netherlands.  &quot;Too Shy&quot; is Kajagoogoo's only significant hit in the U.S., where the band is widely regarded as a one-hit wonder. In the UK, however, Kajagoogoo had further hits, including two more Top 10 singles: &quot;Ooh to Be Ah&quot; and &quot;Big Apple&quot;, both in 1983.\n    &quot;Sweet Dreams (Are Made of This)&quot;  is a song written and performed by  pop music duo Eurythmics (Annie Lennox and David A. Stewart). It was released as a single in early 1983, the title track of their album &quot;Sweet Dreams&quot;, one of their biggest hits, and the song which provided the group with their breakthrough into commercial success. Its striking music video helped to propel the song to #2 on the UK singles chart and to their only #1 ranking on the U.S. Billboard Hot 100, on 3 September 1983, after The Police's &quot;Every Breath You Take&quot; had held it off at #2 for four consecutive weeks in August. &quot;Sweet Dreams&quot; is arguably Eurythmics' signature song. Following its success, their previous single, &quot;Love Is a Stranger&quot;, was re-released and also became a worldwide hit. On Rolling Stone's The 500 Greatest Songs of All Time issue in 2003, &quot;Sweet Dreams (Are Made of This)&quot; was ranked number 356.    \n   &quot;Ammonia Avenue&quot; is one of the most commercially successful albums of The Alan Parsons Project.  &quot;Don't Answer Me&quot; was the lead single from the &quot;Ammonia Avenue&quot; album; it reached the Top 20 in several countries and represents the last big hit for the Alan Parsons Project.. Music video for &quot;Don't Answer Me&quot; and &quot;Prime Time&quot; was  produced in 1984, the former with art and animation by MW Kaluta.\n   &quot;The NeverEnding Story&quot; is the title song from the 1984 film The NeverEnding Story. The English version was performed by Limahl and Beth Anderson; the French version was performed by Limahl and Ann Calvert.It was a success in many countries, reaching No. 1 Norway and Sweden, No. 2 in Austria, Germany and Italy, No. 4 in the UK and No. 6 in the US Billboard Adult Contemporary chart.\n\n\n\n\n","torrent":{"xt":"urn:btih:151e73b36f162b229ff281e1ceb42b8813547c0c","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+409","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"151e73b36f162b229ff281e1ceb42b8813547c0c","infoHashBuffer":{"type":"Buffer","data":[21,30,115,179,111,22,43,34,159,242,129,225,206,180,43,136,19,84,124,12]},"announce":[],"urlList":[]}}