{"title":"Adobe DNG Standard Profiles &amp; Profile Editor (beta 2)","uid":4462196,"size":38851591,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:154638f37982b3cab1ab58e6529bfe6f17195f72&amp;dn=Adobe+DNG+Standard+Profiles+%26+Profile+Editor+%28beta+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"z247","files":2,"time":1224760256,"description":"Adobe DNG Standard Profiles (beta 2)\n\n\n\nWhat are Adobe Standard profiles?\nThe new Adobe Standard (AS) profiles are designed to improve color rendering compared to our previous camera profiles (e.g., ACR 4.4 and earlier), especially in reds, oranges, and yellows.\n\nIn some cases, deep saturated reds with our earlier profiles came out undersaturated and/or orange-ish. This issue has been fixed with the new AS profiles without adversely affecting skin tones.\n\nAll AS profiles are identified with the prefix Adobe Standard in CR / LR&amp;#039;s Profile popup menu.\n\nNote that our profile-naming (and version-numbering) conventions have changed, hopefully for the better.\n\nWhat are Camera Matching profiles?\nThese profiles match the color appearance produced by the camera vendors&amp;#039; software, under specific settings (described below). They are intended for photographers who appreciate the workflow and toolset provided by CR / LR but prefer the color rendering provided by the camera vendors&amp;#039; own software.\n\nAll CM profiles are identified with the prefix Camera in CR / LR&amp;#039;s Profile popup menu.\n\nPlease note that the CM profiles are NOT expected to match the embedded in-camera JPEG, especially if you have established custom in-camera settings. To understand the abilities and scope of the CM profiles, please read the following description carefully.\n\nAs of July 29, 2008, we have created CM profiles for Canon and Nikon DSLRs only. Photographers who want CM profiles for other cameras are encouraged to use the DNG Profile Editor.\n\nIn general, there are 5 CM profiles per Canon DSLR, one for each of the default Canon Picture Styles. These five Picture Styles are called Standard, Portrait, Landscape, Neutral, and Faithful. The CM profiles will match the Canon Picture Styles with all Canon sliders (i.e., Contrast, Color Balance, and Saturation) set to their default values of 0.\n\nSimilarly, in general there are 8 CM profiles per Nikon DSLR, one for each of the Nikon Picture Controls. These Picture Controls are called Standard, Neutral, Vivid, Landscape, Portrait, D2X Mode 1, D2X Mode 2, D2X Mode 3. The CM profiles will match the Nikon Picture Controls with all Nikon sliders (i.e., Saturation, Tone Compensation, etc.) set to their default values of 0. Note that the D2X name is applicable to all Nikon DSLRs, even non-D2X models. This is not a bug.\n\n\nAre the new profiles camera-specific?\nYes. Every profile that we build is camera-specific. Even the older profiles (e.g., ACR 3.3, ACR 4.4) are camera-specific. In fact, the profile menu in CR/LR will only show profiles for your camera. Note that the profiles you see in the profile menu do not include the camera&amp;#039;s model name (e.g., Canon EOS 40D). This is intentional (for several reasons).\n\nI only see generic profiles in the Profile popup menu, but not profiles specific to my camera. What&amp;#039;s wrong?\nActually, all the profiles listed in the Profile popup menu are specific to your camera.\n\nI only see an &quot;Embedded&quot; profile in the Profile popup menu. What&amp;#039;s wrong?\nYou probably have a JPEG or TIFF file selected. The camera profiles discussed here only apply to raw files, not already-rendered images such as JPEG and TIFF images.\n\nThe older profiles were named ACR 3.3, ACR 4.4, etc. Why are the new profiles named Adobe Standard?\nOlder camera profiles were assigned a number (e.g., &quot;3.3&quot;) corresponding to the CR release in which they first appeared (e.g., CR 3.3). Many users found this naming convention confusing. Therefore, with our new camera profiles built around DNG 1.2, we are dropping the CR version number from the profile name.\n\nThe first public beta profiles have the &quot;beta 1&quot; suffix. The second public beta profiles have the &quot;beta 2&quot; suffix.\n\nWhat happened to the older profiles (e.g., ACR 3.3, ACR 4.4)?\nThey&amp;#039;re still around (we didn&amp;#039;t delete them) and you can still use them if you prefer.\n\nWhat version of Camera Raw or Lightroom do I need to use the new profiles?\nCR 4.5 / LR 2.0 (final release) or later. The new profiles will NOT work correctly with earlier versions of CR / LR, because they do not fully support DNG 1.2. In particular, the new profiles will NOT work correctly with the public beta of Lightroom 2.0.\n\nWill the new profiles work with the public beta of Lightroom 2?\nNo. See related question here.\n\nWhy are the new profiles called &quot;DNG camera profiles&quot;? Can they only be used with DNG images?\nThe name &quot;DNG camera profile&quot; is used because (1) the underlying camera profile format comes from the DNG 1.2 specification and (2) these camera profiles can be embedded in DNG images.\n\nThe name does not mean that these profiles can only be used to process DNG images. In fact, the new AS and CM profiles can be used to process both DNG and non-DNG images.\n\nAre the new profiles compatible with both Mac and Windows?\nYes. In fact, DNG camera profiles are completely platform-independent. Specifically, an external profile (which has the .dcp extension) will work on any platform, including Mac OS X, Windows XP, and Windows Vista. Similarly, a profile exported from PE on a specific platform (e.g., Mac OS X) will work on any platform.\n\n\nWhere are the new profiles installed on my computer?\n\nOn Windows 2000 / XP:\nC:Documents and SettingsAll UsersApplication DataAdobeCameraRawCameraProfiles\nOn Windows Vista:\nC:ProgramDataAdobeCameraRawCameraProfiles\n\n\nCan Camera Raw or Lightroom use ICC camera profiles to render raw images?\nNo. When rendering raw images, CR / LR only support profiles in the DNG camera profile format (described in the DNG 1.2 specification).\n\n\n\nCan Camera Raw or Lightroom use camera profiles built by third-party software?\nNot currently. Software tools such as ProfileMaker and MonacoPROFILER build ICC camera profiles. When rendering raw images, CR / LR only support profiles in the DNG camera profile format (described in the DNG 1.2 specification). We hope this situation will change in the future (i.e., third-party tools will add support for the DNG camera profile format).\n\n\n\n\n\n\n\n\nWorkflow\n\nHow can I set a given profile to be my default camera profile in Camera Raw?\nFirst, open an image in CR and select your desired profile from the Camera Profile popup menu in the Camera Calibration tab. Then click on the flyout popup menu (to the right of the words &quot;Camera Calibration&quot;) and choose Save New Camera Raw Defaults.\n\nHow can I set a given profile to be my default camera profile in Lightroom?\nFirst, select an image in LR&amp;#039;s Develop module and select your desired profile from the Profile popup menu in the Camera Calibration panel. Then press the Alt/Option key and observe that the Reset button changes its name to &quot;Set Default...&quot;. Click the &quot;Set Default...&quot; button and click &quot;Update to Current Settings&quot; in the following dialog box.\n\nNote that this change will not automatically affect any existing images already in your LR catalog. Your newly changed defaults will only apply to future images imported into your catalog, or if you explicitly use Reset on your existing images.\n\nWhat&amp;#039;s the easiest way to apply a profile to a large number of images in Camera Raw?\nFirst, open a set of images in CR and make sure all images are selected. Next, choose your desired profile from the Camera Profile popup menu in the Camera Calibration tab. Then click the Synchronize... button and choose &quot;Camera Calibration&quot; from the ensuing dialog box&amp;#039;s Synchronize popup menu. Click OK.\n\nIf you find yourself doing this a lot, you can save yourself time by making a preset. Click on the flyout popup menu on the right-hand side of the CR dialog box and choose &quot;Save Settings...&quot;. Choose &quot;Camera Calibration&quot; from the ensuing dialog box&amp;#039;s Subset popup menu, then click &quot;Save...&quot; Then whenever you need to apply your preset to a group of images, choose &quot;Apply Preset&quot; from the flyout popup menu.\n\nAn easy way to apply a given profile automatically to all new images is to create a new CR default for your camera.\n\nWhat&amp;#039;s the easiest way to apply a profile to a large number of images in Lightroom?\nFirst, select a set of images in your LR catalog. Next, choose your desired profile from the Profile popup menu in the Develop module&amp;#039;s Camera Calibration panel. Then choose &quot;Sync Settings...&quot; from the Settings menu. Make sure &quot;Calibration&quot; is checked in the ensuing dialog box and click Synchronize.\n\nIf you find yourself doing this a lot, you can save yourself time by making a preset. In the Develop module&amp;#039;s left panel, click the + button to the right of the word &quot;Presets&quot;. Make sure &quot;Calibration&quot; is checked in the ensuing dialog box and click Create. Then whenever you need to apply your preset to a group of images, click on your newly-created preset from the Presets list in the left panel.\n\nYou can also choose this preset in the Import dialog box to apply your desired camera profile to all imported images.\n\nAnother way to apply a given profile automatically to all new images is to modify LR&amp;#039;s default settings for your camera.\n\nHow can I apply a profile automatically to all images imported into Lightroom?\nEither use a preset or modify your camera&amp;#039;s default settings.\n\nHow do the new profiles relate to the color rendering adjustments already available inside of Camera Raw and Lightroom (e.g., HSL adjustments)?\nThe best way to think about the new AS and CM camera profiles is that they provide great out-of-the-box results. However, they are only default starting points for further image adjustments and are not (and will never be) substitutes for a photographer&amp;#039;s creative vision. Therefore, treat the new profiles as starting points but use the color and tone rendering controls provided by CR / LR (e.g., HSL sliders, Fill Light, Parametric Curves, etc.) to make your desired image-specific adjustments.\n\nShould I still be using the Camera Calibration sliders in Camera Raw and Lightroom?\nProbably not. We need to keep those sliders in CR / LR for legacy reasons, but for editing camera profiles we now recommend using the DNG Profile Editor because of the finer control it provides.\n\nIf you are trying out the new AS or CM profiles, then it is very important that you set the Camera Calibration sliders in CR / LR to their default values of 0. If you have old camera calibration settings (e.g., ones computed by a calibration script in CR), those will continue to work with the older camera profiles. However, those values will not work correctly with the new AS and CM camera profiles.\n\n\n\n\n\n\nWhat is the DNG Profile Editor?\nThe DNG Profile Editor is a software program designed and implemented by Adobe. Its purpose is to enable photographers to edit camera profiles and it is being offered as a free download to the photographic community. Please note that while we welcome all photographers to try the DNG Profile Editor, this tool is intended for advanced users.\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:154638f37982b3cab1ab58e6529bfe6f17195f72","amp;dn":"Adobe+DNG+Standard+Profiles+%26+Profile+Editor+%28beta+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"154638f37982b3cab1ab58e6529bfe6f17195f72","infoHashBuffer":{"type":"Buffer","data":[21,70,56,243,121,130,179,202,177,171,88,230,82,155,254,111,23,25,95,114]},"announce":[],"urlList":[]}}