{"title":"Book: We Are Everywhere: the irresistible rise of global anticap","uid":4220531,"size":12710621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1562e4aed02a43a1374477a4aa6066601a1e2faa&amp;dn=Book%3A+We+Are+Everywhere%3A+the+irresistible+rise+of+global+anticap&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"keiron80","files":1,"time":1212572857,"description":"This is a consolidation of the multiple-pdf format into a single pdf of the entire book &quot;We Are Everywhere: the irresistible rise of global anticapitalism&quot; available at http://artactivism.members.gn.apc.org/stories.htm\n\nedited by Notes From Nowhere and published by Verso\nLondon/New York 2003\nISBN 1-85984-447-2\n\nFrom the book&amp;#039;s website http://www.weareeverywhere.org: \n\nWe Are Everywhere is a book of stories, stories written by activists from the front lines of resistance against capitalism and economic globalization, tales of struggle and rebellion from participants in a movement of movments that is gaining ground on every continent. These stories, told with both words and pictures, have been collected over the past three years by a collective of activists, writers and artists, all of whom have deep connections to the movement.\n\nThe book explores and celebrates what activist, academic, and media commentators have recently come to refer to as the &quot;anticapitalist&quot; movement. One of the great strengths of this movement has been its capacity to re-kindle the idea of a global political project, a project defined by notions of autonomy, ecology, democracy, self-organization and direct action, notions which are explored in We Are Everywhere.\n\nThe Stories:\n\nFifty-five stories and accounts from twenty-six countries run in chronological order. Some are highly subjective, others come in the form of collective declarations ? all have been chosen not only for their ability to document key issues and events of the movement, but also for the quality of their writing.\n\nOn the pages of the book one can find a taxi driver?s account of organizing Seattle cab drivers during the actions against the World Trade Organization rubbing shoulders with a Nigerian activist&amp;#039;s story of returning home from exile and witnessing a welcoming &quot;Carnival of the Oppressed&quot; on the same day that similar &quot;carnivals against capital&quot; were closing down financial centres across the world. \n\nAccounts of Thai villagers building protest villages in the path of a mega dam mix with tales of riots against water privatization in Bolivia, road blockades by Argentinean movements of the unemployed, and the realization of a Papua New Guinean movement, via the internet, that they are not alone in fighting against policies imposed by the World Bank. Together these diverse writings reflect the essence of this movement. The stories are framed by seven essays collectively written by the editors which explore several of the various defining priorities and hallmarks of the movement.\n\nPhotographic Essays:\n\nThe book is punctuated by ten photo essays, some of which document certain events such as the global days of action (such as those in Seattle, Prague, and Genoa); others develop a key theme. The book begins and ends with photo essays, providing an accessible and inspiring  way in and out of the publication.\n\nThe Format:\n\nThe book is more or less the size of a brick, and is 520 pages long. It contains over 150 photographs, most of which were donated by independent movement photographers. All layout and design work was done by the collective,and to a certain extent, mirrors the diversity as well as the fluid nature of the global movements resisting capitalism.\n\nReviews:\n\n&quot;We Are Everywhere is the the first book to truly capture and embody the exuberant creativity and radical intellect of the protest movements&quot;.\n           -- Naomi Klein\n\n&quot;...this book is essential reading for anyone who cares about our future, and weighs enough to throw at anyone who doesn&amp;#039;t.&quot;\n           -- The Independent, London\n\n&quot;Out of the pages you can almost hear the roar of the crowd: &amp;#039;Our resistance is as transnational as capital. We are everywhere. We are winning.&amp;#039; &quot;\n           -- The Ecologist\n\n&quot;Here is an authentic document of revolution.&quot;\n           -- The Times, London\n\n&quot;This isn&amp;#039;t a book, it&amp;#039;s a brick with which to shatter cynicism.&quot;\n           -- Luther Blissett","torrent":{"xt":"urn:btih:1562e4aed02a43a1374477a4aa6066601a1e2faa","amp;dn":"Book%3A+We+Are+Everywhere%3A+the+irresistible+rise+of+global+anticap","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1562e4aed02a43a1374477a4aa6066601a1e2faa","infoHashBuffer":{"type":"Buffer","data":[21,98,228,174,208,42,67,161,55,68,119,164,170,96,102,96,26,30,47,170]},"announce":[],"urlList":[]}}