{"title":"Bush Family Fortunes - The Best Democracy Money Can Buy","uid":3597170,"size":388578882,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:157bbe6ff2fdf27c614ee44a0431b56b4be6c77b&amp;dn=Bush+Family+Fortunes+-+The+Best+Democracy+Money+Can+Buy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lkobescak","files":1,"time":1168971090,"description":"Bush Family Fortunes - The Best Democracy Money Can Buy (2004)\n--------------------------------------------------------------\n\nProduct Description\nThis hour long documentary follows the award-winning reporter-sleuth Greg Palast on the trail of the Bush family, from Florida election finagling, to the Saudi connection, to the Bush team?s spiking the FBI investigation of the bin Laden family and the secret State Department plans for post-war Iraq. These are the hard-hitting reports that have been seen in films like Michael Moore?s Fahrenheit 9/11, broadcast internationally on BBC Newsnight television, and are found in Palast?s international bestselling book The Best Democracy Money Can Buy. \n\nReview from Amazon.com\nIn Bush Family Fortunes: The Best Democracy Money Can Buy, journalist Greg Palast argues persuasively that George W. Bush was allowed into the Air National Guard ahead of other applicants due to his political connections; paints a damning portrait of how over 90,000 Florida voters, predominantly black, were prevented from voting in the 2000 election; discusses the number of government contracts handed out to large corporate donors to Bush's campaign--and that's just the first half-hour. Palast doesn't have the cinematic savvy of Michael Moore, but Bush Family Fortunes acts as a valuable corollary to Fahrenheit 9/11, exploring certain facets of the same argument--specifically, that the Bush family is detrimentally tied to both the Saudi Arabian ruling elite and the American oil industry, with whom they trade influence and money for mutual benefit. Palast's investigations will stir the blood of any Democrat and may raise doubts in some Republicans. -- Bret Fetzer\n\n\nRun time: 56 min\n\n\nTo purchase this video please visit: http://www.amazon.com/gp/product/B0002T7YWQ?ie=UTF8&amp;tag=stillinprogre-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B0002T7YWQ\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO and the great threat to you can be found ator www.prisonplanet.tv\n\n------------------------------------------------------------------------ \n","torrent":{"xt":"urn:btih:157bbe6ff2fdf27c614ee44a0431b56b4be6c77b","amp;dn":"Bush+Family+Fortunes+-+The+Best+Democracy+Money+Can+Buy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"157bbe6ff2fdf27c614ee44a0431b56b4be6c77b","infoHashBuffer":{"type":"Buffer","data":[21,123,190,111,242,253,242,124,97,78,228,74,4,49,181,107,75,230,199,123]},"announce":[],"urlList":[]}}