{"title":"Trio 3 - Time Being (2006)","uid":5888879,"size":385535378,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:159f1196c3fecbf3124eaa0a7eacdc84eff34f7e&amp;dn=Trio+3+-+Time+Being+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1287157661,"description":"Personnel\n~~~~~~~~\n* Oliver Lake: alto and sopranino saxes\n* Reggie Workman: bass\n* Andrew Cyrille: drums.\n\nHomepage\n~~~~~~~ &lt;a href=&quot;\nhttp://www.triothree.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.triothree.com/&lt;/a&gt;\n\nReview\n~~~~~~\nNic Jones &lt;a href=&quot;\nhttp://www.allaboutjazz.com/php/article.php?id=22988&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allaboutjazz.com/php/article.php?id=22988&lt;/a&gt;\n\nThese three men have been working together for some time, and the more time\npasses, the more obvious it becomes that they should go on doing so. If some\nlist of arbitrary criteria that makes for stimulating improvised music were to\nbe written up, these three would score highly. They display individual\nexpression in abundance within a group context, for example, while it seems to\nbe the case that these men bring their wealth of musical experience to bear on\nwhatever they do out of the force of habit.\n\nOliver Lake has inherited Eric Dolphy's mercurial phrasing, particularly on the\nalto sax, and his rate of musical development is such that he has long since\nsubsumed it within his own instrumental personality. Andrew Cyrille has a knack\nfor evoking both space and density in his drumming, and Reggie Workman is as\nalert to the needs of the music as he has ever been. As such, to hear them\ngrooving on the out-of-kilter likes of Lake's &quot;Lope&quot; is to hear in less than\nfive minutes both the earthiness and the grandeur to which this music can\naspire.\n\nAndrew Cyrille has for years been proving himself a rare entity: a drummer who\nis also a composer of distinction; and on &quot;Tight Rope&quot; there is further evidence\nof this, particularly when the other players are so alert both to the nuances of\nhis lines and the individuality of his work behind the kit. The key element of\ngive and take that's a cornerstone of this music is here in abundance, too.\n\nAll three men are also highly appreciative of instrumental colour and how to\ndeploy it, and they prove as much on the group composition &quot;Equilateral,&quot; where\ntheir conceptions of space and how to use it are much in evidence.\n\nIn the midst of all the derivative stuff, thankfully there is still potent music\nlike this, and as a model of individual and group expression it offers nothing\nless than a working definition.\n\nStyle: Modern Jazz","torrent":{"xt":"urn:btih:159f1196c3fecbf3124eaa0a7eacdc84eff34f7e","amp;dn":"Trio+3+-+Time+Being+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"159f1196c3fecbf3124eaa0a7eacdc84eff34f7e","infoHashBuffer":{"type":"Buffer","data":[21,159,17,150,195,254,203,243,18,78,170,10,126,172,220,132,239,243,79,126]},"announce":[],"urlList":[]}}