{"title":"Les Paul - The Final Words of a Pioneer and Guitar Legend(music ","uid":5791860,"size":108001746,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1609bef2ae336c5de2d05ee686fb8e9919c38e91&amp;dn=Les+Paul+-+The+Final+Words+of+a+Pioneer+and+Guitar+Legend%28music+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":2,"time":1282869531,"description":"LES PAUL  THE FINAL WORDS OF A PIONEER &amp; GUITAR LEGEND\nDuration :Approx 56 minutes [x2 episodes]\nAudio Information  \nAudio Codec:  MPEG-1 Layer 3\nAudio Sample Rate: 44100 Hz \nAudio BitRate Type: CBR\nAudio Channels 2\nAudio Bitrate(kbps): 128 \n\n\n\nBBC Radio 2\n10, 17 August 2010\n\n\n\n]Episode 1 (10 August 2010)\nAged a youthful 94, Les Paul died in August 2009. A year on, fellow guitar legend, Duane Eddy, assesses the life and legacy of the man who not only helped pioneer the solid state electric guitar but also developed modern recording techniques without which popular music would not be what it is today. Without Les Paul, there would be no overdubbing, no multi-tracking, no tape delay and most of all no Gibson Les Paul Guitars, one of the most sought after instruments in rock, jazz, popular music and the blues. Joined by the likes of BB King, Joe Perry (Aerosmith), Jeff Beck, Albert Lee, Will I Am (Black Eyed Peas), Joe Bonamassa, Ace Frehley (Kiss), Andy Summers (Police), Keith Urban, Nile Rogers and Jimmy Page, Duane Eddy also hears from Les Paul himself, speaking in what may be the last full-length interview he gave a few months before his death.\n[/color]\n\n[color=turquoise][b]Episode 2 (17 August 2010)[/b]\nDuane Eddy continues his celebration of the man who not only helped pioneer the solid state electric guitar but also developed such modern recording techniques as multi-tracking, overdubbing, phasing and tape delay. Without Les Paul, popular music would truly not be what it is today. And without him, who knows what would have become of the likes of Ace Frehley (Kiss), Albert Lee, Andy Summers (Police), BB King, Jimmy Page, Jeff Beck, Joe Bonamassa, Joe Perry (Aerosmith), Keith Urban, Nile Rogers, Peter Frampton and Will I Am (Black Eyed Peas)? As it is they are all on hand to pay tribute to a remarkable musician and an unrivalled musical innovator.\n\n\n\nTHANKS TO CHEROKEE &amp; RADIO ARCHIVES.CC FOR ORIGINAL RIP\n","torrent":{"xt":"urn:btih:1609bef2ae336c5de2d05ee686fb8e9919c38e91","amp;dn":"Les+Paul+-+The+Final+Words+of+a+Pioneer+and+Guitar+Legend%28music+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1609bef2ae336c5de2d05ee686fb8e9919c38e91","infoHashBuffer":{"type":"Buffer","data":[22,9,190,242,174,51,108,93,226,208,94,230,134,251,142,153,25,195,142,145]},"announce":[],"urlList":[]}}