{"title":"Ruby Gloom","uid":7849843,"size":28786409308,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:161c0d647e8dc38e0e4ee0713b000804ce3aa149&amp;dn=Ruby+Gloom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ToonArchives","files":-1,"time":1353580333,"description":"--------------------------------------------------------------------------------\nTO YOU, THE DOWNLOADER:\n\nPrepare to have your hard drives rammed full of Ruby Gloom!\n\nVideo: 1280x720 23.97 FPS, H264\nAudio: AC3 192 KB/s\n\nThis is the complete series, ripped lovelessly from iTunes. It's unlikely that\nthere'll ever be a better release than this on the Internet, until we can get iTunes releases of the 1080p files.\n\nIf you can't play this in whatever player you're using, try VLC or QuickTime.\n\n--------------------------------------------------------------------------------\nTO THE CREATORS OF RUBY GLOOM:\n\nWe fell in love with your show as soon as we saw it.\nWe wanted to buy copies for ourselves to both show our support, and to have a\nversion of it stored on our computers for watching and archival.\n\nSo we searched for places to buy it. None of your DVD releases have the complete\nseries. There are no Blu-ray releases either.\n\nAfter searching far and wide we found it was available on iTunes. GREAT!\nHowever it was only available in Canada. We tried using various methods to cheat\nthe system to buy it, but in the end we had to get somebody overseas to buy it\nfor us.\n\nThe simplest way to fix this mess is to have the show available globally on\niTunes. I assume there's legal reasons why this hasn't happened already.\nThis is why we can't have nice things.\n\nWe apologize for this torrent. Seeing the end result of love, hard work and\npassion freely available on the Internet must hurt. But this is the only way\nfor the world to experience your art. This may be the only way to save your show\nfrom fading to obscurity like others have. We won't let that happen, even if\nhurts. And neither should you.\n\nOnce again, thank you from the bottom of our hearts.\n\n--------------------------------------------------------------------------------\nTO ARCHIVISTS:\n\nThese files were grabbed from iTunes 10.5 and decrypted using Requiem 3.3.5.\nThey were then scrubbed using a modified version of wildflower76's tunescrub.pl\nscript. The only modification to it is that bottom 32 bits of adjusted times are\njust set to 0 instead of a random value, making it deterministic.\n\nAfter that, all the files had their (HD) tags removed at the end and renumbered\nto be one big list of 40 episodes instead of two volumes of 20 episodes.\n","torrent":{"xt":"urn:btih:161c0d647e8dc38e0e4ee0713b000804ce3aa149","amp;dn":"Ruby+Gloom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"161c0d647e8dc38e0e4ee0713b000804ce3aa149","infoHashBuffer":{"type":"Buffer","data":[22,28,13,100,126,141,195,142,14,78,224,113,59,0,8,4,206,58,161,73]},"announce":[],"urlList":[]}}