{"title":"BUFFY THE VAMPIRE SLAYER CLASSIC 001-030 (Dark Horse Digital)","uid":8073329,"size":1260921213,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:17c54da95bf6b966c00c86160913f2156401bcc3&amp;dn=BUFFY+THE+VAMPIRE+SLAYER+CLASSIC+001-030+%28Dark+Horse+Digital%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"STFmaryville","files":-1,"time":1359323689,"description":"This torrent fills a request for rakib2099, who wanted the first 3. I had most of these 3 weeks ago, but it's taken me a long time to find 1, 2, 3 and 5!\n\nThis torrent contains:\n\nBUFFY THE VAMPIRE SLAYER CLASSIC 001-030 (2011-2012)\n\nall of which are Dark Horse digital reprints of stories in the Buffy the Vampire Slayer Omnibus 7-volume series (2007-2009), which themselves were reprints of the original Dark Horse Buffy comics, published between 1998 and 2004.\n\nNever, ever let it be said that Mike Richardson and his people don't know how to milk a cash cow!\n\nPlease seed and share with our friends here on TPB!\n\n------\n\n&quot;In every generation there is a Chosen One. She alone will stand against the vampires, the demons, and the forces of darkness. She is the Slayer.&quot;\n\nSunnydale is your average American town.\n\nWell, apart from the Hellmouth underneath it, that is.\n\nThis portal to the underworld attracts vampires, demons and other unnatural creatures from all corners of this world - and a few others - causing the town to become a breeding ground for evil. When young Buffy Summers and her mother move there, Buffy finds she cannot escape her role as the Slayer - it is her destiny to destroy the forces of darkness.\n\nBuffy soon meets the school librarian, Rupert Giles, who is in reality her Watcher. Under his guidance Buffy battles the Master, a powerful vampire imprisoned under the town, his minions, as well as other supernatural creatures such as witches, zombies, demons, and of course, vampires.\n\nThe Slayer is meant to fight alone, with only her Watcher to guide her, but Buffy is unique in that she also has her &quot;Scooby Gang&quot; of friends to help: there's Xander, a nervous teenager who later develops into a strong, confident man; and Willow, a nerdy bookworm who eventually blossoms into a powerful witch. Then there is the dark and brooding Angel, a handsome vampire with a soul, with whom Buffy falls hopelessly in love ...","torrent":{"xt":"urn:btih:17c54da95bf6b966c00c86160913f2156401bcc3","amp;dn":"BUFFY+THE+VAMPIRE+SLAYER+CLASSIC+001-030+%28Dark+Horse+Digital%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17c54da95bf6b966c00c86160913f2156401bcc3","infoHashBuffer":{"type":"Buffer","data":[23,197,77,169,91,246,185,102,192,12,134,22,9,19,242,21,100,1,188,195]},"announce":[],"urlList":[]}}