{"title":"Keay, John - India Discovered_The Recovery of a Lost Civilizatio","uid":9709940,"size":11345175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19a81cba1959ea7d730beb83eff36ffa4ba585cf&amp;dn=Keay%2C+John+-+India+Discovered_The+Recovery+of+a+Lost+Civilizatio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Papushi","files":-1,"time":1394100092,"description":"Two hundred years ago, India was seen as a place with little history and less culture.Today it is revered for a notable prehistory, a magnificent classical age and a cultural tradition unique in both character and continuity. How this extraordinary change in perception came about is the subject of this fascinating book. The story, here reconstructed for the first time, is one of painstaking scholarship primed by a succession of sensational discoveries. The excitement of unearthing a city twice as old as Rome, the realization that the Buddha was not a god but a historical figure, the glories of a literature as rich as anything known in Europe, the drama of encountering a veritable Sistine chapel deep in the jungle, and the sheer delight of categorizing 'the most glorious galaxy of monuments in the world' fell, for the most part, to men who were officials of the British Raj. Their response to the unfamiliar - the explicitly sexual statuary, the incomprehensible scripts, the enigmatic architecture - and the revelations which resulted, revolutionized ideas not just about India but about civilization as a white man's prerogative. A companion volume by the author of the highly praised India: A History and The Great Arc.","torrent":{"xt":"urn:btih:19a81cba1959ea7d730beb83eff36ffa4ba585cf","amp;dn":"Keay%2C+John+-+India+Discovered_The+Recovery+of+a+Lost+Civilizatio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19a81cba1959ea7d730beb83eff36ffa4ba585cf","infoHashBuffer":{"type":"Buffer","data":[25,168,28,186,25,89,234,125,115,11,235,131,239,243,111,250,75,165,133,207]},"announce":[],"urlList":[]}}