{"title":"Legend of Atlantis - Europa Universalis IV mod","uid":10890863,"size":18495384,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1a68c76f036c8389e84675d2d0779f2efb2c8207&amp;dn=Legend+of+Atlantis+-+Europa+Universalis+IV+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1409112120,"description":"Legend of Atlantis - Europa Universalis IV mod\n\n\nExtract 7zip to your C:Users[user]Documents Paradox Interactive Europa Universalis IV mod folder\n\n\nThe Legend of Atlantis mod adds the Atlantean island to the game, which is situated to the west of Europe in the Atlantic Ocean, along with all of the nations, religions etc. on Atlantis. \n\nREAD THIS: Suggest new colours for Atlantis in the newly created discussion. It has to be something related to Atlantis and not something crazy like green. \n\nTO ALL MODDERS: As you may know, the religion icon for Hellenism is not working in the new 1.6 update. It'd be a great help if somebody could suggest a fix for this in the comments. When you are looking through the mod files, there should be a 'backup' file in some of the folders. This includes the religion icon stuff which should work, but doesn't. Thanks for your help. \n\nMOD COMPATIBILITIES: This mod is not compatible with other mods that change the heightmap, provinces, or any other map files. \n\nNOTICE: The position of Atlantis in this mod is not supposed to be historically accurate, so please do not comment on the position of the Atlantean island saying that it is supposed to be situated somewhere else. \n\nThese new features include:\n- Five new Atlantean nations, each totally playable. \n- A Hellenic religion. \n- The Atlantean culture. \n- New events and decisions pertaining to Atlantis. \n- New ideas and ambitions for the Atlantean nations. \n- 25% cheaper tech cost for the Atlanteans. \n\nAtlantean Nations:\n- Atlantis: Formable when you own all of Atlantis. \n- Monopolean Empire: Expansionist, monarchy, military nation, seeks to conquer Atlantis and expand.\n- Republic of Atlantis: Diplomatic nation, republic, seeks to colonize and excel in trading. \n- Nassean Republic: Smaller nation, republic, diplomatic nation. \n- Pavia: Smaller nation, monarchy, diplomatic nation. \n- Thixius: Smaller nation, monarchy, diplomatic nation. ","torrent":{"xt":"urn:btih:1a68c76f036c8389e84675d2d0779f2efb2c8207","amp;dn":"Legend+of+Atlantis+-+Europa+Universalis+IV+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a68c76f036c8389e84675d2d0779f2efb2c8207","infoHashBuffer":{"type":"Buffer","data":[26,104,199,111,3,108,131,137,232,70,117,210,208,119,159,46,251,44,130,7]},"announce":[],"urlList":[]}}