{"title":"Sustainable forest management in India","uid":5227894,"size":73682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ab368e98baf2990e49ec6f21858b2717de68dfb&amp;dn=Sustainable+forest+management+in+India&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vikas1ace","files":1,"time":1261206342,"description":"In India, the criteria and indicators approach for sustainable forest management is being implemented\non a pilot basis since 2000. The initiative, known as the Bhopal-India process, has over the years\nendeavoured to formulate a working framework for the achievement of the goals of sustainability\nspecific to the national forestry conditions. Forests provide a wide range of ecological, economic and\nsocio-cultural benefits for the communities, enhancing their quality of life. However, the dynamics\nof forest management in a developing country is unique, as the multiple uses of forests are clearly\nfelt in a multi-stakeholder environment. The application and monitoring of criteria and indicators\nby the communities together with effective institutionalization and capacity-building can provide us\ntools to review the progress towards our goals of sustainability. This article discusses the application\nof criteria and indicator approach for sustainable forest management, giving a picture of the present\nsituation in the country towards achievement of sustainability of our forest resources.\n\nKeywords: Criteria and indicators approach, forest management, sustainability","torrent":{"xt":"urn:btih:1ab368e98baf2990e49ec6f21858b2717de68dfb","amp;dn":"Sustainable+forest+management+in+India","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ab368e98baf2990e49ec6f21858b2717de68dfb","infoHashBuffer":{"type":"Buffer","data":[26,179,104,233,139,175,41,144,228,158,198,242,24,88,178,113,125,230,141,251]},"announce":[],"urlList":[]}}