{"title":"PlayerPro Musiayer Full v2.22","uid":6949998,"size":4980782,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:1ac09002fb366cf24bffade2f39a814e6d29c686&amp;dn=PlayerPro+Musiayer+Full+v2.22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"StoneBoyTony","files":-1,"time":1326367366,"description":"PlayerPro Music Player Full v2.22\n\n\nPlayerPro Music Player 2.22 has been released for Android with all reported bugs fixed. PlayerPro Music Player is now compatible with Ice Cream Sandwich. PlayerPro 2.22 is compatible for Android OS 2.0 or later. PlayerPro Music Player is an advanced music and video player which enables you to Browse and Play your Favorite videos. Also customizable layout Like Grid or List form with PlayerPro Music Player 2.22. PlayerPro Music Player supports you option to select skin, option to display artist pictures instead of album artwork, display ratings, display shuffle/repeat, select button color. You can also download/search/save Lyrics to your music files using standard ID3 tags.\n\n\n\n\n\nMain Features Of PlayerPro Music Player 2.22:\n\nPlayerPro: skins, artist/album information and art, grid/list views, lyrics ...\n\nPlayerPro Music Player is an advanced music and video player for Android 2.x devices.\n\nKey features:\n\n* Browse and play your music by albums, artists, genres, songs, playlists, folders, and album artists.\n\n* Video browser and player.\n\n* Automatically downloads missing album artwork, artist pictures and genre illustrations.\n\n* Manually pick your preferred album artwork, artist pictures, genre illustrations from the Internet, the Gallery app, ID3 tags, or album folder.\n\n* Change the user interface of the Player by installing one of the 14 available SKINS, all for free.\n\n* Customize the layout, chosing between GRID or LIST views.\n\n* Read album and artist REVIEWS.\n\n* Download, search and and save LYRICS to your music files using standard ID3 tags.\n\n* Single and group TAG EDITING: title, album, artist, track, year, genre, comment. Formats supported: mp3, ogg, flac, wma, wav, m4a, mp4.\n\n* Mixable AUDIO EFFECTS for Android &gt;2.3 devices: 5 band graphic EQUALIZER with default/customizable presets (edit, rename, delete), STEREO WIDENING effect (virtualizer), REVERB effects (large hall, medium hall, plate, small room, medium room, large room), BASS BOOST effect, volume control.\n\n* Free additional DSP PLUGIN for Android &lt;=2.2 or &gt;=2.3 devices: 10 band graphic EQUALIZER with 15 default/customizable presets, PRE-AMP control, BASS BOOST control, volume control. Go to Settings &gt; Audio and select &quot;Download DSP pack&quot; option to install the free plugin.\n\n* Dolby and SRS sound effects for HTC devices equipped with HTC sound enhancement (HTC desire HD, etc).\n\n* Music stats and SMART PLAYLISTs: RATINGs, play/skip counts, last played, last added.\n\n* Import and export music history and ratings from your favorite desktop music player: Songbird, Winamp, Wmp, MediaMonkey, Music files.\n\n* Music folder selection.\n\n* Choice of 2 LOCK SCREEN widgets with many customization options: unlock slider, sound toggler, skip tracks using volume buttons, swipe gestures ...\n\n* Choice of 5 different home screen WIDGETs (4x1, 2x2, 3x3, 4x4, 4x2).\n\n* Supported SCROBBLERs: Simple Last.fm, Scrobble Droid, Official Last.fm app.\n\n* SLEEP TIMER with fade out.\n\n* SHARE text notifications, album/artist artwork on your favorite social networks: Twitter, Facebook, Gmail, Picassa etc.\n\n* HEADSET support. Customize long press and double/triple press actions.\n\n* Library wide SEARCH. VOICE search support.\n\n* SWIPE gestures (player: swipe album art to skip songs, browsers: swipe left to play next, swipe right to play last).\n\n* SHAKE IT feature: give your phone a shake to play nex","torrent":{"xt":"urn:btih:1ac09002fb366cf24bffade2f39a814e6d29c686","amp;dn":"PlayerPro+Musiayer+Full+v2.22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ac09002fb366cf24bffade2f39a814e6d29c686","infoHashBuffer":{"type":"Buffer","data":[26,192,144,2,251,54,108,242,75,255,173,226,243,154,129,78,109,41,198,134]},"announce":[],"urlList":[]}}