{"title":"Coast To Coast Am - 08-18-10 - Spiritualism, Ufos, &amp; Men In Blac","uid":5778038,"size":55813675,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1ac541eb2ba8f1708b4614e567b260f5ece7a141&amp;dn=Coast+To+Coast+Am+-+08-18-10+-+Spiritualism%2C+Ufos%2C+%26+Men+In+Blac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lyrian","files":5,"time":1282325163,"description":"Date:\n 08-18-10\n \nHost:\n George Noory\n \nGuests:\n Timothy Green Beckley, Daniel Estulin \n \n\n\nInvolved with UFOs and the paranormal from an early age, Timothy Green Beckley, discussed the connection between spiritualist phenomena and UFOs, as well as stories of visitations from Men in Black. He also spoke about his friendship with Uri Geller, and shared accounts of Geller's paranormal abilities such as key bending, and the altering of jewelry, just by waving his hand over these objects. On one occasion, Geller heard something pelting his roof and saw coins falling from the sky, Beckley detailed. \n\nWhile Harry Houdini had been a skeptic of the spiritualism movement, a number of seances were held, for 10 years after his death in 1926, to try and make contact with him. An audio excerpt from one of these seances was played on the air, although Beckley noted that Houdini never responded during the seances. Levitation and teleportation, sometimes seen in seances, are also reported in UFO cases, which has led Beckley to conclude these phenomena stem from the same source, and that UFOs hail from other dimensions rather than from extraterrestrial locations (see article below for more). \n\nMen in Black (MIBs) have been associated with the harassing or questioning of UFO witnesses, typically telling them not to report what they saw, said Beckley. He described them as looking like FBI or Secret Service agents, sometimes wearing a wide brimmed hat and dark sunglasses. Some of them appear not to be human and may have almond-shaped eyes, waxy lips, and be oddly dressed. Their visitations can be connected with mechanical phone calls, and the appearance of black helicopters, he added. &quot;I think from all I've been able to see, the MIBs are zombies-- they're under somebody else's control;&quot; they're like the waxy apparitions that appear in seances, he suggested. \n\nCastro Studies Bilderberg Book\nFirst hour guest, journalist Daniel Estulin reacted to a story that Fidel Castro is fascinated by his book, The True Story of the Bilderberg Group. &quot;Obviously, Fidel Castro is using the information in my book to his own personal advantage,&quot; he said, explaining that his expose of the Bilderbergers paints the West in a negative light, with its depiction of corporations and the financial elite controlling the populace. Castro has requested to meet personally with Estulin, and he is planning to take him up on his offer. \n\n\nWebsite(s):\n-conspiracyjournal.com\n-TeslaSecretLab.com\n-danielestulin.com\nBook(s):\n-Curse Of The Men In Black\n-MJ-12 and the Riddle of Hangar 18\n-Revealing The Bizarre Powers Of Harry Houdini\n-The True Story of the Bilderberg Group\n-Shadow Masters","torrent":{"xt":"urn:btih:1ac541eb2ba8f1708b4614e567b260f5ece7a141","amp;dn":"Coast+To+Coast+Am+-+08-18-10+-+Spiritualism%2C+Ufos%2C+%26+Men+In+Blac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ac541eb2ba8f1708b4614e567b260f5ece7a141","infoHashBuffer":{"type":"Buffer","data":[26,197,65,235,43,168,241,112,139,70,20,229,103,178,96,245,236,231,161,65]},"announce":[],"urlList":[]}}