{"title":"Naruto Episode 1 (480p)","uid":10732657,"size":38848569,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1c2d47ce0d76e754d2b1cfc193a30e799fc74aa3&amp;dn=Naruto+Episode+1+%28480p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407645862,"description":"For the first twelve years of his life, an orphaned boy named Naruto Uzumaki lived a life of enduring the apparent unsolicited hate from a majority of the villagers of the Hidden Leaf Village with a strong ambition to be acknowledged. Caught by his teacher Iruka Umino while defacing the Hokage monument, Naruto tells his teacher that he did it for attention and of his dream to become a Hokage to win everyone's respect. However, after failing to graduate from the Ninja Academy for the third year in a row for failing to use a clone jutsu, Naruto is approached by another instructor named Mizuki who talked him into stealing a scroll from the Third Hokage Hiruzen Sarutobi that contained the jutsus of his predecessor. Iruka finds Naruto and protects him from Mizuki, revealed to have used the boy to get the scroll with the intent to give it to a nation he is to defect to. During the confrontation, Mizuki reveals the truth that Naruto is the host of the Nine-Tails, a fox-like monster that attacked the village twelve years ago and took the life of the Fourth Hokage who managed to seal the Nine-Tails within the newborn Naruto. Horrified of this revelation, Naruto ran off and only returned when Iruka, whose parents were killed by the Nine-Tails, refuses to accept Naruto as anything but his student. Touched by his mentor's words, Naruto defeats Mizuki using the Shadow Clone jutsu he learned from the scroll. Due to the act of saving his life and making an outstanding performance proving him worthy of being a ninja, Iruka allows Naruto to graduate. ","torrent":{"xt":"urn:btih:1c2d47ce0d76e754d2b1cfc193a30e799fc74aa3","amp;dn":"Naruto+Episode+1+%28480p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c2d47ce0d76e754d2b1cfc193a30e799fc74aa3","infoHashBuffer":{"type":"Buffer","data":[28,45,71,206,13,118,231,84,210,177,207,193,147,163,14,121,159,199,74,163]},"announce":[],"urlList":[]}}