{"title":"Alamak Toyol","uid":6829172,"size":368174424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c35685c417825e1de485003ba0eea9087dab2cb&amp;dn=Alamak+Toyol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zaini711","files":3,"time":1321718934,"description":"Pengarah: Ismail bob Hashim\nPenerbit: Metrowealth Movies Production Sdn. Bhd.\nDipawagam: 03 November 2011\nPelakon Alamak Toyol: Along Cham, Angah Raja Lawak, Afiq Izzudin, Hamid Gurkha, Yank Kassim, Adeline Tsen\n\nKisah bermula dengan Pak Umar yang pergi berjumpa dengan bomoh untuk mendapatkan toyol atas niat untuk cepat kaya. Bomoh itu mempunyai banyak koleksi toyol dan setiap toyol mempunyai harga masing-masing. Oleh kerana tidak mampu, Pak Umar mengambil toyol yang paling murah. Setelah mengambil toyol dari bomoh, bomoh tersebut mengecop barcode di dada kiri Pak Umar. Pada waktu yang sama, Fakhrul dan Kudin yang juga merupakan sahabat baik juga memikirkan jalan untuk mendapatkan duit. Hampir setiap hari mereka mencuba kaedah baru untuk merompak namun semuanya gagal.\n\nSehinggalah pada suatu hari, Fakhrul dan Kudin mahu merompak Pak Umar namun Pak Umar tiada duit untuk diberikan pada mereka. Pak Umar bercadang mahu memberi toyol tersebut pada Fakhrul dan Kudin. Pada mulanya Fakhrul dan Kudin menolak toyol itu. Namun lama-kelamaan mereka sanggup untuk menerima toyol itu daripada Pak Umar. Toyol beralih arah dan barcode di dada kiri Pak Umar hilang serta-merta dan timbul barcode di dada kiri Fakhrul dan Kudin. Sejak hari itu, bermulalah kisah Fakhrul dan Kudin yang mahu jadi cepat kaya. Malangnya nasib mereka apabila toyol yang diambil dari Pak Umar itu tidak pandai mencuri. Fakhrul dan Kudin terpaksa mengajar teori dan praktikal kepada toyol tersebut untuk mencuri.\n\nDi satu tempat yang lain, Farah yang selama ini setia bekerja dengan Daniel akhirnya mengetahui rupa-rupanya selama ini Daniel menjalankan perniagaan haram iaitu dengan menyeludup dadah. Farah yang mengetahui hal ini telah membuat laporan polis namun pihak polis tidak berjumpa sebarang bukti. Daniel berdendam dengan Farah dan berniat mahu menghapuskan Farah. Suatu malam yang dingin, oleh kerana banyak kali gagal dalam mencuri, Fakhrul dan Kudin berniat untuk mengembalikan toyol pada Pak Umar kembali. Toyol dengan wajah sedih meminta satu lagi peluang dari Fakhrul dan Kudin. Toyol telah masuk untuk merompak rumah Farah dan di sini menjadi titik permulaan pertemuan antara Fakhrul, Kudin dan Farah. Fakhrul dan Kudin terpaksa menolong Farah untuk membongkarkan rahsia Daniel dalam masa yang sama mereka terpaksa mencari Pak Umar untuk mengembalikan toyol tersebut.\n\nPLEASE DONATE TO KEEP MY SEEDS CONNECTION ALIVE\n\nPaypal ( &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9ed6dfd0c7dfafdad1caddd1d3ded9d3dfd7d2b0ddd1d3&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; )\n \n\nPlease visit website HTTP://JIKA1.COM to show support\t\t","torrent":{"xt":"urn:btih:1c35685c417825e1de485003ba0eea9087dab2cb","amp;dn":"Alamak+Toyol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c35685c417825e1de485003ba0eea9087dab2cb","infoHashBuffer":{"type":"Buffer","data":[28,53,104,92,65,120,37,225,222,72,80,3,186,14,234,144,135,218,178,203]},"announce":[],"urlList":[]}}