{"title":"Freedom Riders - 1961 and the Struggle for Racial Justice","uid":8245111,"size":42206753,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c38c3a5583a201b7b9bceb26f7c2e461fc365f1&amp;dn=Freedom+Riders+-+1961+and+the+Struggle+for+Racial+Justice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":3,"time":1363038467,"description":"Freedom Riders - 1961 and the Struggle for Racial Justice\n\nNOTICES:\n1.  See this site for &quot;Freedom Riders&quot; documentaries\n2.  This was a very difficult scan.  Want prefection?  Look elsewhere.  Don't complain.\n\n-----------\n\nThey were black and white, young and old, men and women. In the spring and summer of 1961, they put their lives on the line, riding buses through the American South to challenge segregation in interstate transport. Their story is one of the most celebrated episodes of the civil rights movement, yet a full-length history has never been written until now. In these pages, acclaimed historian Raymond Arsenault provides a gripping account of six pivotal months that jolted the consciousness of America.\n\nThe Freedom Riders were greeted with hostility, fear, and violence. They were jailed and beaten, their buses stoned and firebombed. In Alabama, police stood idly by as racist thugs battered them. When Martin Luther King met the Riders in Montgomery, a raging mob besieged them in a church. Arsenault recreates these moments with heart-stopping immediacy. His tightly braided narrative reaches from the White House--where the Kennedys were just awakening to the moral power of the civil rights struggle--to the cells of Mississippi's infamous Parchman Prison, where Riders tormented their jailers with rousing freedom anthems. Along the way, he offers vivid portraits of dynamic figures such as James Farmer, Diane Nash, John Lewis, and Fred Shuttlesworth, recapturing the drama of an improbable, almost unbelievable saga of heroic sacrifice and unexpected triumph.\n\nThe Riders were widely criticized as reckless provocateurs, or &quot;outside agitators.&quot; But indelible images of their courage, broadcast to the world by a newly awakened press, galvanized the movement for racial justice across the nation. Freedom Riders is a stunning achievement, a masterpiece of storytelling that will stand alongside the finest works on the history of civil rights.","torrent":{"xt":"urn:btih:1c38c3a5583a201b7b9bceb26f7c2e461fc365f1","amp;dn":"Freedom+Riders+-+1961+and+the+Struggle+for+Racial+Justice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c38c3a5583a201b7b9bceb26f7c2e461fc365f1","infoHashBuffer":{"type":"Buffer","data":[28,56,195,165,88,58,32,27,123,155,206,178,111,124,46,70,31,195,101,241]},"announce":[],"urlList":[]}}