{"title":"Dexys Midnight Runners - Searching for the Young Soul Rebels [19","uid":8981873,"size":249649621,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1c495f22fc7d9c3a66411562b1696b61a7100d26&amp;dn=Dexys+Midnight+Runners+-+Searching+for+the+Young+Soul+Rebels+%5B19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1380583634,"description":"Artist: Dexys Midnight Runners\nRelease: Searching for the Young Soul Rebels\nReleased: 1980\nLabel: 1988 - EMI\nCatalog#: CDP 7 46448 2 / First CD Pressing \nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: UK\nStyle: Rock\n\nimage\n\n1\t Burn It Down\t4:10\t\n2\t Tell Me When My Light Turns Green\t3:44\t\n3\t The Teams That Meet In Caffs\t4:06\t\n4\t I'm Just Looking\t4:40\t\n5\t Geno\t3:29\t\n6\t Seven Days Too Long\t2:38\t\n7\t I Couldn't Help If I Tried\t4:13\t\n8\t Thankfully Not Living In Yorkshire It Doesn't Apply\t2:57\t\n9\t Keep It\t3:57\t\n10\t Love Part One\t1:11\t\n11\t There, There, My Dear\t3:26\t\n\nThe crackling stations being switched on the radio and the gang shout followed by the spoken injunction to &quot;burn it down&quot; sound like they should be starting off a Sham 69 record. Then &quot;Burn It Down&quot; actually starts, with its horn section, Hammond organ and Kevin Rowland's utterly unconventional soul vocals. The cult of Dexy's, and this album in particular, were worshipped as the return of &quot;soul&quot; to English rock music at the dawn of Thatcherism. Exploring the myth that this album holds, especially in Brit music terms, can be a strange prospect: 20 years on it doesn't sound revolutionary, it just sounds good. And good it is, quite good, compared to where Paul Weller ended up, i.e., too reverential by half. This is vibrant, alive, and unconcerned with perfection. Rowland takes a role that Morrissey would have in 1985 and Jarvis Cocker in 1995 -- the unexpected but perfect voice to capture a time and moment in the U.K. His slightly strangled wail and sly, wry lyrics and song titles (&quot;Tell Me When My Light Turns Green,&quot; &quot;Thankfully Not Living in Yorkshire It Doesn't Apply&quot;) make this album in many ways. Musically, the group lays down R&amp;B grooves and brassy hooks with aplomb, as on the brilliant &quot;Seven Days Too Long&quot; and the number one single &quot;Geno,&quot; but throw in film noir touches, John Barry-writing-for-James Bond fare and more just as ably. The liner notes have a fun description of the group's origins and brief notes for most of the tunes -- the best for the finale, &quot;There, There, My Dear&quot;: &quot;P.S. Old clothes do not make a tortured artist.&quot; .","torrent":{"xt":"urn:btih:1c495f22fc7d9c3a66411562b1696b61a7100d26","amp;dn":"Dexys+Midnight+Runners+-+Searching+for+the+Young+Soul+Rebels+%5B19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c495f22fc7d9c3a66411562b1696b61a7100d26","infoHashBuffer":{"type":"Buffer","data":[28,73,95,34,252,125,156,58,102,65,21,98,177,105,107,97,167,16,13,38]},"announce":[],"urlList":[]}}