{"title":"Simon Singh, Edzard Ernst - Aghi, Pozioni e Massaggi - La veritÃƒ","uid":4673655,"size":1841491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c72fbdcd198672c9eeb29debc974fae9530a195&amp;dn=Simon+Singh%2C+Edzard+Ernst+-+Aghi%2C+Pozioni+e+Massaggi+-+La+verit%C3%83&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"voxel","files":1,"time":1232820820,"description":"Da ammalati siamo pronti a credere a qualsiasi cosa, ad affidarci a qualunque rimedio pur di guarire. Nel corso della storia ci sono stati inflitti sanguisughe e salassi (spesso mortali), erbe e radici di ogni genere. Anche oggi, ampolle di vetro incandescenti, aghi e sassolini proposti dalle tradizioni &quot;orientali&quot; vanno e vengono dalle pagine delle riviste e dalle abitudini dei piÃƒÂ¹ modaioli. Balsami della nonna si susseguono nelle vetrine delle erboristerie. Tutto questo senza che, per legge, sia necessaria alcuna sperimentazione scientifica. E allora chi ci assicura che essenze, estratti e tinture madri non siano soltanto acqua venduta a prezzi esorbitanti in confezioni ben disegnate? Che siano davvero gli aghi piantati nel collo a farci passare il mal di testa? Mentre migliaia di pazienti ogni anno si convertono alla medicina alternativa, i medici tradizionali rimangono scettici e invitano alla cautela: orientarsi nell'offerta ormai vastissima del mercato e scoprire i truffatori prima che facciano danni diventa sempre piÃƒÂ¹ difficile. In questa prima panoramica completa della medicina non convenzionale, Simon Singh e Edzard Ernst portano le varie terapie sul banco degli imputati e le sottopongono a test scientifici, come quelli obbligatori per tutti gli altri farmaci. Avvalendosi dei piÃƒÂ¹ recenti trial clinici e di casi reali, fanno finalmente chiarezza su agopuntura, omeopatia, chiropratica, erboristeria e molte altre discipline: dalle origini all'attuale diffusione, dalla teoria alle applicazioni pratiche, dimostrano quali rimedi sono efficaci, a chi servono, che disturbi curano e in base a quali principi attivi. E per contro, quali medicamenti miracolosi sono semplici placebo che funzionano solo grazie a buone strategie di marketing. Efficacissimi sÃƒÂ¬: nel prosciugare le tasche di malati troppo pazienti.","torrent":{"xt":"urn:btih:1c72fbdcd198672c9eeb29debc974fae9530a195","amp;dn":"Simon+Singh%2C+Edzard+Ernst+-+Aghi%2C+Pozioni+e+Massaggi+-+La+verit%C3%83","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c72fbdcd198672c9eeb29debc974fae9530a195","infoHashBuffer":{"type":"Buffer","data":[28,114,251,220,209,152,103,44,158,235,41,222,188,151,79,174,149,48,161,149]},"announce":[],"urlList":[]}}