{"title":"Red Alert 3 Missing Key Generator","uid":4482166,"size":42213,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e70165290305ceff64468b13db1bd233aad357e&amp;dn=Red+Alert+3+Missing+Key+Generator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViRiX","files":1,"time":1225621188,"description":"Today the news arrived that Electronic Arts had a bit of bad luck; in the printing procees a large set of manuals, which hold the license key required to install Red Aler 3, is missing the last character of the game license. Only 19 characters were printed while a correct serial is comprised of 20 characters.\n\nPeople who are affected by this can do one of two things, and I hope to add a third later today.\n\n1) Scan your manual, mail it to Electronic Arts, and they will send you your serial number\n2) Try to brute-force the serial numer (trying 0-9 an A-Z)\n\nSince brute forcing the serial is the fastest solution, but not really a nice solution, I decided to write a program that will do the brute-forcing for you. When done (don&amp;#039;t have Red Alert 3 yet), it will allow you to enter your 19 characters and will brute-force the last character for you.\n\nThe program will check for the File &quot;EASetup.exe&quot; on every drive from C to Z, and will pick the one he finds first. If the file is not found, it will prompt you to insert the Red Alert 3 DVD.\n\nThe main program will show now (see screenshot), and you can enter your 19 characters of the serial number here (focus will adjust as you type the key, so no need to tab). \n\nOnce all characters have been entered, press Crack. This will launch the Red Alert 3 setup. \n\nThe EA setup will auto-close after three invalid tries, so the program will re-launch the setup as much times as needed and keeps trying the missing character till a valid entry is found.\n\nOnce the key is found, the program will display a message box so that you can write it down for future reference, and after pressing ok, the program will exit.\n\nI hope you appreciate my efforts.\n &lt;a href=&quot;\nhttp://www.nickkusters.com/articles/82/Red_Alert_3_Manuals_Missing_Last_License_Character.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nickkusters.com/articles/82/Red_Alert_3_Manuals_Missing_Last_License_Character.aspx&lt;/a&gt;","torrent":{"xt":"urn:btih:1e70165290305ceff64468b13db1bd233aad357e","amp;dn":"Red+Alert+3+Missing+Key+Generator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e70165290305ceff64468b13db1bd233aad357e","infoHashBuffer":{"type":"Buffer","data":[30,112,22,82,144,48,92,239,246,68,104,177,61,177,189,35,58,173,53,126]},"announce":[],"urlList":[]}}