{"title":"Ziggurat (Update 5)","uid":10931311,"size":299480089,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e95c23bbe9daa0461da774b1157d479a2321d94&amp;dn=Ziggurat+%28Update+5%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1409406417,"description":"Ziggurat is a dungeon crawling FPS, with procedurally generated scenarios and encounters. You'll face dozens of dangerous enemies while you find new and powerful spells, and learn helpful perks in your quest to overcome this deadly test.\n\nNote from the developer on changes in update 5:\n&quot;Beware! Some of the new features haven't been properly balanced (we'll wait until we hear your opinion to decide on balance), and they may be overpowered or underpowered. There's also a lack of sounds and visual feedback on many of the Amulet related interactions. We'll work on them on future updates.&quot;\n\n- New optional challenge rooms, with punishing platforming sections, and big rewards if you manage to get to the end.\n- New feature: Amulets. They can be found in challenge rooms and treasure rooms, and have powers that can be activated by pressing the E key. Some powers last some time, such as double damage, and others are applied instantly.\n- Currently the amount of amulets is a bit low and, although they are useful, their powers aren't that interesting. We plan on doing more amulets with more specific behaviors in the future.\n- Bestiary should properly work now.\n- Now you can switch to the last weapon you selected by pressing Q.\n- View bob/zoom while sprinting can be disabled in game options.\n- Reduced zoom out while sprinting on high FOV settings.\n- Treasure boxes can now give perks, just like secret rooms.\n- Improved the ending cutscenes.\n\nIf you like the game, support the developer, buy it!  &lt;a href=&quot;\nhttp://store.steampowered.com/app/308420&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/308420&lt;/a&gt;","torrent":{"xt":"urn:btih:1e95c23bbe9daa0461da774b1157d479a2321d94","amp;dn":"Ziggurat+%28Update+5%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e95c23bbe9daa0461da774b1157d479a2321d94","infoHashBuffer":{"type":"Buffer","data":[30,149,194,59,190,157,170,4,97,218,119,75,17,87,212,121,162,50,29,148]},"announce":[],"urlList":[]}}