{"title":"Saraswatir Pratignya (1966) Bengali-dubbed - Xvid 1.0g - No Subs","uid":11168371,"size":1073730548,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1ed93e631f059e8cf7111418658f4d7844e181a2&amp;dn=Saraswatir+Pratignya+%281966%29+Bengali-dubbed+-+Xvid+1.0g+-+No+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1412662027,"description":"Saraswatir Pratignya (1966) Bengali-dubbed - Xvid 1.0g - No Subs - Sivaji Ganesan, Savitri [DDR]\n\nSaraswati Sabatham (1966) is the Tamil Original Version\nSaraswati Laxmi Parvati (1975) is the Hindi Version\n\nSaraswati Sabatham (1966) is a Tamil mythological film, written and directed by A. P. Nagarajan and starring Sivaji Ganesan, Gemini Ganesan, Savitri, Devika, Padmini, K. R. Vijaya, Manorama and Nagesh.\n\n    CAST:-\n    Sivaji Ganesan as Vidyapati and Narada\n    Gemini Ganesan as Malaya\n    Devika as Lakshmi\n    Padmini as Parvati\n    Savitri as Saraswati\n    Sivakumar as Vishnu\n    K. R. Vijaya as Selvambigai\n    Manorama\n    Nagesh\n    K. Sarangkapani\n\nDirected by A. P. Nagarajan\nProduced by A. P. Nagarajan\nWritten by A. P. Nagarajan\nMusic Director: Hemant Kumar (for the Bengali Dubbed Version)\nMusic by K. V. Mahadevan\nRuntime 91 mins\nRunning time 148 mins\ntt0246913\n\nSongs are included in MP3s\nSaraswatir Pratignya (1966) Bengali 00. TItle Music and Screen Credits\nSaraswatir Pratignya (1966) Bengali 01. Song 1\nSaraswatir Pratignya (1966) Bengali 02. Song 2\nSaraswatir Pratignya (1966) Bengali 03. Song 3\nSaraswatir Pratignya (1966) Bengali 04. Song 4\nSaraswatir Pratignya (1966) Bengali 05. Song 5\nSaraswatir Pratignya (1966) Bengali 06. Verses\n \nSYNOPSIS:- Saraswatir Pratignya (1966) Bengali a.k.a Saraswati Sabatham (1966) Tamil\nSaraswati Sabatham tells the story of a dispute between three goddesses over which has the best power. Narada (Sivaji Ganesan), a sage and celestial troublemaker, begins the fight by visiting Saraswati (Savitri), the Goddess of knowledge, and purposely annoys Her by saying that wealth is more important and abundant. Saraswati angrily said that She will prove that Her power, knowledge is more important. Narada then goes to Vaikuntha to see Lakshmi (Devika), the Goddess of wealth, and also annoys Her by saying that education is more abundant and is the best. Lakshmi also retorted that She will prove that Her power of wealth is more important. Narada finally goes to Mount Kailas, seeking Parvati(Padmini), the goddess of power and strength and annoys Her too, saying that wealth and knowledge is more important. Parvati too stressed that She will prove that Her power of strength is more important.\n\nThe three Goddesses, having turned against each other, each decide to choose someone on earth and bless them powers so that each of them can prove their power and make the other two Goddesses lose. Saraswati blesses a mute person, Vidyapati (Sivaji Ganesan), to speak and gives him all the knowledge in the world. There is a place where a Maharaja rules but he has no children. He is dying so his minister sends the royal elephant into the streets with a garland. The person whose neck the elephant puts the garland on will be the next Maharani or Maharaja. Lakshmi controls the royal elephant and makes it give the garland to a beautiful beggar girl (K.R. Vijaya). Now the beggar girl is a very wealthy Maharani and lives in a palace Due to her beauty, everyone wants to marry her. There is someone who has been a coward his whole life (Gemini Ganesan), whom Parvati blesses to become very strong.\n\nCoincidentally the three people chosen by the Goddesses belong to the same country.Three of them became so proud of each other's strength. As for the mute person, he has knowledge, as for the beggar girl, she has money and beauty and for the coward, he has bravery. One day the warrior was crowned chief of the soldier lead. When the singer was given a golden pendant, he rejected the gift and then insults the queen in the presence of all that she is a brainless ruler. Suddenly, the warrior ordered the soldier to be put to prison without the queen's permission. Actually, the queen had fallen head over heels in love with the musician. Secretly she went to the prison and ask him to marry her if he sings of her praise. He rejects. Making the queen angry which she shows the anger to the warrior. The warrior who was very angry killed all the queen's soldiers and replace them with his own soldiers. Soon, everyone listened to only his orders. One Day, the warrior intended to kill both the queen and the musician but suddenly his sword dissapeard. In the end the Gods of the Holy Trinity, Lords Shiva(Harnath), Vishnu (Sivakumar), and Brahma settle the dispute by explaining the importance of knowledge, wealth, and strength combined, and how dangerous it is if each power goes separately. Finally, the three Goddesses reconcile and the three blessed by them along with the common people unite and realise that knowledge, wealth and strength are all equally important in many ways. The three Goddesses blesses the country and Sage Narada, thanking him for making the world understand the unity of knowledge, wealth and strength and for uniting them also, marking the end of the film.\n\nVidyapati is a mute who lives a poor lifestyle with his widower father in the Ashwarayapur region. One day Devi Maa Saraswati appears before him, blesses him, gives him intelligence as well as his vocal chords, so that he can sing her praises, as well as spread the word knowledge is the best virtue and boon for human beings. Maalya is a coward who also lives a poor lifestyle, who, in turn, is blessed by Devi Maa Parvati, who gives him courage and strength, so that he can sing her praises as well as spread the word that strength is indeed the best boon for human beings. Maalya instantly becomes strong, defeats the regions' two top wrestlers single-handedly, and becomes famous overnight. Ashwarayapati is a beggar, who is blessed with infinite riches by Devi Maa Lakshmi, so that she can spread the word that Wealth is the best boon for human beings. She is subsequently crowned the Queen of Ashwarayapur. She hears of Vidyapati, meets him, hears him sing, is pleased, attempts to reward him,.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1060 kbps\nVideo Resolution: 352x272\nVideo Aspect Ratio: 1.294:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 224kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: Bengali (dubbed .from Tamil)\nRunTime: 1:29:17\nSubtitles: NONE\nRipped by: Trinidad [DDR] ","torrent":{"xt":"urn:btih:1ed93e631f059e8cf7111418658f4d7844e181a2","amp;dn":"Saraswatir+Pratignya+%281966%29+Bengali-dubbed+-+Xvid+1.0g+-+No+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ed93e631f059e8cf7111418658f4d7844e181a2","infoHashBuffer":{"type":"Buffer","data":[30,217,62,99,31,5,158,140,247,17,20,24,101,143,77,120,68,225,129,162]},"announce":[],"urlList":[]}}