{"title":"BoundGods--BG-40639 Rikk York and Trenton Ducati HD","uid":15564660,"size":2168081184,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1f61b9a256d065e67f16a81f53420e81c0b2179b&amp;dn=BoundGods--BG-40639+Rikk+York+and+Trenton+Ducati+HD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":1,"time":1471181115,"description":"\nRikk York Loves to Lick Leather while being Chained and Flogged \r\n\r\nAug 11, 2016 - Rikk York, Trenton Ducati\r\n\r\n\r\nHD MP4 only.\r\n\r\n\r\n\r\nRikk York expects his day to end with a quick fuck from the massive hunk he just met. What Rikk fails to realize is that this hunk is Trenton Ducati, and he likes to play rough. Trenton takes Rikk to a nice secluded spot and quickly tears away all his clothes. He then chains Rikk against a pillar, and viciously flogs every inch of his body. Trenton takes a moment to let Rikk rest, by chaining Rikk to the wall and filling his mouth with Trenton's massive cock. Trenton holds Rikk's mouth against his cock while repeatedly pummeling him with a crop. Rikk can't help but want more. Trenton presents his boot to his fuck slave, and tells him to start cleaning. Rikk runs his salivating tongue across Trenton's thick black boots until they glisten in the daylight. His master is pleased. Trenton rewards him by bending him over and tongue fucking his ass before shoving his throbbing cock inside. Rikk is in ecstasy as his arms and legs are chained to the wall, while Trenton continues to fuck his tight ass. Trenton grips Rikk's dick and starts stroking. Cum flies from Rikk's cock and covers his chest. Trenton wants his fuck toy to be drenched in cum, so he pulls his cock out of Rikk's ass and blows his load across his bearded face. \r\n\r\nScreens \nhttp://www.kink.com/shoot/40639\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:1f61b9a256d065e67f16a81f53420e81c0b2179b","amp;dn":"BoundGods--BG-40639+Rikk+York+and+Trenton+Ducati+HD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f61b9a256d065e67f16a81f53420e81c0b2179b","infoHashBuffer":{"type":"Buffer","data":[31,97,185,162,86,208,101,230,127,22,168,31,83,66,14,129,192,178,23,155]},"announce":[],"urlList":[]}}