{"title":"Seaguy (Complete) [English]","uid":8053359,"size":298270254,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1fe6a6de77fbc9e1ccf59df8d3bdcaf342ee8928&amp;dn=Seaguy+%28Complete%29+%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hamster-X","files":-1,"time":1358903437,"description":"English | CBR \n\nWriter: Grant Morrison\nArtist: Cameron Stewart\n\n\nSeaguy is a three-volume comic book miniseries written by Grant Morrison with art by Cameron Stewart and published by the Vertigo imprint of DC Comics. The first volume of Seaguy was released in three issues beginning on May 19, 2004. The second volume, Slaves of Mickey Eye, was released in three issues beginning April 1, 2009. The third and final volume, Seaguy Eternal is yet to be published.\n\nSeaguy is a super-hero who has never really had an adventure and spends his days in New Venice playing chess with Death, watching Mickey Eye (a cartoon show about an all-seeing, all-knowing, psychopathic eye, and an obvious spoof on Mickey Mouse) and going to the Mickey Eye amusement park. He constantly expresses his wish to go on adventures and impress a beautiful bearded warrior woman named She-Beard but he never seems to get around to it because he's told the world doesn't need heroes anymore. However, when Seaguy and Chubby discover that a new food staple called Xoo is sentient, they decide to protect it from evil forces and bring it home.\n\nSeaguy exists in a seemingly perfect world in which all the super-heroes no longer save lives or do much of everything except ride the rides at the Mickey Eye amusement park. It is public knowledge that all the evil in the world was finally destroyed after a powerful entity called the Anti-Dad was destroyed by all the super-heroes, effectively leaving the heroes without jobs. The style of the book is equal parts dark tragedy and light-hearted whimsy as the main character travels from one adventure to the other, but with each adventure becoming more tragic than the one before it, until Seaguy discovers the secret history of the moon.\n\n\n\nEnjoy and seed!\t\t","torrent":{"xt":"urn:btih:1fe6a6de77fbc9e1ccf59df8d3bdcaf342ee8928","amp;dn":"Seaguy+%28Complete%29+%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fe6a6de77fbc9e1ccf59df8d3bdcaf342ee8928","infoHashBuffer":{"type":"Buffer","data":[31,230,166,222,119,251,201,225,204,245,157,248,211,189,202,243,66,238,137,40]},"announce":[],"urlList":[]}}