{"title":"Up with Chris Hayes 1-5-13.mp4","uid":7992948,"size":357294884,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:206088100b4c2eb6eb62a84b1e484792c1883079&amp;dn=Up+with+Chris+Hayes+1-5-13.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"liberal42","files":-1,"time":1357531828,"description":"Up with Chris Hayes; Saturday, January, 5, 2013.\n\nJoining Chris were:\nRep. Jerrold Nadler (D-NY) (currently serving his tenth full term representing the 8th congressional district of New York), Suzy Khimm (reporter for the Washington Post), David Cay Johnston (Pulitzer Prize winning journalist and author of &quot;The Fine Print: How Big Companies Use Plain English to Rob You Blind&quot;), and Veronique de Rugy (senior research fellow at the Mercatus Center at George Mason University) they examined the implications of the last-minute deal to avert what Up is calling the &quot;fiscal curb,&quot; and discussed what the final deal reveals about who actually wields power in Washington. They also highlighted some of the hidden tax extenders for corporations that you didn't know were included in the bill.\n\nOliver Stone (award-winning director, producer and screenwriter. His films include Platoon, Scarface and Natural Born Killers. His latest project is a ten-part documentary series titled The Untold History of the United States, which he co-wrote with historian Peter Kuznick. Stone also received a Bronze Star and a Purple Heart for his service in the Vietnam War) sat down with Chris to discuss his work and the renewed concerns over portrayals of violence in film.\n\nPeter Kuznick (history professor and director of the Nuclear Studies Institute at American University, co-writer of The Untold History of the United States), joined Oliver Stone about their latest project, The Untold History of the United States, a ten-part documentary series airing on Showtime.\n\nMost of the original panel stayed for 'Now We Know' Oliver Stone replaced Jerrod Nadler on the panel. ","torrent":{"xt":"urn:btih:206088100b4c2eb6eb62a84b1e484792c1883079","amp;dn":"Up+with+Chris+Hayes+1-5-13.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"206088100b4c2eb6eb62a84b1e484792c1883079","infoHashBuffer":{"type":"Buffer","data":[32,96,136,16,11,76,46,182,235,98,168,75,30,72,71,146,193,136,48,121]},"announce":[],"urlList":[]}}