{"title":"The Art of Blowjob - Beautiful Blowjob Bathed in Light","uid":8899438,"size":200874463,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2061cd074207ad88b3b02908d2f8559ce1efab34&amp;dn=The+Art+of+Blowjob+-+Beautiful+Blowjob+Bathed+in+Light&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":null,"files":1,"time":1378781112,"description":" &lt;a href=&quot;http://picturemost.biz/share.php?id=E3AC_522E6B4F&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://picturemost.biz/share.php?id=E3AC_522E6B4F&lt;/a&gt;\n\nFebuary 03, 2012\nThe atmosphere here is so inviting. You touch me, I'll touch you and we'll just let the passion overcome us. Kissing and rubbing, we get sucked up in the moment. As I take my time lavishing attention on your body, I focus on your nipples, lightly biting and kissing with loving desire. I pause when I get to your cock, taking it and licking one finger before gently placing it on your cockhead to get you used to the sensation of my wet mouth. It's such a tease, but I look at you with smouldering desire as I do it.\n\nWhen I take you in my mouth, I run my palms along your body. They caress all the way down your legs, along the sides of your hips and up your stomach, causing you to inhale deeply in reaction to the motion. All the while, I'm sucking at your cock, taking you deeper until my hands stop and I focus entirely on the deep throating at hand. I grab the base of your cock and use my fists to make sure that every inch of your cock is covered and take care of.\n\nMy tongue teases your frenulum, followed by more deep throating as I cradle your balls gently in my hands. Everything feels warm and loving, just like this room as it's bathed in light. I rub your cockhead along my lips for a little more gentle teasing. It's not to drive you crazy, it's just to make you feel so good with my sweet and caring approach, so I change up the sensations as much as I can. As I go back to deep throating, I use one hand to stroke you and the other tickles and scratches along your side.\n\nFinally, I get to using two hands, knowing that you're about to come for me. I take you deep as you start to explode, filling my closed mouth with your creamy cum. I swallow every drop greedily, showing only the remnants which coat my tongue. Continuing to suck, Size: 200874463 bytes (191.57 MiB), duration: 00:07:41, avg.bitrate: 3486 kb/s\nAudio: aac, 44100 Hz, 2 channels, s16, 151 kb/s (und)\nVideo: h264, yuv420p, 1280x720, 3326 kb/s, 24.00 fps(r) (und)\nTrack: 65535\nstep: 41 s; # tiles: 2x5, tile size: 510x286; total size: 1024x1454I feel you slowly soften in my mouth and hands.\n\n","torrent":{"xt":"urn:btih:2061cd074207ad88b3b02908d2f8559ce1efab34","amp;dn":"The+Art+of+Blowjob+-+Beautiful+Blowjob+Bathed+in+Light","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2061cd074207ad88b3b02908d2f8559ce1efab34","infoHashBuffer":{"type":"Buffer","data":[32,97,205,7,66,7,173,136,179,176,41,8,210,248,85,156,225,239,171,52]},"announce":[],"urlList":[]}}