{"title":"Atrapado.En.Un.Pirado.[2008].[Spanish].[DVD-Screener].[Xvid].[ww","uid":4405108,"size":743043072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20734b778548449c9c814a67bb8736f04f48d9bb&amp;dn=Atrapado.En.Un.Pirado.%5B2008%5D.%5BSpanish%5D.%5BDVD-Screener%5D.%5BXvid%5D.%5Bww&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Torrentazos","files":1,"time":1221907801,"description":"TÃƒÂ­tulo original: Meet Dave\nAÃƒÂ±o: 2008\nPaÃƒÂ­s: USA\nDuraciÃƒÂ³n: 90 min\nEstreno en EspaÃƒÂ±a: 19-09-2008\nEstreno en USA: 11-07-2008\nDirector: Brian Robbins\n\nReparto: Eddie Murphy, Gabrielle Union, Ed Helms, Elizabeth Banks, Judah Friedlander, Pat Kilbane\n\nGuiÃƒÂ³n: Bill Corbett, Rob Greenberg\nMÃƒÂºsica: John Debney\nProductora: 20th Century Fox\nGÃƒÂ©nero: Comedia\n\nSinopsis: Dave Ming Chang (Eddie Murphy), reciÃƒÂ©n llegado a Nueva York, es casi sin duda el visitante mÃƒÂ¡s perdido de todos. Hay algo en ÃƒÂ©l que no encaja, para empezar, parece totalmente fuera de lugar, e incomodo con su propio cuerpo. Y tiene motivos: Ã‚Â«DaveÃ‚Â» no es un hombre, si no una nave hecha a imagen y semejanza del comandante en miniatura que la controla. Tiene unos cuarenta aÃƒÂ±os, agraciado y elegantÃƒÂ³n, a pesar de que su atuendo, un traje blanco, corbata negra y paÃƒÂ±uelo a juego en el bolsillo, es mucho mÃƒÂ¡s cercano a los discotequeros aÃƒÂ±os 70. Pero mÃƒÂ¡s allÃƒÂ¡ de su extraÃƒÂ±o atuendo, hay algo en Dave que llama la atenciÃƒÂ³n. Desde luego no es del barrio, de hecho, ni siquiera del planeta. Hasta su forma de caminar es peculiar, y mientras deambula por las calles de la gran manzana, sus piernas intentan avanzar demasiado con cada paso, como si no estuviese cÃƒÂ³modo en su cuerpo. Y motivos no le faltan: dentro de Ã‚Â«DaveÃ‚Â» tenemos a toda una tripulaciÃƒÂ³n de entrenados hombrecillos, un mundo dentro de otro mundo, que intentan por todos los medios controlar cada acciÃƒÂ³n y conversaciÃƒÂ³n de Dave. En cada secciÃƒÂ³n del cuerpo de Ã‚Â«DaveÃ‚Â», un tripulante (altura media: cuatro centÃƒÂ­metros y medio), con una insignia que ilustra una parte especÃƒÂ­fica del cuerpo de Dave, gestiona una consola de ÃƒÂºltima generaciÃƒÂ³n que controla los movimientos de Dave. Pero la tripulaciÃƒÂ³n de Dave, bajo la direcciÃƒÂ³n del Comandante del que Dave ha tomado su apariencia, va a experimentar una curva de aprendizaje muy escarpada. Cuando Dave bebe su primer sorbo de agua, una tremenda ola se abalanza sobre ellos, empapando a todos en su interior. Cuando Dave se prueba algo de ropa, una camisa se convierte en una bestia de algodÃƒÂ³n que intenta asfixiarlo. Cuando acude a un examen mÃƒÂ©dico rutinario, el Dave metÃƒÂ¡lico debe luchar contra las formidables fuerzas magnÃƒÂ©ticas de una resonancia. Y el banquete de tubos de carne procesada que aquÃƒÂ­ denominamos Ã‚Â«perritos calientesÃ‚Â» le conduce a una explosiva situaciÃƒÂ³n en el baÃƒÂ±o. Al tiempo que Dave se abre camino a travÃƒÂ©s de estos desafÃƒÂ­os fÃƒÂ­sicos, la tripulaciÃƒÂ³n de su interior comienzan a experimentar algo con efectos aÃƒÂºn mÃƒÂ¡s profundos. Una brisa de emociones se extiende por entre la tripulaciÃƒÂ³n, que proviene de un lugar que desaprueba las emociones y la individualidad. Dave estÃƒÂ¡ cambiando, tanto en su interior, como desde el exterior.","torrent":{"xt":"urn:btih:20734b778548449c9c814a67bb8736f04f48d9bb","amp;dn":"Atrapado.En.Un.Pirado.%5B2008%5D.%5BSpanish%5D.%5BDVD-Screener%5D.%5BXvid%5D.%5Bww","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20734b778548449c9c814a67bb8736f04f48d9bb","infoHashBuffer":{"type":"Buffer","data":[32,115,75,119,133,72,68,156,156,129,74,103,187,135,54,240,79,72,217,187]},"announce":[],"urlList":[]}}