{"title":"21 Movie (2008) mkv 5.9Gb","uid":8376179,"size":5941481551,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20f85271f47efdac32b9dfb1e186a170cd50e18c&amp;dn=21+Movie+%282008%29+mkv+5.9Gb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BSwan","files":1,"time":1366053112,"description":"Movie: 21  - released 2008\n\nStarring: Kevin Spacey, Laurence Fishburn, Jim Sturgess, Kate Bosworth, Aaron Yoo, Liza Lapira,\n\nStoryline: (Inspired by a true story)\n\nBen Campbell's dream has always been to go to Harvard Medical School. He is well on his way - he's bright and hard working, which he applies to both his school work and his part-time but low paying job at a men's clothier. In his senior year at M.I.T., he has been accepted to Harvard Medical School, but does not have the $300,000 it will take to finance it. He impresses one of his professors, Mickey Rosa, in class with his quick mind and ability to deal with the issue at hand without letting his emotions take over. Based on that, Mickey invites him into his small but secret society of students that have a system of winning at black jack through counting cards. They play in Vegas on a system of codes, rules and alternate identities, and where each person involved has a very specific role. This offer does not initially interest the straight-laced Ben until he is approached by Jill Taylor, another of those in the group and upon who Ben has a crush. He accepts their offer to be one of the big players on the understanding that he will do it only until he has enough to finance his Harvard education. Once Ben gets a taste of the big life, it starts to affect his original plan, including having unforeseen consequences of alienating his closest friends. He is also unaware that a casino security consultant named Cole Williams is on their tail, Williams who is working on his own personal agenda. Ultimately, greed, pride, ego, desperation and revenge all play a role in how involvement in this group affects Ben's life plan.\n\n\nFile Type: mkv \nSize: 5.9 Gb (straight dvd rip created in makemkv)\nBest viewed with VLC player.","torrent":{"xt":"urn:btih:20f85271f47efdac32b9dfb1e186a170cd50e18c","amp;dn":"21+Movie+%282008%29+mkv+5.9Gb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20f85271f47efdac32b9dfb1e186a170cd50e18c","infoHashBuffer":{"type":"Buffer","data":[32,248,82,113,244,126,253,172,50,185,223,177,225,134,161,112,205,80,225,140]},"announce":[],"urlList":[]}}