{"title":"Boardwalk Empire S01E01-E03 (nlsubs) DutchReleaseTeam","uid":6055279,"size":1887748753,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2136c1097a05ae31fe5f9a1b1a1b0fb086b06c9b&amp;dn=Boardwalk+Empire+S01E01-E03+%28nlsubs%29+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"DutchReleaseTeam","files":-1,"time":1292884248,"description":"\n\nformaat :XviD\ngenre: crime/drama\ndutch subs hardcoded\n\nChronicles the life and times of Nucky Thompson, the undisputed ruler of Atlantic City, who was equal parts politician and gangster.\n\nep1:\nEnoch &quot;Nucky&quot; Thompson is ÃƒÂ©ÃƒÂ©n van de vele corrupte, Republikeinse politici die in Atlantic City de touwtjes in handen hebben. De drooglegging maakt zijn intrede en om zichzelf populair te maken stelt Nucky zich met een verzonnen jeugdverhaal aan de plaatselijke vrouwenbeweging voor als een edelmoedige man die de strijd tegen alcohol aangaat. Maar niet veel later trekt hij zich samen met zijn broer Eli, een politiecommandant, en enkele vooraanstaande politici in een nachtclub terug. Daar vloeit de alcohol rijkelijk en besluiten de heren om in de illegale drankhandel te stappen.\n\nep2:\nHet overvallen van Arnold Rothsteins dranktransport kostte het leven aan enkele mannen, maar leverde Jimmy Darmody en Al Capone wel veel geld op. Jimmy koopt met dat geld dure geschenken voor zijn dierbaren. Zo krijgt zijn moeder Gillian een halsketting van grote waarde. Maar wanneer de ontevreden Nucky Thompson een groter deel van de buit wil, wordt Jimmy er toe verplicht om de halsketting te stelen en door te verkopen. Nucky vergokt vervolgens in het bijzijn van Jimmy het geld in een casino\n\nep3 :\nNucky en vooral Jimmy zitten in de problemen wanneer er een overlevende van de overval op Arnold Rothsteins dranktransport opduikt. Nucky geeft zijn broer Eli, hoofd van de politie, de opdracht om het slachtoffer om het leven te brengen. Maar nog voor de corrupte Eli de kans krijgt, duikt FBI-agent Van Alden op. Met een vals aanhoudingsbevel krijgt hij uiteindelijk toegang tot het slachtoffer. Hij probeert de man mee te nemen naar New York, maar zo lang houdt die het niet vol. Bij een tandarts krijgt Van Alden hem dan toch aan het praten. &quot;Jimmy&quot; is de naam die valt.\n\nvertaald door  minouhse @ bierdopje.com\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\n\n\n","torrent":{"xt":"urn:btih:2136c1097a05ae31fe5f9a1b1a1b0fb086b06c9b","amp;dn":"Boardwalk+Empire+S01E01-E03+%28nlsubs%29+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2136c1097a05ae31fe5f9a1b1a1b0fb086b06c9b","infoHashBuffer":{"type":"Buffer","data":[33,54,193,9,122,5,174,49,254,95,154,27,26,27,15,176,134,176,108,155]},"announce":[],"urlList":[]}}