{"title":"Metal Church - This Present Wasteland 320k  mp3  ak2008","uid":10618994,"size":138049250,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:22fc8856a1555fa14d29f0bc32200e0cb937b02f&amp;dn=Metal+Church+-+This+Present+Wasteland+320k++mp3++ak2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"analogkid6103","files":11,"time":1406152324,"description":"Metal Church - This Present Wasteland 320k  mp3  ak2008  What we got ...Metal Church is an American heavy metal band. They originally formed in San Francisco, California in 1980 before relocating to Aberdeen, Washington the following year and briefly using the name Shrapnel. Their eponymous first album was released in 1984, and their latest, Generation Nothing, in 2013.\n\nThe band is credited as a formative influence on the thrash metal sub-genre, melding the aesthetics of the New Wave of British Heavy Metal and American hard rock with &quot;incredibly tight musicianship&quot; and &quot;piercingly screeched&quot; vocals. Early lyrical topics such as conflict and paranoia later expanded into philosophical and social commentary.\n\nFounding guitarist Kurdt Vanderhoof remained the group's sole consistent creative force throughout its career, despite reducing his role strictly to composition in 1986 after tiring of performing. Vanderhoof, vocalist David Wayne, guitarist Craig Wells, bassist Duke Erickson, and drummer Kirk Arrington composed the group's classic lineup featured on its first two records, while vocalist Mike Howe and guitarist John Marshall later contributed to the group's sound. After releasing five full-length albums and touring extensively throughout the 1980s and early 1990s, Metal Church disbanded in 1994. They reformed four years later with their classic lineup, including Vanderhoof's return to performance, yielding the Masterpeace album. They endured numerous lineup changes thereafter, releasing three further studio albums while fronted by Ronny Munroe before again disbanding in July 2009. The group again reunited in October 2012 and issued Generation Nothing a year later.","torrent":{"xt":"urn:btih:22fc8856a1555fa14d29f0bc32200e0cb937b02f","amp;dn":"Metal+Church+-+This+Present+Wasteland+320k++mp3++ak2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22fc8856a1555fa14d29f0bc32200e0cb937b02f","infoHashBuffer":{"type":"Buffer","data":[34,252,136,86,161,85,95,161,77,41,240,188,50,32,14,12,185,55,176,47]},"announce":[],"urlList":[]}}