{"title":"Supported Layered Double Hydroxides as CO2 Adsorbents for Sorpti","uid":15409011,"size":6450508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:242592df7aa8a817293fae0f8938c7a950f6056f&amp;dn=Supported+Layered+Double+Hydroxides+as+CO2+Adsorbents+for+Sorpti&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469539254,"description":"Supported Layered Double Hydroxides as CO2 Adsorbents for Sorption-enhanced H2 Production - D.I. Ferrer (Springer, 2016).pdf\r\n\r\nThis thesis presents a combination of material synthesis and characterization with process modeling. In it, the CO2 adsorption properties of hydrotalcites are enhanced through the production of novel supported hybrids (carbon nanotubes and graphene oxide) and the promotion with alkali metals. Hydrogen is regarded as a sustainable energy carrier, since the end users produce no carbon emissions. However, given that most of the hydrogen produced worldwide comes from fossil fuels, its potential as a carbon-free alternative depends on the ability to capture the carbon dioxide released during manufacture. Sorption-enhanced hydrogen production, in which CO2 is removed as it is formed, can make a major contribution to achieving this. The challenge is to find solid adsorbents with sufficient CO2 capacity that can work in the right temperature window over repeated adsorption-desorption cycles. The book presents a highly detailed characterization of the materials, together with an accurate measurement of their adsorption properties under dry conditions and in the presence of steam. It demonstrates that even small quantities of graphene oxide provide superior thermal stability to hydrotalcites due to their compatible layered structure, making them well suited as volume-efficient adsorbents for CO2. Lastly, it identifies suitable catalysts for the overall sorption-enhanced water gas shift process","torrent":{"xt":"urn:btih:242592df7aa8a817293fae0f8938c7a950f6056f","amp;dn":"Supported+Layered+Double+Hydroxides+as+CO2+Adsorbents+for+Sorpti","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"242592df7aa8a817293fae0f8938c7a950f6056f","infoHashBuffer":{"type":"Buffer","data":[36,37,146,223,122,168,168,23,41,63,174,15,137,56,199,169,80,246,5,111]},"announce":[],"urlList":[]}}