{"title":"The School of Essential Ingredients - Erica Bauermeister","uid":9145716,"size":344635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2875e95f89946cc533d5e053c68ecb74d660899d&amp;dn=The+School+of+Essential+Ingredients+-+Erica+Bauermeister&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1383589981,"description":"Reminiscent of Chocolat and Like Water for Chocolate, a gorgeously written novel about life, love, and the magic of food.\n\nThe School of Essential Ingredients follows the lives of eight students who gather in Lillian's Restaurant every Monday night for cooking class. It soon becomes clear, however, that each one seeks a recipe for something beyond the kitchen. Students include Claire, a young mother struggling with the demands of her family; Antonia, an Italian kitchen designer learning to adapt to life in America; and Tom, a widower mourning the loss of his wife to breast cancer. Chef Lillian, a woman whose connection with food is both soulful and exacting, helps them to create dishes whose flavor and techniques expand beyond the restaurant and into the secret corners of her students' lives. One by one the students are transformed by the aromas, flavors, and textures of Lillian's food, including a white-on-white cake that prompts wistful reflections on the sweet fragility of love and a peppery heirloom tomato sauce that seems to spark one romance but end another. Brought together by the power of food and companionship, the lives of the characters mingle and intertwine, united by the revealing nature of what can be created in the kitchen.","torrent":{"xt":"urn:btih:2875e95f89946cc533d5e053c68ecb74d660899d","amp;dn":"The+School+of+Essential+Ingredients+-+Erica+Bauermeister","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2875e95f89946cc533d5e053c68ecb74d660899d","infoHashBuffer":{"type":"Buffer","data":[40,117,233,95,137,148,108,197,51,213,224,83,198,142,203,116,214,96,137,157]},"announce":[],"urlList":[]}}