{"title":"Children Are Diamonds - Edward Hoagland.epub","uid":9341811,"size":540625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29f977eb643b6810bab3e3276f90bf875b3c05e4&amp;dn=Children+Are+Diamonds+-+Edward+Hoagland.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386951856,"description":"This is not the Africa of Isak Dinesen, nor the Africa of Joy Adamson. This is the Africa of civil wars and tribal massacres, where the Lord s Resistance Army recruits child-soldiers after forcing them to kill their parents and eat their hearts. The aid workers who voluntarily subject themselves to life here are a breed of their own.Meet Hickey, an American school teacher in his late thirties, an American school teacher who burns his bridges with the school board and goes to Africa as an aid worker. Working for an agency in Nairobi, one of his jobs is to drive food and medical supplies to Southern Sudan to an aid station run by Ruth, a middle-aged woman, who acts as nurse, doctor, hospice worker, feeder of starving children, and witness. Ruth is gruff but efficient, and Hickey, who is usually drawn to youth and beauty, is struck by her devotion. Returning to Nairobi, he can t forget what he has seen.\n\nWhen the violence and chaos in the region increase to a fever pitch and aid workers are being slaughtered or evacuated, Hickey is asked to save Ruth overland by Jeep. What happens to them and the children that have joined their journey is the searing climax of this novel. Hoagland paints an unflinching portrait of a living hell at its worst, and yet amid that suffering there is hope in the form of humility, sacrifice, and life-affirming friendship.","torrent":{"xt":"urn:btih:29f977eb643b6810bab3e3276f90bf875b3c05e4","amp;dn":"Children+Are+Diamonds+-+Edward+Hoagland.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29f977eb643b6810bab3e3276f90bf875b3c05e4","infoHashBuffer":{"type":"Buffer","data":[41,249,119,235,100,59,104,16,186,179,227,39,111,144,191,135,91,60,5,228]},"announce":[],"urlList":[]}}