{"title":"Michael Brook with Brian Eno &amp; Daniel Lanois - Hybrid@flac","uid":4754288,"size":203508678,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2a0fe0b1e5c0a016612d3ff0e9b1d0831b918cc2&amp;dn=Michael+Brook+with+Brian+Eno+%26+Daniel+Lanois+-+Hybrid%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alekow1","files":17,"time":1236368011,"description":"\nThe mid-'80s proved to be a prolific and exploratory time for the producer/performer team of Brian Eno and Daniel Lanois, who this time out take guitarist Michael Brook under their ambient wing to create an album of considerable beauty and restraint. Taking a &quot;less is more&quot; approach to the project, Brook adapts quite easily as a group member in co-creating these organic pieces (although composer credits go to him alone), and within a few minutes one forgets that he is a guitar player. Hybrid is not an especially dynamic or exciting album, but its depth is nonetheless rewarding. There is substance within the shadows, and the musicians take the necessary time to properly explore them. Highlights include the title cut, &quot;Hybrid,&quot; which takes on the tone of a sleepy journey through underwater Morocco, plus &quot;Pond Life,&quot; a barely audible meditation that is in its own right the strongest on the disc by simply trusting its atmosphere, assisted in no small part by visiting contributor Gordon Philips. In future recordings, Brook would prove to be a more energetic performer than Hybrid would suggest, but it's nice to have evidence that there is a zen master behind all the kung fu. For Eno and Lanois, it was only a year earlier that they delivered U2's groundbreaking album, The Unforgettable Fire (which is still considered a landmark recording for the band), so the Hybrid project probably seemed like a welcome sigh of relief for them. As for this album in and of itself, it ends up being more respectable because of the people involved, rather than what was recorded. (AMG)\n\n\n1   Hybrid (6:18)  \n2   Distant Village (4:03)  \n3   Mimosa (6:20) \n4   Pond Life (3:40) \n5   Ocean Motion (5:50) \n6   Midday (5:59) \n7   Earth Floor (4:45) \n8   Vacant (5:00)\n\n\nLabel: Editions EG\nReleased: 1985\n\n\nCodec: Flac\nCompression Level: 3\nQuality: High\n\n\nMy cd-rip (EAC and Flac)\nCovers Included\n\n\n\n\n\nEnjoy, Seed and Share\n\n","torrent":{"xt":"urn:btih:2a0fe0b1e5c0a016612d3ff0e9b1d0831b918cc2","amp;dn":"Michael+Brook+with+Brian+Eno+%26+Daniel+Lanois+-+Hybrid%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a0fe0b1e5c0a016612d3ff0e9b1d0831b918cc2","infoHashBuffer":{"type":"Buffer","data":[42,15,224,177,229,192,160,22,97,45,63,240,233,177,208,131,27,145,140,194]},"announce":[],"urlList":[]}}