{"title":"Shark and the Goldfish: Positive Ways to Thrive During  Change","uid":8500343,"size":3178515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2aa24b18e9114346dfe5723a92b12ae1df113f21&amp;dn=Shark+and+the+Goldfish%3A+Positive+Ways+to+Thrive+During++Change&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1369279963,"description":"Jon Gordon - The Shark and the Goldfish: Positive Ways to Thrive During Waves of Change\nPublished: 2009-09-22 | ISBN: 0470503602 | PDF | 112 pages | 3 MB\n\n\nAn illustrated business fable that gives you the faith, courage and confidence to win in today's tough economic climate\nFear and uncertainty are staples of daily life in today's struggling economy. As bad as things can be, economic downturns also lead to new opportunities. It's easy to worry, give up and let fear paralyze you. However, you have more control than you think you do and how you handle adversity is your choice-and the only choice that matters. In fact, study history and you'll find that a lot of people and organizations made a name for themselves and grew their businesses during recessions and downturns. These successful people and organizations all shared similar characteristics and took similar actions to thrive while others merely tried to survive. You can do the same.\nIn The Shark and the Goldfish, Jon Gordon shares an inspiring fable about Gordy, a pampered goldfish who gets swept out to sea. Desperate for food, Gordy meets a kind shark who teaches him the ultimate lesson-Goldfish wait to be fed. Sharks go find food. Gordy also learns that the difference between a full and empty stomach is our faith, beliefs and actions. In the face of adversity and lean times, this is a business fable that reinforces a proven truth: You can't control the events in your life. But you can control how you respond and in turn this determines the outcome.\nA business fable that teaches valuable lessons on the importance of working hard, maintaining a locus of control and focusing on positive choices instead of negative voices,\nWritten by Jon Gordon, bestselling author of The Energy Bus and The No Complaining Rule\nReveals how change is inevitable-but that you can make it your friend or foe.\nProvides an action plan filled with tips and strategies to thrive during change and adversity\nIf you're facing tough economic times, The Shark and the Goldfish will motivate you, inspire you, and give you the confidence you need to thrive during changing times.","torrent":{"xt":"urn:btih:2aa24b18e9114346dfe5723a92b12ae1df113f21","amp;dn":"Shark+and+the+Goldfish%3A+Positive+Ways+to+Thrive+During++Change","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aa24b18e9114346dfe5723a92b12ae1df113f21","infoHashBuffer":{"type":"Buffer","data":[42,162,75,24,233,17,67,70,223,229,114,58,146,177,42,225,223,17,63,33]},"announce":[],"urlList":[]}}