{"title":"De gelukkige huisvrouw (audioboek)(Dorien) 2Lions-Team","uid":5786990,"size":478757283,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2b6062e9e751e881a905bd0ce491120910033e71&amp;dn=De+gelukkige+huisvrouw+%28audioboek%29%28Dorien%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dorien69","files":-1,"time":1282681408,"description":"\n\n\nDe gelukkige huisvrouw audioboek\n\n\nBeschrijving\n\n\nMaak kennis met Lea Meyer-Cornelissen, een 31-jarige 'kakmadam' uit Aerdenhout, die emancipatie een vies woord vindt en wier echtgenoot Harry in het vastgoed zit ('wat dat is weet ik niet, maar het geld komt met scheppen binnen'). Op een kwade dag besluit Harry dat hij een kind wil. Lea stemt toe, nadat ze zijn overeengekomen dat hij haar elke avond zal nemen. Lea's lesbische vroedvrouw Machteld heeft de aanstaande moeder een thuisbevalling aangepraat, maar de weeÃƒÂ«n zetten niet door en na urenlang modderen moet Lea alsnog naar het ziekenhuis. De baby wordt langs de 'natuurlijke' weg 'gehaald' - via schaar, pomp en tangen.\nDe bepaald niet vlekkeloze geboorte van Harry jr. blijkt het startschot voor een ontroerend en aangrijpend verhaal. Iedereen in Lea's omgeving is in de - roze - wolken, behalve Lea zelf. Ze ontspoort volledig, wordt opgenomen in een kliniek en belandt uiteindelijk op de sofa van jetset-shrink Beau van Kooten. Hij probeert haar ervan te overtuigen dat de tragische dood van haar vader - toen Lea dertien jaar was - de oorzaak is van haar huidige crisis...\nDe gelukkige huisvrouw is het moedige, zowel hilarische als ontroerende verslag van een vrouw die vecht voor zichzelf, om in het reine te komen met haar verleden. Het is een roman over de universele themaÃ‚Â´s geboorte en dood, zwangerschap en moederschap. Heleen van Royen verpakt zware themaÃ‚Â´s in een humoristisch en ironisch cocon: de lezer laat zich welwillend meevoeren in LeaÃ‚Â´s waanzinnige wereld - de wereld van een gelukkige huisvrouw...\nHeleen van Royen (1965) is geboren in Amsterdam. Ze schrijft voor diverse glossyÃ‚Â´s en debuteert met De gelukkige huisvrouw op opvallende wijze in de Nederlandse literatuur. De vertaalrechten werden reeds voor verschijning verkocht aan de gerenommeerde Duitse uitgeverij Rowohlt.\n\n\n\nRecensie(s)\nNBD|Biblion recensie\nDit boek had alles om een bestseller te worden: een goed-ogende auteur (1965, medewerkster aan diverse glossy's) wier man (Ton van Royen) een populair tv-programma maakte, een geoliede publiciteitscampagne, en, last but not least, een onderwerp dat velen aan zal spreken. Lea Meyer-Cornelissen, een 31-jarige makelaarsvrouw in Aerdenhout voor wie emancipatie een vies woord is, heeft alles wat haar hartje begeert. Wanneer haar man Harry het in zijn hoofd haalt dat hij een kind wil, stemt zij toe, op voorwaarde dat hij haar elke avond zal beminnen. Ze raakt dan ook spoedig in verwachting. Er lijkt geen vuiltje aan de lucht, maar de in detail beschreven bevalling (met de tang) wordt een ramp en Lea belandt in een postnatale psychose. In de loop van de psychiatrische behandeling komt ze er achter dat ze de zelfmoord van haar vader niet heeft verwerkt, twintig jaar geleden, een direct gevolg van de echtscheiding van haar ouders. In een vraaggesprek met Vrij Nederland bekende de schrijfster dat de roman deels autobiografisch is. Een vlot relaas met veel dialogen, korte zinnen en een onverbloemd taalgebruik, dat wel eens aan werk van Marijke Howeler doet denken. Pocketeditie; kleine druk.\n\n\n\n\nSpotinformatie \nCategorie   : Geluid \nFormaat     : MP3  &lt;a href=&quot;\nhttp://www.google.nl/search?hl=nl&amp;q=Audioboek+-+Heleen+van+Royen+-+De+gelukkige+huisvrouw&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.nl/search?hl=nl&amp;q=Audioboek+-+Heleen+van+Royen+-+De+gelukkige+huisvrouw&lt;/a&gt; \n\n\n\n\n\n\n*****************************************\n\nBrought to you by Dorien\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op onze site\n &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n\n\n******************************************\nwanna see more check our site\n &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n\n\n\n\n\n\n\nEnjoy \n2Lions-Team\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n********************************************* \n\n","torrent":{"xt":"urn:btih:2b6062e9e751e881a905bd0ce491120910033e71","amp;dn":"De+gelukkige+huisvrouw+%28audioboek%29%28Dorien%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b6062e9e751e881a905bd0ce491120910033e71","infoHashBuffer":{"type":"Buffer","data":[43,96,98,233,231,81,232,129,169,5,189,12,228,145,18,9,16,3,62,113]},"announce":[],"urlList":[]}}