{"title":"MATLAB - A Fundamental Tool for Scientific Computing and Enginee","uid":12206191,"size":58426270,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f3b34ed5fb50df3b2cdb7aeab4910666a20b697&amp;dn=MATLAB+-+A+Fundamental+Tool+for+Scientific+Computing+and+Enginee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":3,"time":1438965070,"description":"MATLAB - A Fundamental Tool for Scientific Computing and Engineering Applications - Vasilios N. Katsikis (InTech, 2012)\n\nVolume 1 :\nThis is the first book in a three-volume series deploying MATLAB-based applications in almost every branch of science. The present textbook contains a collection of 20 high quality articles. In particular, the book consists of two sections, the first one is devoted to MATLAB applications in engineering and the second is devoted to image and signal processing. In what follows, we present a short summary focusing on the key concepts of each chapter.\n\n\nVolume 2:\nThis excellent book represents the second part of three-volumes regarding MATLAB based applications in almost every branch of science. The present textbook contains a collection of 13 exceptional articles. In particular, the book consists of three sections, the first one is devoted to electronic engineering and computer science, the second is devoted to MATLAB/SIMULINK as a tool for engineering applications, the third one is about Telecommunication and communication systems and the last one discusses MATLAB toolboxes. In what follows, we present a short summary focusing on the key concepts of each chapter.\n\n\nVolume 3:\nThis excellent book represents the final part of three-volumes regarding MATLAB based applications in almost every branch of science. The present textbook contains a collection of 19 high quality articles. In particular, the book consists of three sections, the first one is devoted to mathematical methods in the applied sciences by using MATLAB, the second is devoted to MATLAB applications of general interest and the third one discusses MATLAB for educational purposes. In what follows, we present a short summary focusing on the key concepts of each chapter","torrent":{"xt":"urn:btih:2f3b34ed5fb50df3b2cdb7aeab4910666a20b697","amp;dn":"MATLAB+-+A+Fundamental+Tool+for+Scientific+Computing+and+Enginee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f3b34ed5fb50df3b2cdb7aeab4910666a20b697","infoHashBuffer":{"type":"Buffer","data":[47,59,52,237,95,181,13,243,178,205,183,174,171,73,16,102,106,32,182,151]},"announce":[],"urlList":[]}}