{"title":"The Gay Falcon + A Date With The Falcon {1941 Crime Mystery}","uid":14499189,"size":2941947300,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2fa548930bdacf63f829d68317a126bb7f9dbbb6&amp;dn=The+Gay+Falcon+%2B+A+Date+With+The+Falcon+%7B1941+Crime+Mystery%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nasty_llama","files":3,"time":1462160226,"description":"The Gay Falcon (1941)\r\n\r\nThe Falcon investigates jewel thieves who are working with hard up socialites to defraud insurance companies. First of the Falcon series.\r\n \nhttp://www.imdb.com/title/tt0033650/?ref_=fn_tt_tt_1\r\n \nhttps://en.wikipedia.org/wiki/The_Gay_Falcon\r\n\r\n------------------------------------------------------------\r\nA Date With The Falcon (1942)\r\n\r\nThe story's maguffin is a formula for flawless industrial diamonds pursued by the Falcon and a bevy of villains.\r\n \nhttp://www.imdb.com/title/tt0033517/?ref_=fn_tt_tt_1\r\n \nhttps://en.wikipedia.org/wiki/A_Date_with_the_Falcon\r\n\r\n-------------------------------------------------------------\r\n\r\nGay Stanhope Falcon (later known in film and radio as The Falcon) is a fictional character created in 1940 by Michael Arlen. Falcon made his first appearance in Arlen's short story &quot;Gay Falcon&quot;, which was first published in 1940 in Town &amp; Country magazine. Falcon is characterized as a freelance adventurer and troubleshooter - a man who makes his living &quot;keeping his mouth shut and engaging in dangerous enterprises.&quot;\r\n\r\nFilm appearances\r\n\r\nThe Falcon was quickly brought to the screen by RKO - 1941's The Gay Falcon redefined the character as a suave English gentleman detective with a weakness for beautiful women. The film was intended to establish a suitable replacement character for Leslie Charteris' Simon Templar (aka The Saint, hero of a popular RKO film series). To that end, George Sanders (star of The Saint series) was cast. Though Gay Falcon was the character's name in Arlen's original story, for the film series, the character was renamed Gay Laurence - thus, &quot;The Falcon&quot; became an alias, or nickname (à la &quot;The Saint&quot;). In later outings, in various media, the character had a variety of &quot;real names,&quot; while still being known as The Falcon. Neither in films nor on radio was the nickname ever explained.\r\n\r\nSanders appeared in the first three Falcon films, which followed the Saint pattern so closely that author Charteris sued RKO for plagiarism (Charteris pokes fun at The Falcon in his 1943 novel The Saint Steps In, with a character making a metafictional reference to the Falcon being &quot;a bargain-basement imitation&quot; of The Saint.)[1] Sanders, tired of B leads, bowed out of the series in The Falcon's Brother (1942). The Falcon's brother, Tom, became the new Falcon, and was portrayed by Sanders' actual brother, Tom Conway. After The Falcon's Brother, Conway starred in nine further Falcon films through 1946, almost always with a wisecracking sidekick, portrayed variously by Edward Brophy, Allen Jenkins (who played the same role in the first three Sanders films), Don Barclay, Cliff Edwards and Vince Barnett.\r\n\r\nAn oft-used gimmick in the Falcon series was to tack &quot;teaser&quot; epilogues onto the ends of films. In a teaser, a previously unseen character would approach the Falcon, usually in comic fashion, and signal the title and locale of his next movie. A teaser rarely had anything to do with the plot of the upcoming film, since that film had not yet been produced.\r\n\r\nThe Falcon character was revived for three more films, all made in 1948, starring John Calvert and changing the character's name to &quot;Michael Waring&quot;, but these were unsuccessful. The character went on to appear (as Michael Waring) in radio and television - Charles McGraw portrayed the Falcon in the 39-episode syndicated television series Adventures of the Falcon (1954-55)\r\n \nhttps://en.wikipedia.org/wiki/The_Falcon_%28character%29","torrent":{"xt":"urn:btih:2fa548930bdacf63f829d68317a126bb7f9dbbb6","amp;dn":"The+Gay+Falcon+%2B+A+Date+With+The+Falcon+%7B1941+Crime+Mystery%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fa548930bdacf63f829d68317a126bb7f9dbbb6","infoHashBuffer":{"type":"Buffer","data":[47,165,72,147,11,218,207,99,248,41,214,131,23,161,38,187,127,157,187,182]},"announce":[],"urlList":[]}}