{"title":"Myers &amp; Scanzoni - What God Has Joined Together? (epub, mobi","uid":10280309,"size":3667427,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fcdfa93af9dd03dd09799f5d8b1c8fd31a04e6f&amp;dn=Myers+%26amp%3B+Scanzoni+-+What+God+Has+Joined+Together%3F+%28epub%2C+mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1401687374,"description":"David G. Myers and Letha Dawson Scanzoni - What God Has Joined Together? A Christian Case for Gay Marriage (HarperCollins, 2005). Retail epub &amp; pdf; calibre-converted mobi.\n\ndescription:\n\nGay marriage has become the most important domestic social issue facing twenty-first-century Americans -- particularly Americans of faith. Most Christians are pro-marriage and hold traditional family values, but should they endorse extending marriage rights to gays and lesbians? If Jesus enjoined us to love our neighbors as ourselves, and the homosexual is our neighbor, does that mean we should accept and bless gay marriages? These and other, related questions are tearing many faith-based communities apart.\n\nAcross the country, states have voted, courts have debated, and churches have divided over the legitimacy of same-sex marriage. Amid the uproar one perspective is decidedly missing: that of thoughtful, pro-marriage Christians who, informed by their faith, are struggling to make sense of this issue. What God Has Joined Together? is an effort to bridge the divide between marriage-supporting and gay-supporting people of faith by showing why both sides have important things to say and showing how both sides can coexist. Drawing on scientific research as well as on the Bible, the authors explain that marriage is emotionally, physically, financially, and spiritually beneficial for everyone, not just heterosexuals.\n\nThey debunk myths about sexual orientation, assess claims of sexual reorientation, and explore what the Bible does and does not say about same-sex relationships. The book ends with a persuasive case for gay marriage and outlines how this can be a win-win solution for all.","torrent":{"xt":"urn:btih:2fcdfa93af9dd03dd09799f5d8b1c8fd31a04e6f","amp;dn":"Myers+%26amp%3B+Scanzoni+-+What+God+Has+Joined+Together%3F+%28epub%2C+mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fcdfa93af9dd03dd09799f5d8b1c8fd31a04e6f","infoHashBuffer":{"type":"Buffer","data":[47,205,250,147,175,157,208,61,208,151,153,245,216,177,200,253,49,160,78,111]},"announce":[],"urlList":[]}}