{"title":"Classic Western Roundup-2 - Disk 1 - DVD9 - The Texans (1938) - ","uid":9177967,"size":8168718336,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2fd511053b9d5280d33e7abc61fc7f4a49a8b854&amp;dn=Classic+Western+Roundup-2+-+Disk+1+-+DVD9+-+The+Texans+%281938%29+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"SaM","files":-1,"time":1384186154,"description":"Classic Western Roundup-2 - Disk 1 - DVD9 - The Texans (1938) - California (1946) [DDR]\n\nTHE TEXANS (1938) \nThe Texans is a 1938 film made by Paramount Pictures, directed by James P. Hogan, and starring by Joan Bennett, Randolph Scott and Walter Brennan. \nThe screenplay was written by William Wister Haines, Bertram Millhauser and Paul Sloane and is based on the story North of '36 by Emerson Hough.\n\nMost of the exterior scenes were filmed about 30 miles (48 km) east of Cotulla, Texas on the 35,000-acre (140 km2) La Mota Ranch. Other scenes were filmed near Laredo, Texas. 2500 Texas Longhorns were used for the herd. Interior scenes were recorded at Paramount Studios in Hollywood. The Texans premiered at San Antonio's Majestic Theater on July 16, 1938. \n\n    CAST:-\n    Joan Bennett as Ivy Preston\n    Randolph Scott as Kirk Jordan\n    May Robson as Granna\n    Walter Brennan as Chuckawalla\n    Robert Cummings as Alan Sanford\n    Robert Barrat as Isaiah Middlebrack\n    Raymond Hatton as Cal Tuttle\n    Francis Ford as Uncle Dud\n    Harvey Stephens as Lt. David Nichols\n    Irving Bacon as Pvt. Collins\n\nDirected by James P. Hogan\nProduced by Lucien Hubbard\nWritten by William Wister Haines, Bertram Millhauser, Paul Sloane\n\nSYNOPSIS:- The Texans (1938)\nAfter the Civil War, a Texas ranch owner (Bennett) is trying to move her cattle to market in Kansas to sell them. A Confederate veteran (Scott) becomes involved with her and learns she wants to use the money to help the South continue fighting. She is harassed on the cattle drive by corrupt Union Army officers and carpetbaggers.\nAfter the Civil War, an ex-Confederate soldier faces new battles, including the elements and a carpetbagger intent on destroying him. \n\nCALIFORNIA (1946)\nCalifornia is a 1947 western film directed by John Farrow and featuring Barbara Stanwyck, Ray Milland, Barry Fitzgerald and George Coulouris.\nEpic account of how California became a state, featuring a wagon train, the Gold Rush, a wicked saloon queen, and an evil profiteer. \n\n    CAST:-\n    Barbara Stanwyck as Lily\n    Ray Milland as Trumbo\n    Barry Fitzgerald as Fabian\n    George Coulouris as Coffin\n    Albert Dekker as Pike\n    Anthony Quinn as Hernandez\n\nSYNOPSIS:- California (1946)\nA deserter who had been an Army lieutenant, Jonathan Trumbo is hired to guide a wagon train bound for California during the gold rush. When a woman named Lily Bishop is accused of cheating at poker in a saloon, farmer Michael Fabian invites her to join the wagon train over Trumbo's strenuous objections. Trumbo, too, accuses of her of cheating at cards after losing to Lily, an insult she promises not to forget. Lily leaves with Booth Pennock, a ruffian who injures Trumbo with a whip before departing. Lily ends up in Pharoah City, running a saloon. The town is controlled by Pharoah Coffin, a former slave trader who opposes the law and order of California approving statehood. Trumbo turns up and gets involved in a saloon brawl. Lily orders him never to set foot there again, but Trumbo wins the place in a poker game. She mistakenly takes Pharoah to be an honest man and moves onto his hacienda. Coffin's men beat up Trumbo, who is rescued on the trail by Mexicans and vows revenge. When his wounds heal, Trumbo returns and becomes a spokesman for statehood advocacy. Coffin's hired men kill Fabian for similar beliefs, causing Lily to finally see Coffin for the crazed villain he is. Trumbo forms a posse and corners Coffin, who is descending into madness. Lily shoots him. Trumbo, in love with Lily, promises to return to the Army to atone for his desertion, hoping someday to return to her.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 5947 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio:1.333:1\nFrames Per Second:29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 3:10:41","torrent":{"xt":"urn:btih:2fd511053b9d5280d33e7abc61fc7f4a49a8b854","amp;dn":"Classic+Western+Roundup-2+-+Disk+1+-+DVD9+-+The+Texans+%281938%29+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fd511053b9d5280d33e7abc61fc7f4a49a8b854","infoHashBuffer":{"type":"Buffer","data":[47,213,17,5,59,157,82,128,211,62,122,188,97,252,127,74,73,168,184,84]},"announce":[],"urlList":[]}}