{"title":"The adventure of Deacon Coombs","uid":10973300,"size":1279359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fecfcde6bcb1d3be115a7834a0fce3db9cc207a&amp;dn=The+adventure+of+Deacon+Coombs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cmjensen1205","files":4,"time":1409817777,"description":"It is 3533, and Earth has bonded with her allies, found peace in new friends, and realized the benefits of space trade and space travel in the form of Vespering, a technique perfected long before man evolved on Earth. Even as goodness seems to reign, however, a powerful malice nurturing a limitless hatred for mankind prepares to carry out his evil mission of conquering all life forms. As the diabolic being puts his plan into action and unleashes his terror on the galaxy, the Tetrad Alliance commissions Earthling detective Deacon Coombs to investigate the alien's origin and its true, murderous ambitions. Coombs travels to faraway star systems, forges unlikely companionships, and uncovers an age-old mystery. In doing so, he embarks on a dangerous journey into space and mind where only evil has ventured before. With the help of his two androids, Gem and Jim, Coombs answers his own doubts about how to defeat the creature in four startling confrontations. In this science fiction adventure, a detective discovers the true meaning of friendships and sacrifice, tragedies and triumph, and bonds and betrayal-as the future of mankind awaits its destiny.","torrent":{"xt":"urn:btih:2fecfcde6bcb1d3be115a7834a0fce3db9cc207a","amp;dn":"The+adventure+of+Deacon+Coombs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fecfcde6bcb1d3be115a7834a0fce3db9cc207a","infoHashBuffer":{"type":"Buffer","data":[47,236,252,222,107,203,29,59,225,21,167,131,74,15,206,61,185,204,32,122]},"announce":[],"urlList":[]}}