{"title":"Zombie Creeping Flesh - (1980) DVDRip","uid":5631350,"size":837377780,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:307cd646c84888f31be1e538e1c78fde86d506a1&amp;dn=Zombie+Creeping+Flesh+-+%281980%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Horrorspoke","files":1,"time":1276694573,"description":"IMDB: http://www.imdb.com/title/tt0082559/\n\nTagline:\n\nWhen the creeping dead devour the living flesh!\n\nSynopsis:\n\nAfter a chemical leak at the Hope Centre in Papua New Guinea (an organisation devoted to feeding underdeveloped countries) turns its staff into flesh-eating zombies, a four-man commando squad led by Mike London are sent to investigate. They run into a TV news crew led by celebrity reporter Lea, who are after the same story, but when they discover that the entire country has been overrun by zombies, what are the chances of them getting the message across? Unlike most zombie films, this actually tries to make a serious point - that if we don't feed the Third World, they'll come and feed on us!\n\nIMDB Review:\n\nI'm getting rather sick of seeing uncomplimentary reviews of this truly classic gorefest. Yes it does contain poor acting, yes it is a cheap rip off of some of the genres other classic titles, yes it does contain stock footage, yes it is low budget, yes it does contain moments of pointlessness and yes it is pure cheese! I'm unsure what some of the unhappy viewers were expecting when they got this film as it is obviously primarily a zombie film that is fast paced with absolutely loads of blood guts and gore practically all the way through the film. If you want an in depth meaningful life affirming film then look elsewhere. If however you want a highly entertaining fast paced ultra bloody zombie gore film that doesn't let up its relentless assault on the senses until the final reel then wait no longer.\n\n\nSeed People - and enjoy!!!","torrent":{"xt":"urn:btih:307cd646c84888f31be1e538e1c78fde86d506a1","amp;dn":"Zombie+Creeping+Flesh+-+%281980%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"307cd646c84888f31be1e538e1c78fde86d506a1","infoHashBuffer":{"type":"Buffer","data":[48,124,214,70,200,72,136,243,27,225,229,56,225,199,143,222,134,213,6,161]},"announce":[],"urlList":[]}}