{"title":"GirlsWay - Ariana Marie, Samantha Hayes (Hide &amp; Seek)","uid":12910703,"size":1161636354,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:30ee64c3b570a0933ffa34a101a9eb9d6e0c6e35&amp;dn=GirlsWay+-+Ariana+Marie%2C+Samantha+Hayes+%28Hide+%26amp%3B+Seek%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"feeldabyte","files":1,"time":1449296085,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rgW8i \nhttp://imgkiss.com/image/rghav \nhttp://imgkiss.com/image/rgwt9 \nhttp://imgkiss.com/image/rgL38 \nhttp://imgkiss.com/image/rgXcA\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nAriana Marie is moving into a new home. She sits with longtime friend Samantha Hayes reminiscing over great memories from when they were little. One of their favorite games was hide and seek, and since this is a new place, Samantha wants to have some fun and play. Ariana thinks they are too old for this game, but is easily persuaded by Samantha's charm. Samantha runs off, looking for the best place to hide while Ariana counts down. with choices from the bathroom to the backyard, Samantha seeks out refuge under Ariana's bed. Ariana is about to give up but by chance she hears giggling from under the bed and right away she knows Samantha has to be hiding right there under her feet.\r\n\r\nSamantha admits she made the noises to lure Ariana, making her the winner by default, and she wants a prize for her defeat. Ariana is unsure about what Samantha has in mind, but Samantha isn't shy about what she wants, to see Ariana's perfect boobs. Having no say in the matter, Ariana takes off her bra, exposing her soft and supple boobs for her longtime friend. Ariana feels all alone with her boobs exposed, so she wants Samantha to show hers too. Samantha undresses, exposing her perky boobs, and both agree of their attraction to one another. They pinch each other's nipples and with their sexuality increasing. Samantha admits to her lesbian attraction, wanting to explore it's pleasures.\r\n\r\nAriana isn't sure how she feels about the whole situation. They are best friends but Ariana has a boyfriend. Samantha convinces her that they need to learn to explore different parts of their body and if anything, and no one needs to know... It would be just their little lesbian secret. Ariana agrees, laying her naked body out on the bed. Samantha slowly crawls over her to kiss her boobs, making her way down towards Ariana's shaved pussy. Samantha licks and kisses her lips while playing with herself, leading to Ariana's first lesbian orgasm. Ariana lays under Samantha's pussy lips, licking and sucking, promising she will make her cum to make this an experience these two best friends will never forget!\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:30ee64c3b570a0933ffa34a101a9eb9d6e0c6e35","amp;dn":"GirlsWay+-+Ariana+Marie%2C+Samantha+Hayes+%28Hide+%26amp%3B+Seek%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30ee64c3b570a0933ffa34a101a9eb9d6e0c6e35","infoHashBuffer":{"type":"Buffer","data":[48,238,100,195,181,112,160,147,63,250,52,161,1,169,235,157,110,12,110,53]},"announce":[],"urlList":[]}}