{"title":"Bashar - The Timeless Now","uid":7686766,"size":956204280,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3156aac1394fbb9ac48e7e221d746ae85c5abc4c&amp;dn=Bashar+-+The+Timeless+Now&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"awakeperson","files":2,"time":1348970921,"description":"&quot;THE TIMELESS NOW&quot;\nA Bashar Holotope Experience\n\nNew York, NY 9-19-09\n\nThe intensity increases in this second part of the New York event. Bashar begins the session with a guided visualization while viewing &quot;the Holotope&quot;, a new visual technology that activates the spiritual centers of the brain. Following the mediation the room is filled with incredible connecting energy. People are amazed at the transformation they experience in the Timeless Now!\n\nQ&amp;A: Bashar demonstrates a few words of his ancient language. Questioner wants to know more about Bashar's ancient language. Is there any relationship between Bashar's ancient tongue and those of Earth? How can we balance negative energy and positive energy? Discussion of using labels that don't serve, interpreting negative circumstances as having positive effect, and use of permission slips. Questioner asks Bashar to comment on another channeled entity. Discussion of how &quot;going all the way with your fear&quot; can resolve the fear. How can I know when to help people and when not to? Questioner wants to know when he will &quot;get his house in order. Why do some people have an overeating habit? A discussion about shame regarding sexuality. How far away is Bashar's planet? How close are the closest life forms to Earth? How fast does Bashar's spacecraft travel? Do wormholes exist? Has Bashar received any of our radio and television signals? What is the 13th step of Bashar's 13-step program? Questioner is afraid of the dark, has scary dreams, and feels as though people are in her room with her. Being visited by Gray's participating in the hybridization program. Questioner asks for a solution to a health problem, and also wonders if he died as a child and resumed the life.\n\n\n_________________________________________________________________________________\n\nKnowledge is free!\nShare it, seed it, grow it!\n\nMake earth a better place! :)\n","torrent":{"xt":"urn:btih:3156aac1394fbb9ac48e7e221d746ae85c5abc4c","amp;dn":"Bashar+-+The+Timeless+Now","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3156aac1394fbb9ac48e7e221d746ae85c5abc4c","infoHashBuffer":{"type":"Buffer","data":[49,86,170,193,57,79,187,154,196,142,126,34,29,116,106,232,92,90,188,76]},"announce":[],"urlList":[]}}