{"title":"Titan - Exploring an Earthlike World (Malestrom)","uid":4951669,"size":36136637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31af3f26b72c5f52f6be58ed13f657bbab56ff70&amp;dn=Titan+-+Exploring+an+Earthlike+World+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1244916873,"description":" &lt;a href=&quot;http://bayimg.com/CAaNPaaCp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/CAaNPaaCp&lt;/a&gt;\n\nAthena Coustenis, Fredric W. Taylor &quot;Titan: Exploring an Earthlike World&quot;\nWorld Scientific Publishing Company | English | 2008-07-21 | ISBN: 9812705015 | 412 pages | PDF\n\n\nTitan: Exploring an Earthlike World presents the most comprehensive description in book form of what is currently known about Titan, the largest satellite of the planet Saturn and arguably the most intriguing and mysterious world in the Solar System. Because of its resemblance to our own planet, Titan is often described as a frozen primitive Earth and is therefore of wide interest to scientists and educated laypersons from a wide range of backgrounds. The book aims to cater to all of these by using nontechnical language wherever possible, while maintaining a high standard of scientific rigor.\n\nThe book is a fully revised and extensively updated edition of Titan: The Earthlike Moon, which was published in 1999, before the Cassini and Huygens missions arrived to orbit Saturn and land on Titan. As investigators on these missions, the authors use the latest results to present the most recent revelations and latest surprises about an exciting new world.\n\nContents: The Voyager Missions to Titan; Observations of Titan from the Earth; Cassini-Huygens: Orbiting Saturn and Landing on Titan; Titan's Atmosphere and Climate; Chemistry and Composition; Clouds and Hazes; Atmospheric Dynamics and Meteorology; The Surface and Interior of Titan; Titan's Origin and Evolution in the Solar System; Beyond Cassini/Huygens: The Future Exploration of Titan.","torrent":{"xt":"urn:btih:31af3f26b72c5f52f6be58ed13f657bbab56ff70","amp;dn":"Titan+-+Exploring+an+Earthlike+World+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31af3f26b72c5f52f6be58ed13f657bbab56ff70","infoHashBuffer":{"type":"Buffer","data":[49,175,63,38,183,44,95,82,246,190,88,237,19,246,87,187,171,86,255,112]},"announce":[],"urlList":[]}}