{"title":"Looking For Mr Goodbar 1977.avi","uid":4321390,"size":953327616,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:31d4b4715cf7f348706dd27fa1cda6fef0bca75f&amp;dn=Looking+For+Mr+Goodbar+1977.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Malinkaz","files":1,"time":1217497809,"description":"Looking for Mr. Goodbar began as a novel by Judith Rossner. Rossner based the novel on the events surrounding the brutal murder of Roseann Quinn, a 28-year-old New York City schoolteacher in 1973. Looking for Mr. Goodbar is a 1977 film starring Diane Keaton, Tuesday Weld, and Richard Gere, based on that novel.\nThe film, starring Diane Keaton as Dunn, traces the sexual awakening of a young teacher searching for excitement outside of her mundane existence. Originally in search of the &quot;perfect man&quot;, whom she refers to as &quot;Mr. Goodbar&quot;, she begins losing control of her life as her sexual appetite grows. Quiet and reserved teacher by day, sexual deviant and bar-hopper by night, Dunn begins to dabble in drugs and unstable men. Her self-destructive behavior is a means of escaping her numbing existence and testing her boundaries and providing excitement in her otherwise safe and boring life. A true micro meshed image of life in the 70&amp;#039;s. The cast includes a very young Richard Gere. Ultimately, her sexual addiction and high risk behavior put her life in danger.\n\nBeware graphic and sexual content.\n\nPLEASE HELP SEED THIS THIS AMAZING MOVIE.","torrent":{"xt":"urn:btih:31d4b4715cf7f348706dd27fa1cda6fef0bca75f","amp;dn":"Looking+For+Mr+Goodbar+1977.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31d4b4715cf7f348706dd27fa1cda6fef0bca75f","infoHashBuffer":{"type":"Buffer","data":[49,212,180,113,92,247,243,72,112,109,210,127,161,205,166,254,240,188,167,95]},"announce":[],"urlList":[]}}