{"title":"PADRE PADRONE - FRATELLI TAVIANI[TNTVILLAGE]","uid":5204343,"size":1479163002,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:31da1b6cdeaf5092007de79c81a76a0c4afec581&amp;dn=PADRE+PADRONE+-+FRATELLI+TAVIANI%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1260303941,"description":"[b][color=blue]Paolo e Vittorio Taviani\n \nPADRE PADRONE[/color][/b]\n\n[b][color=reD]:::-&gt;LOCANDINA&lt;-:::[/color][/b]\n\n[IMG]http://img39.imageshack.us/img39/3453/padrepadrone.jpg[/IMG]\n\n Padre padrone\n\nRegia: Paolo e Vittorio Taviani.\nAiuto Regia: Marco De Poli.\nAssistenti alla Regia: Giampiero Cubeddu e Francesco Lizzani.\nProduzione: Giuliani G. De Negri per la RAI.\nSoggetto: liberamente tratto dal romanzo omonimo di Gavino Ledda.\nSceneggiatura: Paolo e Vittorio Taviani.\nMontaggio: Roberto Perpignani.\nScenografia: Giovanni Sbarra.\nFotografia: Mario Masini.\nCostumi: Lina Nerli Taviani.\nMusica: Egisto Macchi.\nInterpreti principali: Omero Antonutti, Fabrizio Forte, Stanko Molnar, Saverio Marconi e Marcella Michelangeli.\nCinema S. r. l.; RAI, 1976.\n\nLuogo delle riprese: fu girato in Sardegna. \n\n[/align][align=center]\n\n[b][color=red]:::-&gt;TRAMA&lt;-:::[/color][/b]\n\nIl piccolo Gavino ÃƒÂ¨ costretto dal padre ad abbandonare la scuola per lavorare nell'ovile e a crescere nella solitudine e nell'isolamento della campagna. Cresce senza comunicare con gli altri, e il solo suono della sua fisarmonica gli indica la via della riscoperta del linguaggio. Tornato dal servizio militare, il ragazzo si scontra fisicamente col padre, rifiutandosi di tornare a lavorare nei campi. Scappa dalla Sardegna e, con grande sacrificio, si laurea in glottologia: questa ÃƒÂ¨ la conquista della &quot;parola&quot; e della comunicazione con il mondo. Infine, il ritorno in Sardegna, dove sono le sue radici.\n\n\n[b][color=red]:::-&gt;RECENSIONE&lt;-:::[/color][/b]\n\nIl film che piÃƒÂ¹ di ogni altro ha fatto conoscere la Sardegna interna, ottenendo l'approvazione della critica internazionale e di milioni di spettatori in tutto il mondo, ÃƒÂ¨ il vincitore della Palma d'oro al festival di Cannes del 1978: Padre padrone, girato con pellicola 16 mm. e prodotto in grande economia da Giuliano De Negri per la Rete Due della RAI.\nL'opera cinematografica fu tratta dai fratelli Taviani dal romanzo omonimo autobiografico di Gavino Ledda (1975) che racconta l'esplorazione intima di un ragazzo-pastore che vive nel silenzio e che non ha diritto alla parola, perchÃƒÂ© obbligato dal padre ad una vita di isolamento, cosÃƒÂ¬ come volevano le consuetudini arcaiche della Sardegna interna.\nLa &quot;rivolta&quot; del ragazzo, tesa a superare lo stato di inferioritÃƒÂ  stabilendo un rapporto con gli altri verso la conquista della parola e della cultura, non rappresenta in realtÃƒÂ  tanto la ribellione nei confronti del &quot;padre padrone&quot;, quanto la volontÃƒÂ  si superare la sottomissione linguistica e culturale che investe in prima persona il pastore sardo, cosÃƒÂ¬ come il bracciante siciliano o l'indigeno sudafricano: dunque una &quot;storia universale&quot;, sulla Sardegna e sulle aree sottosviluppate del mondo, sui padri e sui figli della Sardegna e sui padri e sui figli del Terzo Mondo. Dopo aver conosciuto questa storia, Guy Tesseire disse:  \n\nPensavo a quel contadinello siciliano che, all'alba di questo secolo, lavorava venti ore al giorno a New York per sfamare la propria famiglia e per imparare a leggere. Si chiamava Frank Capra, e doveva diventare il maestro della commedia americana.  \n\nIn effetti, lo stesso Gavino Ledda ha rappresentato &quot;un caso&quot; in questo senso: pastore analfabeta a Siligo, dove vive fino all'etÃƒÂ  di venti anni, laureato in lettere all'universitÃƒÂ  di Roma e a trentasette anni autore della prima opera di successo (Premio Viareggio). Come disse Robert Chazal, &quot;pastori della tempra di Gavino Ledda ce ne sono senz'altro pochi&quot;, come, d'altra parte, pochi sono i &quot;film che abbiano la forza di questo dei Taviani&quot;, il cui soggetto non ÃƒÂ¨ un &quot;trucco&quot;, ma tratto da una storia vera, quella dello scrittore sardo, la cui rappresentazione cinematografica risulta cruda, con scene che, in alcuni casi, &quot;sono al limite della sopportabilitÃƒÂ &quot;.\nL'esperienza del piccolo Gavino ÃƒÂ¨ davvero drammatica: per volontÃƒÂ  del padre, che vuole educarlo all'unica cultura che conosce, secondo il metodo &quot;tradizionale&quot; che non consente di abdicare mandando i figli a scuola lontano dalla propria giurisdizione.\nL'educazione &quot;pastorale&quot; di Gavino ha inizio quando il padre lo toglie dai banchi della prima elementare, dopo solo venti giorni di frequenza, pur essendo stato iscritto con tre mesi di ritardo. Si fonda su valori naturali e repressivi, ed una volta compiuta si rivelerÃƒÂ  controproducente: la reazione alla &quot;forgiatura&quot; del padre sarÃƒÂ  uguale e contraria. Abituato ad una esistenza isolata con l'unica compagnia del gregge e ad un uso della lingua sarda limitato ai rapporti familiari, al momento del servizio militare nella Penisola, Gavino realizza infatti la sua drammatica incapacitÃƒÂ  di comunicare e relazionarsi agli altri: in questo preciso momento capisce quanto limitata sia stata la sua esistenza e quanto sia necessaria la cultura per poter comunicare. La rabbiosa rivolta contro il modello di educazione paterno esplode al ritorno in Sardegna con un durissimo scontro, anche fisico, con il vecchio patriarca. La madre, rimasta in ombra fino a questo momento, nel rispetto del ruolo assegnatole nella societÃƒÂ  patriarcale, interviene durante la colluttazione agguantando il marito alla vita per evitare un conflitto che giudica fuori da ogni regola (fatto reale e drammatico, questo, che i Taviani non sviluppano nel film, inventando, secondo Gavino Ledda, &quot;una donna sarda che non ÃƒÂ¨ mai esistita&quot; e che reagisce allo scontro fra padre e figlio semplicemente osservando la rissa e cantando malinconicamente).\nEsauritosi il dramma patriarcale, Gavino decide di andarsene e di cambiare vita:\n \nPerchÃƒÂ¨ rimanere nell'ovile? Per ripetere l'esperienza dei nostri padri? Ubbidire, comandare, ubbidire, comandare [...] poi guardarci come nemici tra di noi, sorvegliandoci l'uno l'altro per non farsi rubare il pascolo o gli animali, ossessionati dall'idea fissa di aumentare la proprietÃƒÂ  perchÃƒÂ¨ questa appare come l'unica possibilitÃƒÂ  di avanzamento sociale.\n \n\nNon senza l'aiuto di alcuni amici e dei fratelli che gli inviano soldi, il Ledda studia all'universitÃƒÂ  di Roma nel periodo della contestazione della fine degli anni '60. Giunge alla conclusione che la scuola ÃƒÂ¨ da cambiare perchÃƒÂ¨ non istruisce e non dÃƒÂ  cultura, non permettendo poi ai giovani di inserirsi nel mercato del lavoro. Ledda ÃƒÂ¨ perÃƒÂ² critico anche nei confronti dei movimenti sovversivi: &quot;hanno torto&quot;, dice, &quot;quelli che mettono le bombe&quot;, perchÃƒÂ¨ l'unica bomba che puÃƒÂ² far saltare la borghesia, per cambiare la societÃƒÂ , ÃƒÂ¨ la conoscenza e la cultura, quindi &quot;la coscienza della propria forza e il suo uso razionale e intelligente&quot;. Quindi, sostiene lo scrittore sardo, per poter &quot;uscire dalla tanca&quot; non ÃƒÂ¨ necessaria la laurea o la semplice erudizione, ma la capacitÃƒÂ  di guardarsi intorno e di capire contro chi, come e per che cosa si deve lottare: non piÃƒÂ¹, quindi, una lotta per avere il gregge piÃƒÂ¹ numeroso o l'ovile piÃƒÂ¹ ricco, ma il tentativo di unire le forze contro il padrone &quot;che ingrassa in cittÃƒÂ  senza mai aver sentito nemmeno che odore manda una pecora&quot;.\nFu proprio nel leggere su un giornale le vicende dell'ex-pastore sardo, che Paolo e Vittorio Taviani decisero il soggetto del loro film; la storia della conquista della parola, la storia di un uomo che cercava gli strumenti per comunicare, li avvinse. Quando i due registi lessero il libro autobiografico di Gavino Ledda, l'ipotesi di film era giÃƒÂ  stata tracciata proprio sulla base di questa informazine giornalistica. Come riscontrarono i Taviani, il libro possedeva una &quot;sua autonomia di linguaggio che escludeva a priori il cinema&quot;; si andÃƒÂ² perciÃƒÂ² verso un duro lavoro di mediazione fra la personalitÃƒÂ  di &quot;intellettuali&quot; e di uomini di cinema dei Taviani &quot;e quella d'un pastore che ha conquistato la cultura e che ÃƒÂ¨ l'autore d'un libro&quot;, riuscendo cosÃƒÂ¬ a portare sullo schermo &quot;gli sforzi che un uomo che appartenga alle classi subalterne deve fare, le sofferenze che deve subire per potersi realizzare&quot;. Nel sottolineare la lotta di Gavino, solo contro il mondo, ed i sacrifici enormi e le sofferenze patite da ragazzo, i Taviani resero la figura del padre crudele e feroce, ma soprattutto &quot;vittima della sua ignoranza e della sua miseria&quot;. Il protagonista ÃƒÂ¨ un &quot;uomo solo che sa sacrificarsi, battersi, vincere&quot;. Il film ÃƒÂ¨ positivo, perchÃƒÂ¨ si assiste ad un &quot;trionfo umano&quot;.\nNel rappresentare il calvario di Gavino e della sua lotta contro il silenzio e l'isolamento, i Taviani hanno fatto dell'elemento sonoro e musicale il motivo portante del film. Tutte le sequenze e le immagini di Padre padrone sono state infatti costruite sulla base di un raporto di unitÃƒÂ  o di scontro con il suono, inteso nella sua piÃƒÂ¹ larga accezione: i rumori e le &quot;voci&quot; della natura o il silenzio, la musica effettivamente sentita dai protagonisti e sovrapposta alle loro emozioni, ed infine la conquista di un codice di comunicazione, sia esso parola parlata o scritta. In tutti i casi, come hanno avuto modo di sottolineare gli stessi Taviani, la conquista del suono e della parola da parte di Gavino ÃƒÂ¨ un evento straordinario e, allo stesso tempo, drammatico, perchÃƒÂ© percorre binari diversi da quelli tracciati dall'educazione corrente. Nella mente di Gavino, i suoni e le parole riacquistano veritÃƒÂ  e trasparenza: il trauma che spezza la sua passivitÃƒÂ  ÃƒÂ¨ il suono di una fisarmonica che, casualmente, attraversa il silenzio dell'ovile dove il pastore vive solo. Il bisogno di comunicare esplode con una violenza molto piÃƒÂ¹ feroce di quella esercitata su di lui per anni dal padre con l'intento di reprimerlo.\nVicende e libro leddiani e film dei Taviani diedero luogo negli anni '70 ad un eccesso di discussioni e di polemiche. Soprattutto in Sardegna, si diffuse l'imbarazzata preoccupazione che le vicende del Ledda potessero essere accreditate come emblematiche della condizione pastorale e sarda tout court. Ad uno spettatore sardo di quegli anni, la Sardegna dei fratelli Taviani appariva infatti troppo arcaica. Le miniere del Sulcis, le ciminiere di Ottana, lo sviluppo dell'industria petrolchimica ed il costituendo Parco naturale del Gennargentu erano soltanto alcuni dei temi d'attualitÃƒÂ  del tempo e che restavano invece completamente fuori dal film: l'unico tema &quot;moderno&quot; toccato era quello dell'emigrazione, che perÃƒÂ² il protagonista del film viveva soltanto in funzione di reazione all'autoritarismo paterno.\nLe polemiche e le riserve che furono espresse non investirono perÃƒÂ² mai l'aspetto della resa cinematografica del racconto e delle tecniche cinematografiche adottate: non ci si chiese se la &quot;simbolizzazione delle cose e delle persone&quot; effettuata dai fratelli Taviani fosse veramente il modo migliore per rappresentare sullo schermo la violenza cruda e fisica che traspare dall'opera del Ledda; se la recitazione fosse adeguata a descrivere questa violenza e la tragicitÃƒÂ  della vicenda; se la fotografia scarna, stemperata, quasi sbiadita, non fosse in contrasto con la vasta gamma di umori, anche cromatici, che nel libro di Ledda segnava passo passo l'influenza del paesaggio sul protagonista.\nLa critica considerÃƒÂ² Padre padrone, piÃƒÂ¹ che un'opera sulla Sardegna, un'opera emblematica delle condizioni del pastore di tutte le zone piÃƒÂ¹ arretrate del Mediterraneo. Il film ebbe un indiscutibile successo, nonostante le titubanti posizioni di alcuni critici della giuria del Festival di Cannes, dove era stato presentato nel 1978. Roberto Rossellini, in qualitÃƒÂ  di presidente della stessa giuria, lo difese strenuamente portandolo alla Palma d'oro.\n\n[b][color=red]:::-&gt;PREMI&lt;-:::[/color]\n[color=teal]\n\n    * Palma d'Oro al Festival di Cannes 1978\n[/color]\n[/b]\n\n\n[color=red][i][b][SIZE=6]SCREENSHOTS[/SIZE][/b][/i][/color]\n\n[IMG]http://img269.imageshack.us/img269/9518/pascreen.jpg[/IMG]\n\n[color=red][i][b][SIZE=6]SCHEDA TECNICA[/SIZE][/b][/i][/color] \n\n[b]AVInaptic Report!\n[/b]========================================\n\n\n\n[ Info sul file ]\n\nNome: Padre Padrone.avi\nData: 5/12/2009 15:08:48\nDimensione: 1,476,341,760 bytes (1407.949 MB)\n\n[ Info generiche ]\n\nDurata: 01:53:12 (6792.058725 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.4.13\nJUNK: VirtualDub build 14328/release\n\n[ Giudizi sulla qualitÃƒÂ  ]\n\nRisoluzione: ALTA (640 x 384)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 32 (BENE)\nQualitÃƒÂ  DRF medio: ALTA (2.877858)\nQualitÃƒÂ  deviazione standard: MEDIA (1.364413)\nMedia pesata dev. std.: MEDIA (1.268798)\n\n[ Traccia video ]\n\nFourCC: divx/DX50\nRisoluzione: 640 x 384\nDisplay aspect ratio: 5:3 = 1.666666\nFramerate: 29.97 fps\nFrames totali: 203558\nBitrate: 1599.286368 kbps\nQf: 0.217134\nMax key int: 300\n\n[ Traccia audio ]\n\nAudio tag: 0x2000 (AC3)\nBitrate: 128 kbps CBR\nCanali: 2\nFrequenza: 48000 Hz\nStream size: 108,673,024 bytes\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b2816p\nPacked bitstream: SÃƒÂ¬\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 203558\nFrames corrotti: 0\n\n[ Analisi DRF ]\n\nDRF medio: 2.877858\nDeviazione standard: 1.364413\nDRF max: 17\n\nRapporto generato da AVInaptic (26-05-2007) in data  7 dic 2009, h 01:00:38\n\n\n[color=red][i][b]NOTE[/b][/i][/color] \n[color=red]\nAudio = Italiano Ac3\nSottotitoli = Inglese[/color]\n\n\nTNTVILLAGE.SCAMBIOETICO.ORG","torrent":{"xt":"urn:btih:31da1b6cdeaf5092007de79c81a76a0c4afec581","amp;dn":"PADRE+PADRONE+-+FRATELLI+TAVIANI%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31da1b6cdeaf5092007de79c81a76a0c4afec581","infoHashBuffer":{"type":"Buffer","data":[49,218,27,108,222,175,80,146,0,125,231,156,129,167,106,12,74,254,197,129]},"announce":[],"urlList":[]}}