{"title":"Superimpose (App)","uid":12211054,"size":15180331,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:3268eb6350c5ba53e8e64ecad593d61840c010b6&amp;dn=Superimpose+%28App%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nono_no_","files":1,"time":1439089127,"description":"Just with a few taps, create professional grade superimposed or juxtaposed photos on your iPhone! You don't need a computers and expensive software to superimpose or cut/copy/paste one photo on top of another any more.\n\nHere is how it works...\n\n1. Load a background image.\n2. Load a foreground image.\n3. Mask out unwanted portion of the foreground image using wide range of masking tools.\n4. Smoothen the edges with smoothen tool inside the app, if required.\n5. Move, Scale, Resize, Rotate, Flip the foreground to place it on the right location on the background image.\n6. Adjust the colors/exposure/contrast/hue/saturation etc. of the foreground and the background images if required to match both the images in terms of colors.\n7. You are done! Save it to the photo library at full resolution or share it onand Twitter.\n\nYou can also use this tool to do serious photo editing tasks like blending textures or overlaying borders or to do double exposure with adjustable transparency and 18 blending modes.\n\nMasking in the app is the most powerful one available on the app store, just tap on an area of the photo, and the app will mask out all the connected area with similar colors. Or you can use brush, lasso, polygon, global color similarity, rectangle, ellipse, linear, bi-linear, radial gradient, mask from image or mask from text masking tools. Mask a portion with this tool and that portion of the foreground image will become transparent and reveal the background.\n\nYou can even drop a shadow of the foreground onto the background. (Only on iPhone 4S and above).\n\nNOTE: The app saves at full camera resolution up to iPhone 5S, all 8 megapixels (even higher on iPad), just you need to enable high resolution save in the settings","torrent":{"xt":"urn:btih:3268eb6350c5ba53e8e64ecad593d61840c010b6","amp;dn":"Superimpose+%28App%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3268eb6350c5ba53e8e64ecad593d61840c010b6","infoHashBuffer":{"type":"Buffer","data":[50,104,235,99,80,197,186,83,232,230,78,202,213,147,214,24,64,192,16,182]},"announce":[],"urlList":[]}}