{"title":"Avatar(2009)DVDRip.AC3(ENG)-DROCK","uid":6076533,"size":1468723200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:33ee23f9311ea73956eb078606aa9ffe0ce0c540&amp;dn=Avatar%282009%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1293892013,"description":"A paraplegic ex-marine finds a new life on the distant planet of Pandora, only to find himself battling humankind alongside the planet's indigenous Na'vi race in this ambitious digital 3D sci-fi epic from Academy Award-winning Titanic director James Cameron. The film, which marks Cameron's first dramatic feature since 1997's Titanic, follows Jake Sully (Sam Worthington), a war veteran who gets called to the depths of space to pick up the job of his slain twin brother for the scientific arm of a megacorporation looking to mine the planet of Pandora for a valued ore. Unfortunately the biggest deposit of the prized substance lies underneath the home of the Na'vi, a ten-foot-tall, blue-skinned native tribe who have been at war with the security arm of the company, lead by Col. Miles Quaritch (Stephen Lang). Because of the planet's hostile atmosphere, humans have genetically grown half-alien/half-human bodies which they can jack their consciousnesses into and explore the world in. Since Jake's brother already had an incredibly expensive Avatar grown for him, he's able to connect with it using the same DNA code and experience first-hand the joys of Pandora while giving the scientific team, led by Grace Augustine (Sigourney Weaver) and Norm Spellman (Joel David Moore), some well-needed protection against the planet's more hostile forces.\n\nOn a chance meeting after getting separated from his team, Jake's Avatar is rescued by Neytiri (Zoe Saldana), a Na'vi princess, who brings him into her tribe in order to give the humans a second chance at relating to this new environment. When word gets out of his increasing time with the alien species, Quaritch enlists Jake to do some reconnaissance for the company, as they'd like to persuade the tribe to move their home before taking more drastic measures to harness the treasure hidden below. Yet as Jake becomes one with the tribe and begins to understand the secrets of Pandora, his conscience is torn between his new adopted world and the wheelchair-bound one awaiting him when the psychic connection to his Avatar is broken. Soon battle lines are drawn and Jake needs to decide which side he will fight on when the time comes. The film was shot on the proprietary FUSION digital 3D cameras developed by Cameron in collaboration with Vince Pace, and offers a groundbreaking mix of live-action dramatic performances and computer-generated effects. The revolutionary motion-capture system created for the film allows the facial expressions of actors to be captured as a virtual camera system enables them to see what their computer-generated counterparts will be seeing in the film, and Peter Jackson's Oscar-winning Weta Digital visual-effects house supervises Avatar's complex special effects.","torrent":{"xt":"urn:btih:33ee23f9311ea73956eb078606aa9ffe0ce0c540","amp;dn":"Avatar%282009%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33ee23f9311ea73956eb078606aa9ffe0ce0c540","infoHashBuffer":{"type":"Buffer","data":[51,238,35,249,49,30,167,57,86,235,7,134,6,170,159,254,12,224,197,64]},"announce":[],"urlList":[]}}