{"title":"Talking About Nothing: Numbers, Hallucinations and Fictions","uid":5956466,"size":1606729,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34595582db33c4d532dce38930172663507c1ba4&amp;dn=Talking+About+Nothing%3A+Numbers%2C+Hallucinations+and+Fictions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1289695082,"description":"Talking About Nothing: Numbers, Hallucinations and Fictions\n\nOrdinary language and scientific language enable us to speak about, in a singular way (using demonstratives and names), what we recognize not to exist: fictions, the contents of our hallucinations, abstract objects, and various idealized but nonexistent objects that our scientific theories are often couched in terms of. Indeed, references to such nonexistent items-especially in the case of the application of mathematics to the sciences-are indispensable. We cannot avoid talking about such things. Scientific and ordinary languages thus enable us to say things about Pegasus or about hallucinated objects that are true (or false), such as &quot;Pegasus was believed by the ancient Greeks to be a flying horse,&quot; or &quot;That elf I'm now hallucinating over there is wearing blue shoes.&quot; Standard contemporary metaphysical views and semantic analyses of singular idioms on offer in contemporary philosophy of language have not successfully accommodated these routine practices of saying true and false things about the nonexistent while simultaneously honoring the insight that such things do not exist in any way at all (and have no properties). That is, philosophers often feel driven to claim that such objects do exist, or they claim that all our talk isn't genuine truth-apt talk, but only pretence. This book reconfigures metaphysics (and the role of metaphysics in semantics) in radical ways that allow the accommodation of our ordinary ways of speaking of what does not exist while retaining the absolutely crucial presupposition that such objects exist in no way at all, have no properties, and so are not the truth-makers for the truths and falsities that are about them. \nAbout the Author\n\nJody Azzouni is Professor of Philosophy, Tufts University, and author of Deflating Existential Consequence and Tracking Reason.\n\nHardcover: 288 pages \nPublisher: Oxford University Press, USA (September 30, 2010) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:34595582db33c4d532dce38930172663507c1ba4","amp;dn":"Talking+About+Nothing%3A+Numbers%2C+Hallucinations+and+Fictions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34595582db33c4d532dce38930172663507c1ba4","infoHashBuffer":{"type":"Buffer","data":[52,89,85,130,219,51,196,213,50,220,227,137,48,23,38,99,80,124,27,164]},"announce":[],"urlList":[]}}