{"title":"Children Without a State A Global Human Rights Challenge.pdf","uid":7601268,"size":1282966,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:355f82e21866d6389d7c8b2a1379db85ffffdefe&amp;dn=Children+Without+a+State+A+Global+Human+Rights+Challenge.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cowboy1966","files":-1,"time":1346831047,"description":"Jacqueline Bhabha, &quot;Children Without a State: A Global Human Rights Challenge&quot;\n\n English | ISBN 10: 0262015277 | 2011 | PDF | 392 pages | 1 MB\n\n Children are among the most vulnerable citizens of the world, with a special need for the protections, rights, and services offered by states. And yet children are particularly at risk from statelessness. Thirty-six percent of all births in the world are not registered, leaving more than forty-eight million children under the age of five with no legal identity and no formal claim on any state. Millions of other children are born stateless or become undocumented as a result of migration. \n\nChildren Without a State is the first book to examine how statelessness affects children throughout the world, examining this largely unexplored problem from a human rights perspective. The book identifies three contemporary manifestations of statelessness: legal statelessness, when people lack any nationality because of the circumstances of their birth or political and legal obstacles; de facto statelessness, when nationals of one country live illegally in another; and effective statelessness, when legal citizens lack the documentation to prove their right to state services.] The human rights repercussions range from dramatic abuses (detention and deportation) to social marginalization (lack of access to education and health care). The book provides a variety of examples, including chapters on Palestinian children in Israel, undocumented young people seeking higher education in the United States, unaccompanied child migrants in Spain, Roma children in Italy, irregular internal child migrants in China, and children in mixed legal/illegal families in the United States.","torrent":{"xt":"urn:btih:355f82e21866d6389d7c8b2a1379db85ffffdefe","amp;dn":"Children+Without+a+State+A+Global+Human+Rights+Challenge.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"355f82e21866d6389d7c8b2a1379db85ffffdefe","infoHashBuffer":{"type":"Buffer","data":[53,95,130,226,24,102,214,56,157,124,139,42,19,121,219,133,255,255,222,254]},"announce":[],"urlList":[]}}