{"title":"The Year of Finding Memory  (A Memoir)  by Judy Fong Bates  (ret","uid":10819950,"size":8724086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35ea0177073a1144b5a6a948e2200785c7ff2425&amp;dn=The+Year+of+Finding+Memory++%28A+Memoir%29++by+Judy+Fong+Bates++%28ret&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408507643,"description":"An elegant and surprising book about a Chinese family's difficult arrival in Canada, and a daughter's search to understand remarkable and terrible truths about her parents' past lives.\n\nGrowing up in her father's hand laundry in small town Ontario, Judy Fong Bates listened to stories of her parents' past lives in China, a place far removed from their every-day life of poverty and misery. But in spite of the allure of these stories, Fong Bates longed to be a Canadian girl. Fifty years later she finally followed her curiosity back to her ancestral home in China for a reunion that spiralled into a series of unanticipated discoveries. Opening with a shock as moving as the one that powers The Glass Castle, The Year of Finding Memory explores a particular, yet universal, world of family secrets, love, loss, courage and shame. This is a memoir of a daughter's emotional journey, and her painful acceptance of conflicting truths. In telling the story of her parents, Fong Bates is telling the story of how she came to know them, of finding memory.","torrent":{"xt":"urn:btih:35ea0177073a1144b5a6a948e2200785c7ff2425","amp;dn":"The+Year+of+Finding+Memory++%28A+Memoir%29++by+Judy+Fong+Bates++%28ret","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35ea0177073a1144b5a6a948e2200785c7ff2425","infoHashBuffer":{"type":"Buffer","data":[53,234,1,119,7,58,17,68,181,166,169,72,226,32,7,133,199,255,36,37]},"announce":[],"urlList":[]}}