{"title":"Too Late The Hero - Statement Of Purpose","uid":7265653,"size":105335408,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3609a0867058964a972ddaf36aeae19e94b3ba69&amp;dn=Too+Late+The+Hero+-+Statement+Of+Purpose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZzCARLOSzZ","files":12,"time":1336876745,"description":"Mp3 \nBit Rate :320\n\n\nBorn in the summer of 98, Too Late The Hero started as a four piece punk rock band with founding members Ian and Peter Irving Ferrer, Jonette Kimi Jakosalem, and Joe Salazar. Humble beginnings were in an east side garage at Joe's house in Village East, Cainta and in Cubao at Albertos Rehearsal Studio. Later on, blood and sweat were sacrificed at D.I.Y. shows, skate competitions, clubs, schools, and house parties. 2005 their debut record independently came to life, recorded at Sound Creations studio engineered by Mr. Shinji Tanaka on the music tracks and Mr. Raimund Marasigan on the vocal tracks. Joe left for the states in 2006. Creesa of Wild Moodswings took the mic. She kept the band alive for almost a year, till Joe came back for more vicious attacks. Just like how glorious epic battles takes place in history, there is always life after death. Old soldiers are replaced by the new. Creesa kept her veins pumping blood for the band and took the rhythm section. Diego Abad disengaged and Bdge from Skimouche took the torch and ignited the band with his marauding punk rock bass lines. 2008 will be the birth of their next record.. Now Too Late the Hero is Miggy(drums),Joe(vox), Pete(guitar), Creesa(guitar),Bdge(bass) and those friends who kept the fire burning...","torrent":{"xt":"urn:btih:3609a0867058964a972ddaf36aeae19e94b3ba69","amp;dn":"Too+Late+The+Hero+-+Statement+Of+Purpose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3609a0867058964a972ddaf36aeae19e94b3ba69","infoHashBuffer":{"type":"Buffer","data":[54,9,160,134,112,88,150,74,151,45,218,243,106,234,225,158,148,179,186,105]},"announce":[],"urlList":[]}}