{"title":"EnigmaT Set Rips { Cuts } - April 26th, 2014","uid":10043762,"size":491926363,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:36b4bea9933706ab9d220a94f156a5e1b0481c14&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+April+26th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":54,"time":1398505592,"description":"16 Bit Lolitas - Friendly Neighbour (ABGT 076 Rip)-enTc\nAbove &amp; Beyond - Walter White (Seneta's Uplifting Remix) (Cut From Nicky Set)-enTc\nAerofoil - Phase 2 Face (Original Mix) (Cut From E&amp;G Set)-enTc\nAlex Ender - To The Sun (Cut From GO Set)-enTc\nAlexander Voloshok - Hello World (Cut From Aurosonic Set)-enTc\nAlexey Nagornov - Inspiration (Cut From Aurosonic Set)-enTc\nArtem Dultsev pres. Aurora 6 Ft Anet - True Time (Laker Dub Mix) (Cut From Angel Ace Set)-enTc\nBailey90 - Into The Sunset (Cut From Aurosonic Set)-enTc\nBailey90 - Into The Sunset (Original Mix) (Cut From Feel Set)-enTc\nBjrrn Olav Edvardsen &amp; Arcteec - Mountains (E&amp;G Remix) (Cut From E&amp;G Set)-enTc\nBlood Groove &amp; Kikis vs. LTN - Both (Mehilove Remix) (ABGT 076 Rip)-enTc\nChris Schweizer - Reflections (Alex Ender Melting Bootleg) (Cut From Feel Set)-enTc\nCiro Visone - Love Unlimited (Original Mix) (Cut From Prada Set)-enTc\nColdplay - Midnight (Tiesto's Experimental Tech House Bootleg) (Cut From Kiholm Set)-enTc\nDamian Wasse - 52RU (Cut From GO Set)-enTc\nDarin Epsilon feat. Ghost Wars - All That Could've Been (Matt Lange Remix) (Cut From Schossow Set)-enTc\nDreamy - When I Think Back (Angel Ace Remix) (Cut From Angel Ace Set)-enTc\nDyro - Sounds Like (Cut From Hardwell Set)-enTc\nEgera - Genuine Smile (Bilal El Aly Remix) (Cut From E&amp;G Set)-enTc\nFarhad Mahdavi &amp; Tiff Lacey - A Thousand Pieces (Original Mix) (Cut From Indayo Set)-enTc\nFreesoup - We Who Have (Deep Mix) (Cut From Ben Lost Set)-enTc\nGalantis - You (Tom Staar Remix) (Cut From Schossow Set)-enTc\nGordon Coutts - Aerodynamic (Bilal El Aly Remix) (Cut From Feel Set)-enTc\nHardwell feat. Matthew Koma - Dare You (Tritonal Remix) (Cut From Hardwell Set)-enTc\nHook N Sling feat. Karin Park - Tokyo By Night (Axwell Remix) (Cut From Hardwell Set)-enTc\nJenaux feat. Jared Lee - Turn Your World Around (Laidback Luke Edit) (Cut From Hardwell Set)-enTc\nJoze - Invisible Dropped (Martin Libsen Remix) (Cut From Above Clouds Set)-enTc\nJus Jack - Stars (Vocal Mix) (Cut From Schossow Set)-enTc\nLegal Divide &amp; Andski - Parallel Universe (Andski Remix) (Cut From Feel Set)-enTc\nLTN vs. Dan &amp; Sam - The 7th Arc  (ABGT 076 Rip)-enTc\nLustral - So Lonely (Liam's 140 Space Bros Mix) (Set Rip)-enTc\nMax Elto - Shadow Of The Sun (Sebjak &amp; Tony Senghore Remix) (Cut From Schossow Set)-enTc\nMichael L. - Crescent (Patrick Kay Remix) (Cut From Prada Set)-enTc\nMike Sanders - Pangea (Andy Elliass Remix) (Cut From Above Clouds Set)-enTc\nN&amp;R Project - Stolen Heart (Alex Blest Remix) (Cut From Above Clouds Set)-enTc\nNigel Good - Something Out There (ABGT 076 Rip)-enTc\nOcean Scent &amp; Andruss - Northern Lights (Original Mix) (Cut From Feel Set)-enTc\nOrbion - Aquamarine (Original Mix) (Cut From Feel Set)-enTc\nPaul Di White &amp; Alex Blest - Nothern Light (Original Mix) (Cut From Indayo Set)-enTc\nRafael Frost - Wildcard (ABGT 076 Rip)-enTc\nShayan Badri - Beyond The Sense Of Life (Dreamy Remix) (Cut From Above Clouds Set)-enTc\nSigma - Nobody To Love (Third party Remix) (Cut From Schossow Set)-enTc\nSoundGate - Time For Changes (Dreamy's Energetic Remix) (Cut From Angel Ace Set)-enTc\nStendahl - Serenity (Cut From Aurosonic Set)-enTc\nStereojackers v Mark Loverush feat. Seri - Come &amp; Go (Kris O'Neil Remix) (Cut From Kiholm Set)-enTc\nSunny Lax - Fiji (ABGT 076 Rip)-enTc\nSunset Heat &amp; Sunstar pres. Devious Minds - Into Her Eyes (Astuni Re-Lift) (Cut From Angel Ace Set)-enTc\nThe Space Brothers - Forever (Set Rip)-enTc\nThomas Newson feat. Angelika Fee - Don't Hold Us (Blinders Remix) (Cut From Schossow Set)-enTc\nTiddey - Entrancer (Cut From Feel Set)-enTc\ntyDi Feat. Anjulie - The Prestige (Cut From Tydi Set)-enTc\nUla - Sadness &amp; Sorrow (Another World Remix) (Set Rip)-enTc\nVicetone - Ensemble (Cut From Hardwell Set)-enTc\nYves Eaux &amp; Nick Fay - Banjara (Cut From Schossow Set)-enTc\n","torrent":{"xt":"urn:btih:36b4bea9933706ab9d220a94f156a5e1b0481c14","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+April+26th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36b4bea9933706ab9d220a94f156a5e1b0481c14","infoHashBuffer":{"type":"Buffer","data":[54,180,190,169,147,55,6,171,157,34,10,148,241,86,165,225,176,72,28,20]},"announce":[],"urlList":[]}}