{"title":"Lynda.com.Apple.Final.Cut.Express.4.Essential.Training - NON-RAR","uid":6804846,"size":2575597568,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:36f4bfc305bbfcc33aae08a3f1ff71931fdb4af9&amp;dn=Lynda.com.Apple.Final.Cut.Express.4.Essential.Training+-+NON-RAR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"psut","files":1,"time":1320823208,"description":"Credit for the original upload goes to F10000 &amp; QUASAR as per below.\n\n\nApple Final Cut Express 4 Essential Training Essential Training\n                                (c) Lynda.com\n\n       Supplier . : QUASAR      Size ..... : 2.39GB\n       Cracker .. : QUASAR      Protection : Condom\n       Packager . : QUASAR      Type ..... : Brain Enhancement\n       Date ..... : 11-26-2008  OS ....... : Win/Mac\n\n\n\nFinal Cut Express 4 Essential Training with: Lonzell Watson\n\nFinal Cut Express 4 has brought professional video editing to the weekend editor. In Final Cut Express 4 Essential Training, Final Cut Pro Certified Professional and digital video specialist Lonzell Watson teaches the fundamentals of this software. He shows how Final Cut Express, along with its included program, LiveType 2, offers the power to create animated graphics, perform detailed color correction for broadcast-safe results, and make audio edits. He also provides detailed instruction on how to get finished videos out to the world through DVD authoring, exporting to the web, and optimizing for iPods and other mobile devices. Exercise files accompany the course.\n\n**********************************************\n\nThis is an un-rar'd version of the one upped by F10000/QUASAR.  I went out and found that damn first rar file that wouldn't download, and none of those links worked on the old torrent page.  On top of that, I UN-F'N-RARRED THE DAMN THING!!!!\n\nFOR THE LOVE OF GOD PEOPLE, STOP RARRING FILES THAT DON'T NEED IT!!!  Which is ALL OF THEM!!!!!\n\nThe rar'd version saved 30MB of data transfer.  That's ALL.  And then you need at least twice the space to un-rar the damn thing!  It's just STUPID.  Ok, rant over.  Please seed this and keep it alive as long as you can, so that people don't have to try to search for that one file that was nearly impossible to find.","torrent":{"xt":"urn:btih:36f4bfc305bbfcc33aae08a3f1ff71931fdb4af9","amp;dn":"Lynda.com.Apple.Final.Cut.Express.4.Essential.Training+-+NON-RAR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36f4bfc305bbfcc33aae08a3f1ff71931fdb4af9","infoHashBuffer":{"type":"Buffer","data":[54,244,191,195,5,187,252,195,58,174,8,163,241,255,113,147,31,219,74,249]},"announce":[],"urlList":[]}}