{"title":"Homesdale (1971) Peter Weir - early cult film","uid":10817906,"size":381517374,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:37e0f6541bfcc08c1db6598000386272a5c7fdb8&amp;dn=Homesdale+%281971%29+Peter+Weir+-+early+cult+film&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tzuhalem","files":1,"time":1408484621,"description":"This 50 minute film is said to be the one which got Peter Weir picked to make Picnic at Hanging Rock. Here is a review from imdb\n\nmore black than comic\n11 January 2000 | by garland-3 (Sydney)\nThis creepy black and white short is one of Weir's earliest films. It's much scarier than Picnic or Last Wave and convinced me that if Weir had continued along this line he'd have given Greenaway , Lynch and von Trier a run for their money. Thankfully he seems to have had a better sense of spiritual self-preservation.\n\nThe style and incidental touches are very much Weir. Some shots of the bushland surrounds of the sinister guesthouse look forward to the landscapes of Picnic. Watch out, too, for the use of the hymn &quot;O God our help in ages past&quot; which is like, and yet very unlike, the use of hymns in Picnic and Mosquito Coast.\n\nSo far as I understand the plot, which is allusive and ambiguous, a motley bunch of guests turn up at &quot;Homesdale Hunting Lodge&quot;, seemingly for a rest cure of some kind. At first we wonder whether the place isn't a psych. hospital. The manager and his assistants (one of whom was played by Weir himself) encourage - or compel? - the guests to play some increasingly dangerous games. There are darkly comic allusions to things such as the Psycho shower scene. We soon realize that each guest has a Past - some are downright traumatised - and that what happens to them at Homesdale is no help. Rather the opposite. Indeed the Manager is an early version of a figure who recurs in Weir films - the would-be Puppetmaster (think Billy Kwan, Allie Fox, Christof in the Truman Show).\n\nThe conclusion is truly shocking. In fact one is left wondering whether the events have taken place on this earth at all; we feel like we have been looking through a window into Hell.\n---------------------------------------------------------------\nAnother youtube reseed in mp4 format. Please seed generously.","torrent":{"xt":"urn:btih:37e0f6541bfcc08c1db6598000386272a5c7fdb8","amp;dn":"Homesdale+%281971%29+Peter+Weir+-+early+cult+film","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e0f6541bfcc08c1db6598000386272a5c7fdb8","infoHashBuffer":{"type":"Buffer","data":[55,224,246,84,27,252,192,140,29,182,89,128,0,56,98,114,165,199,253,184]},"announce":[],"urlList":[]}}