{"title":"(Sailor Moon Hentai) Complete English Sailor Submission Series +","uid":4300404,"size":462149961,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:37e342b0ad50fa44e5710de66da68173c1d7442f&amp;dn=%28Sailor+Moon+Hentai%29+Complete+English+Sailor+Submission+Series+%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Tinuki","files":55,"time":1216242147,"description":"Hi, beginner uploader here (though I&amp;#039;ve seeded and leech before) \n\n\nNot sure if I did this correctly so please comment if something doesn&amp;#039;t work. All I know is I added the announce url to utorrent on the properties view of the torrent but I&amp;#039;m not sure if that&amp;#039;s enough since I got this from some place else.\n\nEdit: When I tried, it kept saying the file has no tracker so I had to remake the torrent without the nyaa treacker\n\nSource: 4chan\n\nOriginal tracker: Nyaa Torrents.Org (No idea what that is since it&amp;#039;s been a while since I browsed 4chan and the first time I&amp;#039;ve browsed their torrent section which just happens to have this post.)\n\n\n***Why did I upload this torrent?***\n\n1. I still think (hope) that Sailor Moon&amp;#039;s a popular series so hopefully I can get some early commentors to guide me on how long I should seed a torrent and if this one&amp;#039;s working or not.\n\n2. I have a slow connection (20+ kB/s) so having someone else seed would really help speed up things. In addition, I don&amp;#039;t really know when it&amp;#039;s time to drop a torrent. Right now, I&amp;#039;m thinking a week if no one downloads this or there&amp;#039;s a decent number of seeders.\n\n3. The Sailor Submission Series (if you browse some of the popular hentai sites, you&amp;#039;ve probably chance upon one of these) while popular and &quot;old&quot; because of the way it&amp;#039;s titled can be hard for someone who doesn&amp;#039;t keep up with the hentai scene to follow because of it&amp;#039;s format.\n\nIn more details this means that unlike most doujins and mangas which are multipart, the author designed each early parts to showcase one Sailor Moon character so normally you&amp;#039;ll see Sailor Submission Jupiter and then Sailor Submission Mercury but not really know which series comes first and while not epic, each series is more plot related than filler related though this is still your generic hentai plot unless you read everything in order which is why I feel it&amp;#039;s important to share this collection with hentai seekers who are looking for some plot in their hentai although this definitely didn&amp;#039;t wow me but I felt it was good enough for some. I tried searching for a public torrent of this in a torrent search engine but only an incomplete collection came up with 1 seed and 1 leeacher so &quot;good enough&quot; + &quot;collection&quot; edged out &quot;old&quot; &quot;not so special&quot; and &quot;generic plot&quot; in this case.\n\nSearch keywords used: &quot;Sailor Moon&quot;, &quot;Submission Sailor Stars&quot;, &quot;Black Dog&quot;\n\n***Review of This Torrent&amp;#039;s Contents***\n\nAs far as the english versions, the organization of the folders was fantastic. Like I said, the Submission series is horrible to follow unless you really try hard enough to find them and the plot as separate ones do not motivate me enough so I&amp;#039;m not sure it can match up to other people&amp;#039;s standards.\n\nBy combining all, it&amp;#039;s really a plain hentai series until the last moment but what makes it extra special is that there&amp;#039;s some bonus chibi comics near the end each time and when combined, you kind of get a behind the scenes look on what the author was thinking in each comics which while nothing special I do think there are certain people like me who would feel that extra bonus can be the main reason for even downloading a sucky comic so I&amp;#039;m mentioning it here.\n\nIn fact, that&amp;#039;s pretty much what kept me going through the series. In the near end, it actually starts like it had something special going for it.\n\n[Spoilers: Sailor Moon gets captured]\n\nIt might not be a shocking event in the realm of plot lines but the rape scene was really emphatically done in my opinion for a Sailor Moon series. At least I think so if you read it in order and only have a background of the Sailor Moon series in the Anime version. (I haven&amp;#039;t read the manga but I once heard that it was better)\n\nThe ending is rushed though which was a disappointment but as a bonus, there&amp;#039;s also a bad ending.\n\nSome things that might turn you off:\n\n=Blond Handsome Bisho Guy Demon Teacher Plot (It&amp;#039;s supposed to be a character that appeared later in the series I think but I don&amp;#039;t know who he is.) I&amp;#039;m not a fan of this scene because I tend to prefer a slightly better told blackmail plot and am biased towards that. Plus the guy has Mary Sue qualities.\n\n=Sailor Saturn/Tuxedo Kamen pairing - Just not a fan of uber-powerful Sailor Saturn\n\n=Only brief cameo from Uranus (big fan!), Neptune, Pluto and Chibi-usa\n\n=This is humor + drama so at many points in the plot, it can feel even more jarring than watching through an episode of Sailor Moon because it can feel like extended plots of the series and then instead of monsters losing like a generic sentai series, replaced it with rape.\n\n=The plot jumps from spot to spot so don&amp;#039;t expect a linear timeline.\n\nPersonally, if I haven&amp;#039;t chance upon one of the Submission series translated I wouldn&amp;#039;t bother with it but having read the whole series, I&amp;#039;m sort of glad I read it as despite not being up to par with what I want, there&amp;#039;s enough background told to kind of get the sense of where the author stood when he was drawing the series and what he felt about it.\n\nThis is important to know because if you are not into this, the only file worth downloading is Atom Heart Father.\n\nIt revolves on Saturn but it&amp;#039;s to me the one that feels the most complete. It&amp;#039;s also separate from the Submission Stars series so it works as a one-shot and the plot while ending humorously does not feel too long or too short at times so I really feel that not only was it the best file in this torrent, it was the one that was leagues ahead of everything else and probably the one I would bother with downloading if I wasn&amp;#039;t curious about the Submission series.\n\n\nUnfortunately, it might also be probably something you&amp;#039;ve chanced upon if you searched for Sailor Moon hentai before. It&amp;#039;s just extra special because at least here, the quality is made extra special because of the context it has in relation to the rest of Black Dog&amp;#039;s works. (at least based on this collection as I don&amp;#039;t know who the guy is, I read the name from the original torrent title and 4chan commentor/uploader)","torrent":{"xt":"urn:btih:37e342b0ad50fa44e5710de66da68173c1d7442f","amp;dn":"%28Sailor+Moon+Hentai%29+Complete+English+Sailor+Submission+Series+%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e342b0ad50fa44e5710de66da68173c1d7442f","infoHashBuffer":{"type":"Buffer","data":[55,227,66,176,173,80,250,68,229,113,13,230,109,166,129,115,193,215,68,47]},"announce":[],"urlList":[]}}