{"title":"Hearts of Iron III cheat files","uid":5937262,"size":3163402,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:39046bff08d1a2de7342d10ae6ee08cefd584970&amp;dn=Hearts+of+Iron+III+cheat+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"americanderp","files":164,"time":1289017643,"description":"This is just what you need in order to make the cheat functions work from most websites. The event codes they list do not work because you have to actually add them to the games coding .. well I did that and now you can download, paste, and replace the normal files so you can pop these in and be good to go.\n\n\nSimply press alt + 2 +1 on the numpad or use the tilde key (~) to open the consul and then type the code in. (funfact, the commands can be easily spammed by pressing the up arrow and then enter, so you don't have to retype a useful event)\n\n\n---------------------------------------------------\n\nIn no order\n\n\nevent 66500\n\n     -20% dissent\n\n\nevent 66501\n\n     +99k of all resources excluding fuel\n\nevent 66502\n\n     +200 manpower\n\nevent 66509\n\n     +500% leadership\n\nevent 9999\n\n     A choice between a ridiculously fast research time or super fast unit training. Both can be active at the same time but you cannot stack the effect and must wait a month for it to go away before repeating it.\n\nevent 96992\n\n     A random event that gives a strategic bomber, an interceptor, and adds some airbase level to a provence in china. It also grants a non aggression pact and gives military access to the soviet union. I think the unit part only works if you own the region. (Chengdu) or something like that.\n__________________________________________________________________\n\nI uploaded this to eliminate any confusion from the fail cheat code sites that copy pasted all the event codes that clearly don't work unless you copy paste the code, this is running from the latest version of Semper Fi although I don't think it makes any difference.\n\nJust copy and replace the files, if you don't want to replace everything then the only files you need for the codes to work is. Be sure to put into the respective folders.\n\n- events/surrender.txt\n- events/politicalevents.txt\n- common/event_modifiers.txt\n\nThe combined size of everything is so insignificant and this is my first torrent so it doesn't matter about the rest of the stuff.\n\nHave fun, and once your research gets from 1980+ and on the game gets buggy and may freeze so it is a good idea to go ahead and stop the AI from crashing your game.","torrent":{"xt":"urn:btih:39046bff08d1a2de7342d10ae6ee08cefd584970","amp;dn":"Hearts+of+Iron+III+cheat+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39046bff08d1a2de7342d10ae6ee08cefd584970","infoHashBuffer":{"type":"Buffer","data":[57,4,107,255,8,209,162,222,115,66,209,10,230,238,8,206,253,88,73,112]},"announce":[],"urlList":[]}}