{"title":"DJ KrisCut 2013 Live Mix","uid":9218163,"size":64762221,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:394962d81fee6e7779c003e9650b6ea44d8b6e36&amp;dn=DJ+KrisCut+2013+Live+Mix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mediterraneanu","files":-1,"time":1384893107,"description":"About\nCurrently a resident DJ at Gallery Nightclub in Las Vegas, NV; traveling DJ.\n&quot;DJing isn't about how you look, it's how you sound&quot;.\n\nBiography\nOnce a singer in a female R&amp;B group that unfortunately met its end, Christine's desire for a career in music was insatiable. She sought out different channels to satisfy her musical curiosity, and through a friend she began studying the art of turntablism in 2002. Thus, DJ KrisCut was born.\n\nFresh out of college with a bachelor's degree in Music Business and armed with the determination and passion to succeed in her newfound musical venture, she relocated to Las Vegas in the summer of 2003. By 2004, she acquired residencies at three major nightclubs on the infamous Las Vegas strip. For the last 5 years, she has maintained her residency at Risque de Paris and continues to guest DJ at many other nightclub venues such as Rum Jungle, Tabu, and Pure Nightclub.\n\nShe has DJed alongside acts such as DJ Jazzy Jeff, Mark Ronson and Funkmaster Flex, and has DJed many celebrity afterparties, including Christina Millian's and L.L. Cool J's. She has also worked for many corporations such as Nike and Puma.\n\nShe also continues to travel across the U.S., headlining in many major cities including Hollywood, San Diego, Seattle, Houston, Chicago and Boston, and internationally into Vancouver. \n\nDJ KrisCut realizes how blessed and lucky she is that she is able to have a career as DJ. &quot;In a male dominated industry, it's been tough. But I don't want to be known as a great female DJ; it would be nice to be known as just a great DJ in general.&quot;\n\n----------------------------------------------------------------\nWebsite","torrent":{"xt":"urn:btih:394962d81fee6e7779c003e9650b6ea44d8b6e36","amp;dn":"DJ+KrisCut+2013+Live+Mix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"394962d81fee6e7779c003e9650b6ea44d8b6e36","infoHashBuffer":{"type":"Buffer","data":[57,73,98,216,31,238,110,119,121,192,3,233,101,11,110,164,77,139,110,54]},"announce":[],"urlList":[]}}