{"title":"Mr. Deeds(2002)DVDRip.AC3(ENG)-DROCK","uid":6570350,"size":732237209,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:39cfd2c49da71dda028303aff15f489794b1ebdd&amp;dn=Mr.+Deeds%282002%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1311949491,"description":"One of Frank Capra's best-loved stories gets a modernized and wildly slapstick reinterpretation in this romantic comedy starring Adam Sandler. When Preston Blake (Harve Presnell), a remarkably wealthy media magnate, dies with neither a wife nor children, the question on the lips of most of his associates is who will inherit the estate. The surprising answer turns out to be Longfellow Deeds (Adam Sandler), a cheerful but half-bright proprietor of a small-town pizzeria, as well as part-time greeting card poet, who was a distant relative of Blake. In order to claim his 40-billion-dollar inheritance, Deeds heads to New York City, where Blake's former associates, Chuck Cedar (Peter Gallagher) and Cecil Anderson (Erick Avari), introduce him to the city while trying to figure out how to get their hands on his new fortune. Meanwhile, Mac McGrath (Jared Harris), the producer of a sleazy tabloid television show, wants to get the inside scoop on Deeds, and comes up with perfect way to get it: he sends beautiful but unscrupulous reporter Babe Bennett (Winona Ryder) to sweep Deeds off his feet while she's wired for sound. Convincing Deeds that she's from a small town just like himself, Bennett quickly wins his heart, but while his affection is sincere, hers is not. He also displays a curious eagerness to defend her good name with his fists which quickly gets him in trouble. Meanwhile, as Deeds becomes the new laughing stock of New York thanks to Bennett's stories, Deeds decides it's time he did something big with his money, while Cedar and Anderson think they've finally found a way to take control of Deeds' holdings. Mr. Deeds also features supporting performances from John Turturro, Steve Buscemi, and Conchata Ferrell. John McEnroe and Rev. Al Sharpton make cameo appearances as themselves..\n\n\nRipped with Handbrake.\n\nLength: 1 Hour 37 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 384\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:39cfd2c49da71dda028303aff15f489794b1ebdd","amp;dn":"Mr.+Deeds%282002%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39cfd2c49da71dda028303aff15f489794b1ebdd","infoHashBuffer":{"type":"Buffer","data":[57,207,210,196,157,167,29,218,2,131,3,175,241,95,72,151,148,177,235,221]},"announce":[],"urlList":[]}}