{"title":"Bashar - Future Milestones","uid":7672690,"size":29141788,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:39ee7be51bbd297d58577ec65df6108f3b408c2d&amp;dn=Bashar+-+Future+Milestones+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"awakeperson","files":2,"time":1348616443,"description":"&quot;FUTURE MILESTONES&quot;\n\n9-29-06 Los Angeles, CA\n\nAt this special &quot;Evening with Bashar&quot;, Bashar explores some of the future milestones that are most probable given the current momentum of our world. He shares information relating to 2007-2050 and some of the exciting aspects of ET contact that we can expect. He shares with us a new geometric tool that we can use to watch the patterns of events as they unfold in our world and to gather new insights into the course of our future.\n\nQ&amp;A: Communicating with deceased loved ones in dream state. Helping others by transforming your life. Expanding the Lemurian connection and how these energies serve us at present. ET societies functioning without governments and how our world can become more self governing. Defining atheism and how the various religious perspectives are all harmonious at another level. Feeling anxiety about the current earth changes and how to cope. Beliefs that produce Venus insufficiency and spider veins. Do beliefs change DNA? Creating synchronistic experiences that open up inter-dimensional doorways. The significance of the triangle shape and what it can represent. Is it possible to collapse the quantum field? How will the planets associated with Bernard Star go through their transformation. The symbolism of the spiral . Harmonic amplification and how healers use the technique to heal others. Bashar's perspective on &quot;Burning Man Festival&quot; as a sociological experiment.\n\n\n\n_________________________________________________________________________________\n\nKnowledge is free!\nShare it, seed it, grow it!\n\nMake earth a better place! :)\n","torrent":{"xt":"urn:btih:39ee7be51bbd297d58577ec65df6108f3b408c2d","amp;dn":"Bashar+-+Future+Milestones+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39ee7be51bbd297d58577ec65df6108f3b408c2d","infoHashBuffer":{"type":"Buffer","data":[57,238,123,229,27,189,41,125,88,87,126,198,93,246,16,143,59,64,140,45]},"announce":[],"urlList":[]}}