{"title":"Hitman Contracts.rar (FULL) - GAVSAV","uid":4919665,"size":867172563,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:39f51dbb36f5ae05f99a011b5058b46543326ed8&amp;dn=Hitman+Contracts.rar+%28FULL%29+-+GAVSAV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gavsav","files":-1,"time":1243603543,"description":"Hitman Contracts:\n\nContracts is a stealth game, developed by IO Interactive. The game is the third game of the Hitman video game series, released April 20, 2004. \n\nStoryline:\n\nThe game begins with a cutscene showing a wounded Agent 47 wandering through a dark hotel corridor and arriving at his room. Upon entering, he collapses and begins to have flashbacks regarding previous assassinations he committed, beginning with the aftermath of killing Dr. Ort-Meyer at the end of the original game. The missions are primarily focused on replays of previous missions in the original game, except played in reverse. The graphics, maps and artificial intelligence have been improved and modified, not to mention the presence of rain or snow in every level and peculiar, unnatural events occurring in some levels. In the game, 47 visits several locations, including Romania, Kamchatka, the United Kingdom, Rotterdam, Budapest, Hong Kong, and finally Paris.\n\nWhile 47 suffers, a doctor sent by the Agency arrives unexpectedly and treats 47, then flees when he discovers GIGN officers surrounding the hotel. At the end of the game, 47 regains consciousness in the hotel room with an expired mission briefing. It is revealed that 47 was hired to kill a US ambassador, Richard Delahunt, and a famous tenor at an opera house in Paris (an event later seen in Hitman: Blood Money), but was also tasked to kill their mutual friend, Inspector Albert Fournier who has sent a team of police to capture 47 after discovering his hideout.\n\n47 discovers the situation he is in and moves on to kill the inspector and escape the area. He then makes his way to the airport, where he boards a plane and escapes the country. His contact, Diana, reaches him on the plane and suggests that his target may have been tipped off.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:39f51dbb36f5ae05f99a011b5058b46543326ed8","amp;dn":"Hitman+Contracts.rar+%28FULL%29+-+GAVSAV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39f51dbb36f5ae05f99a011b5058b46543326ed8","infoHashBuffer":{"type":"Buffer","data":[57,245,29,187,54,245,174,5,249,154,1,27,80,88,180,101,67,50,110,216]},"announce":[],"urlList":[]}}