{"title":"TEN-4 - Kiteboarding","uid":3985527,"size":3110076416,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3c184d2fa0bc0c33be83b9560929b33c06b67ff2&amp;dn=TEN-4+-+Kiteboarding&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"defuser351","files":1,"time":1200783537,"description":"This is ACL Production&amp;#039;s debut kiteboarding video entitled &quot;TEN4.&quot; It features the latest footage from Waddell Creek, Texas, Caribbean, The Big Trip, Cape Hatteras, Texas Ski Ranch, Maui, Oahu and much more. The video is directed, produced and filmed by Elliot Leboe along with the help of other top riders who have travelled around the world with their cameras rolling non-stop. It not only offers a glimpse of the sickest riding, but takes an inside look at the debauchery which takes place behind the scenes. These riders were motivated enough to get off their lazy asses and pick up a video camera and film themselves, their friends and others riding and enjoying the lifestyle which kiteboarding has provided them. It is these riders who live and breathe the sport on a daily basis that are taking an active role in progressing the sport.\n\n\n===================================================================================\n\n\nHello fellow Kiters around the world. Here&amp;#039;s an oldy but a goody, ACL&amp;#039;s first release. Good footage and music. Documents Kiteboardings transition from Old to New school. So sit back, crack a coldie and EN-FUCKEN-JOY. Full DVD slightly compressed with DVD Shrink. ISO. file click and burn!!! And remember Seed till Ya Bleed!!! Later -  Tr@/!$Hk@\n\nP.S Bows R4 Hoes","torrent":{"xt":"urn:btih:3c184d2fa0bc0c33be83b9560929b33c06b67ff2","amp;dn":"TEN-4+-+Kiteboarding","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c184d2fa0bc0c33be83b9560929b33c06b67ff2","infoHashBuffer":{"type":"Buffer","data":[60,24,77,47,160,188,12,51,190,131,185,86,9,41,179,60,6,182,127,242]},"announce":[],"urlList":[]}}