{"title":"Hollywood.Exes.S02E01.HDTV.x264-CRiMSON","uid":8676206,"size":308666880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3cacae4b6a8421cfad395af9ece3a9737a0baa5f&amp;dn=Hollywood.Exes.S02E01.HDTV.x264-CRiMSON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sidravel23","files":-1,"time":1373599834,"description":"Hollywood Exes is a docu-series that delves deep into the lives of a group of women who are separated from some of the most famous men in America. Simply put, these girls are starting over. They all divorced young and got married even younger so now is when they need each other's backs the most. And from raising kids to starting up a new business ... these women are ready to tackle a VERY busy year.\n\nAt a glance, all these girls are at a different phase in their relations with their exes. Some have remained friends while others can't even say their names out loud, but either way, the girls have the support of each other to fall back on. These women aren't exactly new acquaintances either. Some have known each other even before they were married so there is clearly a strong sisterhood within the group dynamic.\n\nMore than anything, this series will prove that through the struggles of a high profile divorce and separation, these women can emerge from the shadows of their ex-;husbands' fame and fortune, and show the world that they're not just a trophy wife with a pretty face. This fabulous group's quest is to establish themselves as independent, successful women and bring relevance, honor and fame to themselves separate from their exes... even if there happens to be some drama along the way. \n\n\n\n\n\n\nCast:\t\n\nAndrea Kelly\nNicole Murphy\nMayte Garcia\nJessica Canseco\nSheree Fletcher\nShamicka Lawrence\n\n\n\n\n\nEpisode 1 Synopsis:\n\nAll is not well in the sisterhood of the HOLLYWOOD EXES. Drea, who has been spending more time back in Chicago, is offended by a comment Jessica recently tweeted, and plans to confront her.\n\n","torrent":{"xt":"urn:btih:3cacae4b6a8421cfad395af9ece3a9737a0baa5f","amp;dn":"Hollywood.Exes.S02E01.HDTV.x264-CRiMSON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cacae4b6a8421cfad395af9ece3a9737a0baa5f","infoHashBuffer":{"type":"Buffer","data":[60,172,174,75,106,132,33,207,173,57,90,249,236,227,169,115,122,11,170,95]},"announce":[],"urlList":[]}}