{"title":"Toppers in Concert 2011 - Dubbel DVD9 - Retail - DVD 2-2 TBS","uid":6844021,"size":7030509737,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3cbb559937bdc50f05c82b16b5cf2fb924df37da&amp;dn=Toppers+in+Concert+2011+-+Dubbel+DVD9+-+Retail+-+DVD+2-2+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Marjanb","files":-1,"time":1322292743,"description":"Toppers in Concert 2011 - Dubbel DVD9 - Retail - DVD 2 / 2 TBS\n\n\nDe langverwachte concertregistratie van Toppers in Concert 2011 ligt op 25 november a.s. in de winkel. Dit laat platenmaatschappij EMI bij monde van Managing Director Erwin Goegebeur weten. In mei van dit jaar gaven de Toppers drie totaal uitverkochte concerten in de Amsterdam ArenA. Ruim 200.000 bezoekers, volledig gekleed in het thema 'The Royal Party for Kings &amp; Queens', vierden samen het grootste meezingfeest van het jaar.\n\nOok dit jaar waren er weer fantastische gasten zoals K3, Leonie Meijer, Los Angeles The Voices, de beste zangeres van Nederland Glennis Grace en Jan Smit. De saamhorigheid van het publiek was van het begin tot het einde voelbaar en de uitzinnige reacties:X-XML: na afloop zorgde ervoor dat editie 2011 toch weer voelt als de beste editie ooit. Mooi en bijzonder was het afscheid van Gordon, die vanaf het begin in 2005 deel uit heeft gemaakt van de Toppers.\n\n'Wij zijn zo trots dat we met Toppers in Concert al 22(!) keer de Amsterdam ArenA hebben weten te vullen. Toppers in Concert is het grootste en meest succesvolle muziekevenement dat Nederland kent en daar zijn wij dan ook ons publiek enorm dankbaar voor. Vanaf 25 november kunt u dus weer genieten van die prachtige avonden in mei. Ervaar nog ÃƒÂ©ÃƒÂ©n keer Toppers in Concert 2011; 'The Royal Party for Kings &amp; Queens'. Zing lekker mee, geniet en we zien jullie graag weer terug in 2012!' aldus de Toppers.\n\nBron: Retail DVD\nGeluid: Dobly Digital 2.0 | Dolby Digital 5.1 | DTS 5.1\nCovers: Bijgesloten\n\nLet op: Dit is DVD 2 van 2 ! \n\nDisc 2:\n1 :Viva Las Elvis medley: A little less conversation - Blue suede shoes - Viva Las Vegas - Topper\t\n2: Andr? Hazes medley: Zondag - Zeg maar niets meer - Mama - Wat is dan liefde - Jij bent alles - 'n Vriend - Toppers\t\n3:Ode aan Jan Smit medley: Als de morgen is gekomen - Als de nacht verdwijnt - Laura - Cupido - Vriendin voor het leven - - Toppers - Jan Smit\t\n4: Mijn laatste lied voor jou - LA the Voices\t\n5 :The Beatles medley: All you need is love - With a little help from my friends - Yesterday - Let it be - Hey Jude - Toppers\t\n6 :Rock medley 2011: (I can't get no) Satisfaction - Two princes - I was made for loving you - Smells like teen spirit - L - Toppers\t\n7: When the rain begins to fall - Toppers\t\n8:Grease medley : You're the one that I want - Greased lightning - Summer nights - Hopelessly devoted - Grease - Toppers - Glennis Grace\t\n9: Afscheid - Glennis Grace\t\n10 :Piano pop medley: Suzanne - Passie - Ik heb je lief - Nooduitgang - Ik wil je - Toppers\t\n11: Music - Toppers\t\n12: Dolly Dots medley: Don't give up - Radio- Hela-di-ladi-lo - (Tell it all about ) boys - Love me just a little bit more - Toppers\t\n13 :Polonaise medley: Het feest kan beginnen - Polonaise Hollandaise- Mien waar is m'n feestneus - Brabantse nachten zijn la - Toppers\t\n14 :Over de top - Toppers\n\nEnjoy the Movie/Music\n\n************************************\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;\n\nEnjoy\n\n\n\n*************************************","torrent":{"xt":"urn:btih:3cbb559937bdc50f05c82b16b5cf2fb924df37da","amp;dn":"Toppers+in+Concert+2011+-+Dubbel+DVD9+-+Retail+-+DVD+2-2+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cbb559937bdc50f05c82b16b5cf2fb924df37da","infoHashBuffer":{"type":"Buffer","data":[60,187,85,153,55,189,197,15,5,200,43,22,181,207,47,185,36,223,55,218]},"announce":[],"urlList":[]}}