{"title":"(PSP-PSX) Oddworld Collection GOREslinger","uid":4775031,"size":1397721769,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3d02a9df103df9e929e9394127deef52e1bed520&amp;dn=%28PSP-PSX%29+Oddworld+Collection+GOREslinger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoreTBP","files":4,"time":1237181302,"description":"Game: Oddworld: Abe's Oddysee, Oddworld: Abe's Exoddus\nRegion: ALL NTSC-U\nYear: 1997, 1998\nProducer: Oddworld Inhabitants\n\nDescription:\n\nOddworld: Abe's Oddysee\nThe time and place is not known to us, but the food factories have found a new type of meat - delicious to all the inhabitants, and no-one knows the recipe. Following your stomach you find yourself in the factory, and make the most frightening and disgusting discovery: Your own race is that secret delicious food. Alas, you are discovered, and the guards are marching towards you. You must escape, but you can't leave your friends to mercy of those eaters. You must rescue as many as you can, and tell the world the truth that lies beyond.Essentially Abe's Odyssee is a platform game, with a darker atmosphere than most titles in the genre. You start without weapons but can use special powers such as chanting and burping to ward off foes.\n\nOddworld: Abe's Exoddus\nAfter saving his pals from certain doom, Abe is visited by three Mudokan spirits, who tell him that the Glukkons have captured more Mudokons, putting them to work in their mines and factories producing SoulStorm Brew. To make matters worse, the Glukkons are not only forcing live Mudokons to labor away in the mines, they're also disturbing the spirits of dead Mudokons. It's once again up to Abe to save his friends, and help the spirits of the dead rest in peace. The sequel to the hit title, Abe's Oddysee.\n\nGOREslinger's Opinion:\nThis game is weird. VERY weird. Thanks to some great &quot;dialog&quot; and the really likable characters this game makes a lasting impression... an odd one. The name really says it all. I loved it and still do to this day. If you can get past the steep difficulty curve then you will really have a great time with this game. If you have not played it yet now is a good time!\n\nEnjoy the game!\n\nGORESlinger\nHELP KEEP THE HOMEBREW SCENE ALIVE!!! SEED!!!\nThank you for all of the comments and positive feedback!","torrent":{"xt":"urn:btih:3d02a9df103df9e929e9394127deef52e1bed520","amp;dn":"%28PSP-PSX%29+Oddworld+Collection+GOREslinger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d02a9df103df9e929e9394127deef52e1bed520","infoHashBuffer":{"type":"Buffer","data":[61,2,169,223,16,61,249,233,41,233,57,65,39,222,239,82,225,190,213,32]},"announce":[],"urlList":[]}}