{"title":"Works Progress Administration - WPA [flac]","uid":7971184,"size":275741924,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d4e742a53f306adee463b0ab492f5af96feffa4&amp;dn=Works+Progress+Administration+-+WPA+%5Bflac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"rambam1776","files":-1,"time":1356849764,"description":"Track List:\n--------\n01. Always Have My Love 4:12\n02. Good As Ever 3:08\n03. Cry For You 4:00\n04. Rise Up 4:05\n05. Paralyzed 2:26\n06. Remember Well 4:55\n07. End This Now 3:08\n08. Already Gone 3:48\n09. I Go To Sleep 3:16\n10. Not Sure 3:07\n11. Wedding Or A Wake 2:24\n12. The Price 4:23\n\nEditorial Reviews\nAll Music Guide - William Ruhlmann\nWorks Progress Administration (inevitably abbreviated as WPA, as it was when it was the name of a New Deal economic stimulus program in the 1930s) is a band of music business veterans that grew out of nights spent at the Los Angeles club Largo, also known as the locus of the Jon Brion/Aimee Mann singer/songwriter contingent. Its principals are Glen Phillips, solo artist and former singer in Toad the Wet Sprocket; Sean Watkins, of the &quot;on-hiatus&quot; bluegrass band Nickel Creek; and busy session fiddler Luke Bulla. These three use the group as a songwriting vehicle, but it is filled out by Watkins' sister, Sara Watkins, also a Nickel Creek alumna; pedal steel guitarist Greg Leisz; keyboard player Benmont Tench from Tom Petty &amp; the Heartbreakers; and the rhythm section from Elvis Costello's Imposters, Davey Faragher and Pete Thomas. Together, they create a familiar-sounding brand of L.A. country-folk-rock with roots in bands like the Flying Burrito Brothers, though they are also occasionally reminiscent of the British band Squeeze. Phillips, Bulla, and Sean Watkins contribute melodic songs with generally downcast lyrics and take turns singing them in tenor voices that owe something to Gram Parsons. Sara Watkins gets a couple of weepy vocal features of her own on a cover of the Kinks' &quot;I Go to Sleep&quot; and a song Tench has been saving in his trunk since the 1980s, &quot;The Price.&quot; The country elements are kept in check until toward the end, when Phillips' &quot;Wedding or Wake&quot; is given a two-step rhythm and a big solo by Leisz. The songwriters are wise to have organized such an accomplished band to play their songs, and no matter what happens from here (these people all have days jobs, after all), Phillips in particular has been given his best showcase since his days with Toad the Wet Sprocket.\n\nRelease Date: 9/15/2009\nLabel: Elite Artist Service\nCatalog Number: 3","torrent":{"xt":"urn:btih:3d4e742a53f306adee463b0ab492f5af96feffa4","amp;dn":"Works+Progress+Administration+-+WPA+%5Bflac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d4e742a53f306adee463b0ab492f5af96feffa4","infoHashBuffer":{"type":"Buffer","data":[61,78,116,42,83,243,6,173,238,70,59,10,180,146,245,175,150,254,255,164]},"announce":[],"urlList":[]}}