{"title":"A Bridge Through Time - Gloria Gay","uid":14513526,"size":286657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e35846ee2309646ee0113891cc25dea40b0d98d&amp;dn=A+Bridge+Through+Time+-+Gloria+Gay&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1462314112,"description":"Trapped in another era, Jane is forced to choose between her very life and the young man of the portrait, for she has fallen in love with the real version of Jestyn Greywick.\r\n\r\nYears ago, at the age of fourteen, Jane Fielder visited England, the birth country of her parents, with her mother. A that time a strange event took place, and one that Jane never forgot. On a tour of a great estate with her mother, Jane became entranced by the portrait of a young man. She noticed that he had a pendant with the gold chain wrapped around his hand. Impulsively, Jane touched the young man’s hand and it felt warm. Now, years later, and devastated by the death of her parents, Jane returns to England as a foreign correspondent. She hopes the change of scene will make the loss of her parents easier to bear, for her health has lately taken a hit. Jane is as anxious to start her new job as she is to see the portrait again, for she wants to find out if she just imagined that the young man’s hand felt warm to her touch. Then when Jane touches the young man’s hand on the portrait again, she is blasted back in time to 1803","torrent":{"xt":"urn:btih:3e35846ee2309646ee0113891cc25dea40b0d98d","amp;dn":"A+Bridge+Through+Time+-+Gloria+Gay","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e35846ee2309646ee0113891cc25dea40b0d98d","infoHashBuffer":{"type":"Buffer","data":[62,53,132,110,226,48,150,70,238,1,19,137,28,194,93,234,64,176,217,141]},"announce":[],"urlList":[]}}