{"title":"The Castles of Edward I in Wales 1277-1307","uid":11829879,"size":28629152,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e61a69981a213e151621661584dce9b3013e8be&amp;dn=The+Castles+of+Edward+I+in+Wales+1277-1307&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1429593565,"description":"In 1277 Edward I gathered a huge army and marched into Wales to subdue the rebel Welsh princes who continued to raid and pillage English controlled areas of Wales, and even England itself. A key part of his strategy of subjugating and colonizing the Welsh was to erect a castle at every point where his army rested, to provide permanent bases for English garrisons and a visual reminder of English power.\n\nThis title takes a detailed look at the design, development and principles of defense of the Edwardian Welsh castles, documenting daily life within their walls and the historical events that took place around them. Looking at key sites such as Cardigan, Aberystwyth and Conwy it highlights the varied castle designs ranging from fortifications based on French models to the defenses inspired by Constantinople, illustrated with eight pages of full colour illustrations and cutaway artwork. Chris Gravett provides a clear explanation of why the castles were there, who lived in them and how they were built - crucial reading for anyone interested in some of the most romantic and militarily effective buildings ever created","torrent":{"xt":"urn:btih:3e61a69981a213e151621661584dce9b3013e8be","amp;dn":"The+Castles+of+Edward+I+in+Wales+1277-1307","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e61a69981a213e151621661584dce9b3013e8be","infoHashBuffer":{"type":"Buffer","data":[62,97,166,153,129,162,19,225,81,98,22,97,88,77,206,155,48,19,232,190]},"announce":[],"urlList":[]}}