{"title":"Woven Hand  - Mosaic (2006) [192]","uid":3648631,"size":65975746,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f4c4693e4897a3d13437645371e7e798cc46f4e&amp;dn=Woven+Hand++-+Mosaic+%282006%29+%5B192%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"epeb","files":13,"time":1175001395,"description":"David Eugene Edwards&amp;#039; solo work as Woven Hand is now well established, given that he&amp;#039;s reached his fourth album under that moniker. It&amp;#039;s easy and accurate enough to say that Mosaic follows in the same general vein of previous efforts ? his lyrical intensity and religious foci remain paramount, while some striking cover art continues the good run on that front. Beginning with the instrumental &quot;Breathing Bull,&quot; wheezing keyboards and textures suggesting Ennio Morricone scoring something after the apocalypse, Mosaic conjures up like haunted, blasted landscapes in a uniquely melancholy and Western way ? Califone, Savage Republic, DeVotchKa and other such acts can serve as general parallels to what&amp;#039;s here ? but even that doesn&amp;#039;t cover the full scope, as the amazing, Eastern European-inspired &quot;Slota Prow&quot; makes grippingly clear. Edwards&amp;#039; voice has slowly but steadily grown richer and calmer with time, but there&amp;#039;s still the same edge of unsettled intensity here that made him so striking from the start. Performances can shift from banjo and drum arrangements that sound like they should be on Peter Gabriel&amp;#039;s Passion to string parts at once cinematically orchestral and full of a rampaging backwoods fire. Drummer Ordy Garrison is his most regular collaborator on the album and his performances, both dramatic and gently textured (consider the careful way he supports the verses on &quot;Elktooth&quot;), definitely are a key to the album&amp;#039;s moody appeal. Perhaps one of his most striking lyrical efforts ever surfaces here ? &quot;Twig,&quot; which draws on a composition from early Christian mystic St. Ambrose. Who knows what he would have thought of Edwards&amp;#039; interpretation, vocals set back in the mix as dark tones and semi-droning chimes echo in the wash? It&amp;#039;s a marvelous combination of past and present. \n","torrent":{"xt":"urn:btih:3f4c4693e4897a3d13437645371e7e798cc46f4e","amp;dn":"Woven+Hand++-+Mosaic+%282006%29+%5B192%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f4c4693e4897a3d13437645371e7e798cc46f4e","infoHashBuffer":{"type":"Buffer","data":[63,76,70,147,228,137,122,61,19,67,118,69,55,30,126,121,140,196,111,78]},"announce":[],"urlList":[]}}