{"title":"De-Lovely - Proper US Retail - DVDRip - Legendas PT-BR","uid":4595058,"size":1020412539,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:41240e9bec26f5e691aee52850430d184952c6b0&amp;dn=De-Lovely+-+Proper+US+Retail+-+DVDRip+-+Legendas+PT-BR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xara_maior","files":2,"time":1229974912,"description":"Audio: English\nSubtitles/Legendas: PortuguÃƒÂªs (srt)\nDuraÃƒÂ§ÃƒÂ£o: 125 min\nBitrate: 960 kbps\nResoluÃƒÂ§ÃƒÂ£o: 640 x 272 (4:3)\nCodecs: XviD/mp3\nIMDB: http://www.imdb.com/title/tt0352277\n\n\nThis biography soars toward the Academy Awards on the backs of its producer, director and actors. Kevin Kline proves you don't have to look like the &quot;Real Person&quot; to bring his spirit to life and Ashley Judd (contrary to some unfair and plain wrong reviews) gives us a strong Linda Porter, a complex and vulnerable Linda Porter who, as is usually the case, finally succumbs to her life choices with an uncommon grace and courage.\n\nThose people in the audience who had no idea about Mr. Porter's sexual preference, oh'd and ah'd in the beginning. Then they learned that all the talent in the world, all the money in the world, all the joyous hedonism of youth in the world - all of it falls in upon itself as age overcomes and destroys the arrogance of youth.\n\nIrwin Winkler has given us an unflinching portrait of an unusually talented man, an unusual life, and a painful end to that life.\n\nMy palms were ice cold and I felt drained as this film concluded - not because it failed as a project, but because it succeeded so well. \n\nDE-LOVELY is not an easy movie but it is a brilliant one. \n\n\n++++++++++++++++++++++++\n\nKelvin Kline nos prova que nÃƒÂ£o ÃƒÂ© preciso ser parecido com o personagem real e Ashley Judd (contrÃƒÂ¡rio a algumas crÃƒÂ­ticas injustas e equivocadas) nos dÃƒÂ¡ uma forte Linda Porter, uma complexa e vulnerÃƒÂ¡vel Linda Porter que, como de costume, finalmente sucumbe ÃƒÂ s escolhas que fez na vida com uma graÃƒÂ§a e coragem incomuns.\n\nAs pessoas no cinema nÃƒÂ£o tÃƒÂªm a menor idÃƒÂ©ia das preferÃƒÂªncias sexuais de Cole Porter. DaÃƒÂ­ aprendem que todo o talento do mundo, todo o dinheiro do mundo, toda a alegria hedonista da juventude do mundo, tudo isso se degenera quando chega a velhice que destrÃƒÂ³i a arrogÃƒÂ¢ncia da juventude.\n\nIrwin Winkler nos deu um forte retrato de um homem de talento incomun, uma vida incomum e um doloroso fim de vida.\n\nMinhas palmas foram geladas e me senti exaurido ao final do filme, nÃƒÂ£o por que falhe como projeto, mas por ser tÃƒÂ£o bem sucedido.\n\nDe-Lovely nÃƒÂ£o ÃƒÂ© um filme fÃƒÂ¡cil, mas ÃƒÂ© brilhante.\n\n","torrent":{"xt":"urn:btih:41240e9bec26f5e691aee52850430d184952c6b0","amp;dn":"De-Lovely+-+Proper+US+Retail+-+DVDRip+-+Legendas+PT-BR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41240e9bec26f5e691aee52850430d184952c6b0","infoHashBuffer":{"type":"Buffer","data":[65,36,14,155,236,38,245,230,145,174,229,40,80,67,13,24,73,82,198,176]},"announce":[],"urlList":[]}}