{"title":"Terence Trent D'Arby - Sign Your Name (2nafish)","uid":5894262,"size":173078532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:417341f2f93c76bb4639395480bed53ae96c6c71&amp;dn=Terence+Trent+D%5C%27Arby+-+Sign+Your+Name+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1287388386,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Sign Your Name&quot; is the name of a famous song written and performed by Terence Trent D'Arby (now known as Sananda Maitreya).\n\nReleased in his 1987 album Introducing the Hardline According to Terence Trent D'Arby, it was an international success, reaching number two on the UK Singles Chart in early 1988 and number four on the US Billboard Hot 100.\n\nThe song has been covered by several other artists, such as Michael Bolton, Marina Lima, Elliott Yamin, The Dead Science, Human Nature, Night Shift, George Michael, The Flying Pickets, Cass &amp; Slide, Peter Andre, Maria Lawson (B-side of &quot;Breaking Me Down&quot;), Kevin Lyttle and Sheryl Crow (on 100 Miles from Memphis).\n\nIntroducing the Hardline According to Terence Trent D'Arby is Terence Trent D'Arby's debut album. It was released in July 1987 on Columbia Records, and became an instant number-one smash in the UK and spending a total of nine weeks (non-consecutively) at the top of the UK Album Chart and eventually being certified 5x Platinum there (for sales of 1.5 million copies). Worldwide, the album sold a million copies within the first three days of going on sale. The album's success was slower in the U.S. It was released there in October 1987, eventually peaking at number four on May 7, 1988 - the same week that the single &quot;Wishing Well&quot; hit number one on the Billboard Hot 100.\n\nOther singles from the album included &quot;If You Let Me Stay&quot;, which was a top ten hit in the UK, and &quot;Sign Your Name&quot;, which reached #4 on the U.S. Billboard Hot 100 and #2 in the UK. A fourth single, &quot;Dance, Little Sister&quot;, reached the UK Top 20 as well.\n\nSananda Francesco Maitreya (born Terence Trent Howard, March 15, 1962), better known by his former stage name Terence Trent D'Arby, is an American singer-songwriter who came to fame with his album Introducing the Hardline According to Terence Trent D'Arby, released in July 1987, which included the singles &quot;Wishing Well&quot; and &quot;Sign Your Name&quot;. The album has sold over 12 million copies.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:417341f2f93c76bb4639395480bed53ae96c6c71","amp;dn":"Terence+Trent+D%5C%27Arby+-+Sign+Your+Name+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"417341f2f93c76bb4639395480bed53ae96c6c71","infoHashBuffer":{"type":"Buffer","data":[65,115,65,242,249,60,118,187,70,57,57,84,128,190,213,58,233,108,108,113]},"announce":[],"urlList":[]}}