{"title":"Democracy Now - 30 jan 2012","uid":6997618,"size":454263886,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:423697645ccb04d9ff530ee630c7e02478d2270f&amp;dn=Democracy+Now+-+30+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1327942723,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 30, 2012\n\n- 400 Occupy Oakland Protesters Arrested\n- National Park Service Threatens to Evict Occupy D.C. Protesters\n- Romney Attacks Gingrich Over House Ethics Record\n- Gingrich Backer Sheldon Adelson Under Federal Investigation\n- Secretary: Ron Paul Personally Proofed Controversial Newsletters\n- Report: Freddie Mac Bet Against American Homeowners\n- U.S. Lobbyists From Mubarak Era End Contract With Military Government\n- Iraq Outraged Over Expanded Use of U.S. Drones\n- Filipino Activists Protest Expanded U.S. Military Presence\n- Five Papuan Independence Activists Face Treason Charges\n- Mumia Abu-Jamal Moved From Solitary to General Population\n\n\nSpecial reports\n\n- The Invisible War: New Film Exposes Rape, Sexual Assault Epidemic in U.S. Military\n\nOn the heels of a new military survey that the number of reported violent sex crimes jumped 30 percent 2011, with active-duty female soldiers ages 18 to 21 accounting for more than half of the of the victims, we speak with Trina McDonald and Kori Cioca, two subjects of &quot;The Invisible War,&quot; a new documentary that examines the epidemic of rape of soldiers within the U.S. military, which won the Audience Award at the 2012 Sundance Film Festival in Park City, Utah. &quot;Not only was I astounded by the numbers, but when I started talking to the women and men who had experienced this, I was just so devastated by their stories,&quot; says the film's Academy Award-nominated director, Kirby Dick. &quot;These are women and men who are very idealistic, they joined the military because they wanted to serve their country, they were incredible soldiers and then, when they were assaulted, they had the courage to come forward - even though many people advised them not to,&quot; Dick says.\n\n\n- Occupy Oakland: Over 400 Arrested As Police Fire Tear Gas, Flash Grenades At Protesters\n\nPolice have arrested more than 400 Occupy Oakland protesters, as well as a number of journalists, in one of the largest mass arrests since the nationwide Occupy protests began last year. When protesters attempted to convert a vacant building into a community center on Saturday, witnesses say police used tear gas, bean bag projectiles and flash grenades. Several hours later, police said some of the protesters broke into City Hall. However, demonstrators claim they found the door to City Hall already ajar. We play a video report from Oakland filed by John Hamilton of KPFA. We get a response from Occupy Oakland member, Maria Lewis, to Oakland City Councilmember Ignacio De La Fuente's accusation that the Occupy Movement is engaging in &quot;domestic terrorism.&quot; &quot;They are more interested in protecting abandoned private property than they are the people. The idea that opening up a social center is terrorism, is very telling of the narrative of the police state,&quot; Lewis says.\n\n\n- National Park Service Threatens to Evict Occupy D.C. Encampments at Two Parks Near White House\n\nThe National Park Service says it will begin enforcing a ban today on Occupy protesters camping overnight in McPherson Square and Freedom Plaza, two parks near the White House where they have been living since October. Members of the Occupy encampment say they will resist eviction. &quot;We're going to do our best to make sure that they're protected from what is effectively a criminalization of poverty and a criminalization of homelessness by choosing to evict the people who have no where else to sleep,&quot; says Justin Jacoby Smith, a member of the Occupy D.C. media team, who joins us live from McPherson Square. [renee checked this quote]\n\n\n- Syrian Activist Speaks From Hiding: The Bloodshed is Continuing Despite International Criticism\n\nStreet battles are raging at the gates of the Syrian capital of Damascus, and activists say at least 62 people were killed nationwide on Sunday. This comes United Nations Secretary-General Ban Ki-Moon has called on the Syrian leadership, particularly President Bashar al-Assad, to end the violence against the demonstrators immediately, and plans to take up a draft resolution this week calling on him to step down and transfer power. &quot;They are just watching the bloodshed in Syria and keep talking and talking without doing anything,&quot; says Razan Zaitouneh, a lawyer and human rights activist, who joins us from Damascus. We also speak with Karam Nachar, a U.S.-based cyber-activist who is working with Syrian protesters via social media platforms.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:423697645ccb04d9ff530ee630c7e02478d2270f","amp;dn":"Democracy+Now+-+30+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"423697645ccb04d9ff530ee630c7e02478d2270f","infoHashBuffer":{"type":"Buffer","data":[66,54,151,100,92,203,4,217,255,83,14,230,48,199,224,36,120,210,39,15]},"announce":[],"urlList":[]}}