{"title":"CADO DALLE NUBI 2009 ITALIAN DVD RIP - by ILE 66 -.avi","uid":5340527,"size":756725760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:432f343c0171f6f2992ebd07e423dae9d47bd125&amp;dn=CADO+DALLE+NUBI+2009+ITALIAN+DVD+RIP+-+by+ILE+66+-.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"arminos66","files":1,"time":1265475004,"description":"Checco Zalone ÃƒÂ¨ un giovane pugliese che sogna di diventare cantante. Lasciato dalla ragazza perchÃƒÂ© insegue sogni irrealizzabili mentre lei vuole sistemarsi, Checco decide di partire da Polignano a Mare e raggiungere Milano, dove forse riuscirÃƒÂ  a sbarcare il lunario. A Milano viene ospitato dal cugino Alfredo (Dino Abbrescia) ma ovviamente fatica ad adattarsi alla mentalitÃƒÂ  milanese. Incontra Marika (Giulia Michelini) ed ÃƒÂ¨ un colpo di fulmine per entrambi, ma il padre di Marika (Ivano Marescotti) ÃƒÂ¨ un leghista convinto, pieno di pregiudizi sui meridionali, figuriamoci poi quando vede Checco! Contemporaneamente comincia a partecipare a diversi provini, fino a quando d'improvviso il suo talento canoro, unito a quello comico, viene riconosciuto: Checco puÃƒÂ² diventare un fenomeno e il discografico che l'aveva inizialmente rifiutato prende a cercarlo per tutta la cittÃƒÂ . Checco sta per coronare il suo sogno, ma riuscirÃƒÂ  ad avere l'amore di Marika o tornerÃƒÂ  al suo paese da vincitore riconquistando l'ex fidanzata?","torrent":{"xt":"urn:btih:432f343c0171f6f2992ebd07e423dae9d47bd125","amp;dn":"CADO+DALLE+NUBI+2009+ITALIAN+DVD+RIP+-+by+ILE+66+-.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"432f343c0171f6f2992ebd07e423dae9d47bd125","infoHashBuffer":{"type":"Buffer","data":[67,47,52,60,1,113,246,242,153,46,189,7,228,35,218,233,212,123,209,37]},"announce":[],"urlList":[]}}