{"title":"Crna macka beli macor","uid":5917559,"size":837274554,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:437195520c8c4ecd7695af4396784b525af7a777&amp;dn=Crna+macka+beli+macor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1288285161,"description":" &lt;a href=&quot;http://akas.imdb.com/title/tt0118843/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://akas.imdb.com/title/tt0118843/&lt;/a&gt;\n\n\n\n\n\nAudio: Serbian(Srpski)\n\n\n\n\nRadnja filma smijestena je na obalu Dunava gdje zivi Ciganin Matko - sitan svercer. Jednoga dana on dolazi na ideju da prosvercuje voz koji prevozi benzin na relaciji Beograd - Turska i tako dobro zaradi. Ali, za ovaj poduhvat mu je potreban finansijer pa Matko odlazi sa svojim sinom Zaretom kod Grge Pitica, ciganskog &quot;Kuma&quot; i starog porodicnog prijatelja. Grga Pitic prihvata prijedlog da finansira poduhvat ali se ispostavlja da Matko nije na visini zadatka jer ga je preduhitrio Dadan, mladi gangster, obozavalac kokaina i tehno muzike. Naivni Matko postaje Dadanov dusnik i predlaze da se Zare, njegov sin, ozeni Dadanovom minijaturnom sestrom Bubamarom. Medjutim, Zare voli drugu, plavu Cigancicu Idu. Dolazi dan vijencanja. Svi se raduju osim Ide i Zareta. Dok se svatovi raduju a Dadan igra, snalazljiva nevijesta Bubamara koristi trenutak nepaznje i bijezi sa sopstvene svadbe. U toku bekstva, ona upoznaje Grgu Velikog i oni se zaljubljuju jedno u drugo. Zare, konacno slobodan, ukrcava se sa Idom u camac i odlazi niz Dunav...\n\nULOGE: Bajram Severdzan, Srdjan Todorovic, Branka Katic, Florijan Ajdini, Jasar Destani, Stojan Sotirov, Zabit Memedov...\n\nNAGRADE I KOMENTARI:\n\n    * NEW YORK TIMES:\n      Kusturicin zestoki talenat se razmahao u filmu &quot;Crna macka, Beli macor&quot;. To je ludo grabljenje kroz Felinijevo carstvo Kusturicine maste.\n    * SREBRNI LAV:\n      Premijera filma odrzana je na filmskom festivalu u Veneciji 1998. godine gde je Emir Kusturica nagradjen Srebrnim lavom za najbolju reziju. Beogradska premijera filma odrzana je 16. oktobra 1998. godine.\n\nFORMAT SLIKE: 4:3 Colour - Pal\nZVUK: Dolby Surround 5.1\nTITLOVI: Srpski, \nDUZINA: 124min.\nIZDAVAC: KOMUNA\t\t","torrent":{"xt":"urn:btih:437195520c8c4ecd7695af4396784b525af7a777","amp;dn":"Crna+macka+beli+macor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"437195520c8c4ecd7695af4396784b525af7a777","infoHashBuffer":{"type":"Buffer","data":[67,113,149,82,12,140,78,205,118,149,175,67,150,120,75,82,90,247,167,119]},"announce":[],"urlList":[]}}