{"title":"Fuel on the Fire - Greg Muttitt","uid":14550127,"size":3036966,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44b401138a7997dd6af97a2caa57aa85d91b24f9&amp;dn=Fuel+on+the+Fire+-+Greg+Muttitt&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1462641704,"description":"The departure of the last U.S. troops from Iraq at the end of 2011 left a broken country and a host of unanswered questions. What was the war really about? Why and how did the occupation drag on for nearly nine years, while most Iraqis, Britons, and Americans desperately wanted it to end? And why did the troops have to leave?\r\n\r\nNow, in a gripping account of the war that dominated U.S. foreign policy over the last decade, investigative journalist Greg Muttitt takes us behind the scenes to answer some of these questions and reveals the heretofore-untold story of the oil politics that played out through the occupation of Iraq. Drawing upon hundreds of unreleased government documents and extensive interviews with senior American, British, and Iraqi officials, Muttitt exposes the plans and preparations that were in place to shape policies in favor of American and British energy interests. We follow him through a labyrinth of clandestine meetings, reneged promises, and abuses of power; we also see how Iraqis struggled for their own say in their future, in spite of their dysfunctional government and rising levels of violence. Through their stories, we begin to see a very different Iraq from the one our politicians have told us about.\r\n\r\nIn light of the Arab revolutions, the war in Libya, and renewed threats against Iran, Fuel on the Fire provides a vital guide to the lessons from Iraq and of the global consequences of America’s persistent oil addiction","torrent":{"xt":"urn:btih:44b401138a7997dd6af97a2caa57aa85d91b24f9","amp;dn":"Fuel+on+the+Fire+-+Greg+Muttitt","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44b401138a7997dd6af97a2caa57aa85d91b24f9","infoHashBuffer":{"type":"Buffer","data":[68,180,1,19,138,121,151,221,106,249,122,44,170,87,170,133,217,27,36,249]},"announce":[],"urlList":[]}}