{"title":"Mr. Conservative: Goldwater on Goldwater (2006)","uid":4865649,"size":1813750400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4724885fe126b55750ced3d92a0ce9cf4b175e32&amp;dn=Mr.+Conservative%3A+Goldwater+on+Goldwater+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Dolbyuiop","files":2,"time":1240501636,"description":"Few political movements can be solely placed on the shoulders of a single person. The modern conservative movement that began in the 1960s and peaked with the election of Ronald Reagan in the 1980s, however, can be attributed to Senator Barry Goldwater. Known by most as &quot;Mr. Conservative,&quot; Goldwater was drafted into running for president against Lyndon B. Johnson in the 1964 election, and he lost by one of the largest margins in history. Mr. Conservative: Goldwater on Goldwater, produced by his granddaughter CC Goldwater, attempts to explore the unknown side of Barry Goldwater and presents a comprehensive look into his political career.\n\nThe documentary bounces back and forth between personal stories about Goldwater, told by his family, reporters, and politicians, and a chronology of his career in politics. Some of the interviewees include Sen. John McCain, Sen. Hillary Clinton, George Will, Al Franken, Justice Sandra Day O'Connor, and Walter Cronkite.\n\nGoldwater was born in Arizona back before it was even a state, and spent much of his time roughing it in the outdoors, photographing nature, and hanging with Native Americans. His films of the Grand Canyon (one of which is included as a special feature on the DVD) gave him notoriety within the state, and allowed him to work his way up the political chain to become a U.S. Senator. His unwavering libertarian and conservative views, summed up in his book Conscience of a Conservative, made him somewhat of a rock star in the Republican Party. After losing his bid for the presidency, Goldwater served in the Senate until 1986.\n\nMr. Conservative also chronicles Goldwater's dedication to his beliefs and the Constitution, even as his own party moved away from him. Goldwater championed personal freedom, including the right for a woman to have an abortion and for gays to serve in the military (and get married, for that matter). During the 1980s and up until his death in 1998, he spoke out against the &quot;Christian Right&quot; and the social views of the modern Republican Party. He once called on all Christians to kick Jerry Falwell in the a**.\n\nThe documentary provides a look back at the bygone days of campaign stumping and rah-rah presidential campaigns, devoid of any sort of You Tube debating.","torrent":{"xt":"urn:btih:4724885fe126b55750ced3d92a0ce9cf4b175e32","amp;dn":"Mr.+Conservative%3A+Goldwater+on+Goldwater+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4724885fe126b55750ced3d92a0ce9cf4b175e32","infoHashBuffer":{"type":"Buffer","data":[71,36,136,95,225,38,181,87,80,206,211,217,42,12,233,207,75,23,94,50]},"announce":[],"urlList":[]}}