{"title":"GetFLV 9.6.5.3 + Loader (CRACKED) [WORKING]","uid":10175598,"size":31476856,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:48674be466611cbb08d1bb722ad030d5d805c849&amp;dn=GetFLV+9.6.5.3+%2B+Loader+%28CRACKED%29+%5BWORKING%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RG.REBOOT","files":4,"time":1400458027,"description":"PLEASE NOTE: It likes to detect it as a false positive. \n\n\n\n\nGetFLV 9.6.5.3 Final\n\n\n\nDescription:\n\nGetFLV is a powerful and reliable application designed to turn your PC into a FLV studio. It helps you download and manage FLV Video Files. With this tool, you are able to download the FLV movies you like and save them to your hard drive for future playback.\nYou can convert FLV files to regular video files. It will help you extract FLV Audio to mp3 or other audio format. The application can also repair the FLV video files that can't be seeked.\n\n\nBenefits:\n\n*Download ANY Web Video to your PC in mere minutes\n*Support Hundreds Video Sites including: Youtube, HuLu, MTV, CBS...\n*Convert ANY videos for your portable devices like iPod, iPhone, PSP, Zune, etc. devices\n*Convert ANY Video to FLV and put it on ANY web site\n\n\nFeatures:\n\nimageGrab Web Video URL flawlessly\nSimply launch the FLV browser, and visit your favorite video site. Select and play a video, and click &quot;download&quot; to save it to your local disk.\n\nimageDownload Web Video flawlessly\nGetFLV dramatically reduces the download time of Web Videos. The program splits the file into sections, and downloads multiple sections simultaneously, efficiently.\n\nimageConvert Any Web Videos\nIt's simple to convert any web video to MP4, WMV, 3GP, AVI and MOV formats. After conversion, you can watch your movies on any of your computers or portable devices.\n\nimageConvert other videos to Flash\nGetFLV can convert any of these popular video formats into Flash files. It supports almost all types of video formats such as AVI, WMV, MOV, ASF, MP4, 3GP and etc.\n\n\nimageExtract music from Web Video\nGetFLV's built-in audio ripper can extract the music track from any web video and save as MP3, WMA, AAC and other popular music formats.\n\nimageRepair damaged Flash movie\nGetFLV can repair damaged Flash movies. The built-in FLV Fixer and MetaData Injector will analyze and repair Flash files that won't play properly.\n\n\nInstructions:\n\n01. Download ENTIRE Torrent (including Keygen + Loader. DON'T LET YOUR ANTIVIRUS \nDELETE THESE!)\n02. Navigate to the folder 'C:WindowsSystem32driversetc' and open the file \ncalled 'hosts' in a text editor. \n03. Add the following lines to the host file:\n127.0.0.1 localhost \n127.0.0.1 www.vdigger.com\n127.0.0.1 www.getflv.com\n\n04. Save the hosts file. (Be sure to NOT save it as a .txt. Save it as 'hosts' \nwith NO filetype!)\n05. Replace old hosts file with new one (if you couldn't save it directly)\n06. Install GetFLV from the 'gf2setup.exe' file.\n07. Copy the loader from the 'LOADER' folder into the installation location for \nGetFLV\n08. !!MAKE SURE YOUR ANTIVIRUS IS OFF! IT WILL DELETE THE LOADER!!\n09. Launch the loader with admin privileges\n10. A pop-up box will say 'this is a search and replace loader' blah blah blah. \nJust press OK and DON'T CLICK ANYTHING. Just wait for a minute or two.\n11. A pop-up box will say 'offsets found! Please restart loader'. Do what it says.\n12. After loading a second time, press the register box (should pop up this time \nyou load the program)\n13. Open the 'Keygen.exe' file and enter your email or a fake one. Doesn't matter. \n(or you can use the one provided in the notes section)\n14. Copy and paste the email and serial number into the registration box in GetFLV.\n15. Press 'Register'.\n16. Program will say 'Thanks for registering' blah blah blah. \n17. You now have the full version of GetFLV 9.6.5.3. \n18. To update, you have to uninstall the old version, delete the entire GetFLV \nfolder and then install a fresh copy. DO NOT SAVE THE OFFSETS FILE! Delete it!\n\nOfficial Website: &lt;a href=&quot;\nhttp://www.getflv.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.getflv.net/&lt;/a&gt;\n\n\nIf you don't wanna let the program find the offsets itself, just dl this offset file and put it there. LINK:","torrent":{"xt":"urn:btih:48674be466611cbb08d1bb722ad030d5d805c849","amp;dn":"GetFLV+9.6.5.3+%2B+Loader+%28CRACKED%29+%5BWORKING%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48674be466611cbb08d1bb722ad030d5d805c849","infoHashBuffer":{"type":"Buffer","data":[72,103,75,228,102,97,28,187,8,209,187,114,42,208,48,213,216,5,200,73]},"announce":[],"urlList":[]}}