{"title":"Debbie Does Em All (1984) XXX","uid":11822194,"size":1027824291,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4955fddba7a6a78088827e5e15cff5f92b332e59&amp;dn=Debbie+Does+Em+All+%281984%29+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":10,"uploader":"HighCode","files":2,"time":1429304004,"description":"When Debbie Does'em All starts off, Debbie (Angel), is just waking up to start the day. Her boyfriend, Fred (Rod Grant), hops into bed and is feeling frisky but before they can do anything aside from some kissing the phone rings and Debbie gets the job offer she's always wanted - she's a stewardess! Her man complains that they never get to spend any time together, but Debbie has to follow her dreams. Cut to some stock footage of an airport and before you know it, Debbie is hard at work onboard a jet.\n\nCoincidentally, she meets an old friend of hers onboard the plane, Pam (Shanna McCullough), and after some reminiscing, they have their layover - literally. They get off the plane and head over to the home of a rich guy that Pam knows (Nick Niter). They head inside where they find out an orgy is taking place. Of course, these two horny stewardesses aren't going to let an opportunity like this pass them by and before you know it, their clothes are off and they're sucking and fucking with Nick. The girls each give him head and don't seem to mind playing with one another for a bit. Nick delivers some oral affections in return and after he fucks Debbie, he fucks Pam while she eats Debbie out. He pulls out and blows his load onto her stomach to finish the first scene.\n\nWith that out of the way, it's time to get back to work. Back on board the jet they learn that a foxy blonde stewardess named Babs (Lynx Cannon) has a boyfriend named Eddie who is only too happy to ensure she's a continuing member of the mile high club. They cram into the bathroom and get it on, kissing first before she gives him head. He eats her out and then fucks her from a few different angles before pulling out and jerking off onto her muff. Later, Debbie heads to a bar where she meets a man named Antone (Jamie Gillis). They head back to his place where she teases him a bit and works his foreplay mojo on her. He really works her over, taking his time with her and they both seem really into one another here - this is made all the more apparent by the soft Casio keyboard style soundtrack that swells up in the background. There's a lot of oral before they get to the main event, but once they do it's pretty hot. He pulls out and blows his load into her mouth to finish the highlight scene of the movie.\n\nMeanwhile, Debbie is pining away for Fred and expecting to see him but is disappointed to find that her plane gets redirected. Fred isn't really too keen on waiting around, however. He took the initiative and ordered some champagne but soon finds the blonde maid (Lilli Marlene) is too cute to resist. They sample some of the bubbly and soon enough she's got his cock down her throat. He flips her over on the bed and eats her from behind and fingers her a bit before she rides him cowgirl style. She finishes him off with her mouth and ends the scene.\n\nThings are heating up in the cockpit, however, when the captain (Jonathon Younger) has a rendezvous with one of the other stewardesses, (Cory). She sucks his cock and pays a lot of attention to his fuzzy black balls - both unaware that they can be heard on the intercom. She sucks him to a finish and he squirts a load into her mouth which she laps up. This chick is obviously really into sucking cock and it shows. Debbie is now in the mood after listening in, so she takes advantage of yet another horny stewardess (Lonnie Emerson). Their tops come off and after some titty sucking Debbie gets eaten out.\n\nOnce the plane eventually lands, Debbie can't wait to find Fred again. She's been longing for him all this time and winds up heading to a costume party in New Orleans where he's waiting for her. They're happy to see one another so she ducks under the table and sucks his cock for him right in the restaurant. He finishes in her mouth and the movie hits a freeze frame, cum dripping down her chin as the credits roll up the screen and bad music plays.\n\n  Screenshots: &lt;a href=&quot;\nhttp://imgclover.com/image/2c&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/2c&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/2f&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/2f&lt;/a&gt;","torrent":{"xt":"urn:btih:4955fddba7a6a78088827e5e15cff5f92b332e59","amp;dn":"Debbie+Does+Em+All+%281984%29+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4955fddba7a6a78088827e5e15cff5f92b332e59","infoHashBuffer":{"type":"Buffer","data":[73,85,253,219,167,166,167,128,136,130,126,94,21,207,245,249,43,51,46,89]},"announce":[],"urlList":[]}}