{"title":"John McGahern - 2 novels (pdf)","uid":10136437,"size":4683958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49d6bb8fbaa5ad0d70f6a9ad03a7ba532f280517&amp;dn=John+McGahern+-+2+novels+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1399947991,"description":"John McGahern - The Dark (Faber &amp; Faber, 1983; first published 1965). 191 pages.\n\n-- That They May Face the Rising Sun (Faber &amp; Faber, 2002). 314 pages. (This book was retitled By the Lake by its American publisher.)\n\nTwo novels by the great Irish novelist and short story writer. The first was banned in Ireland and lost its author his job. By the time the second was written McGahern had achieved worldwide renown.\n\ndescription of The Dark:\n\nThe Dark, widely acclaimed, yet infamously banned, is John McGahern's sensitive, perceptive, and beautifully written portrayal of a young man's coming-of-age in rural Ireland. Imaginative and introverted, the boy is successful in school, but bitterly confused by the guilt-inducing questions he endures from the priests who should be his venerated guides. His relationship with his bullying, bigoted, widowed father is similarly conflicted -- touched with both deep love and carefully suppressed hatred. When he must leave home to further his education, their relationship is drawn to an emotional climax that teaches both father and son some of the most intricate truths about manhood.\n\ndescription of That They May Face the Rising Sun:\n\nIrish writer John McGahern's first new novel in 12 years, That They May Face the Rising Sun, is a work of delicately forged beauty, the nearest he has yet come to writing of happiness. The plot remains defiantly not the thing for McGahern, with little of consequence happening beyond life's natural syncopations, yet the nuances of language and relationship soar as gracefully as the abundant wildfowl that crowd the book's pages. News is the old currency, carried in the dialogue which remains McGahern's most discernible talent. Set in rural County Leitrim, the inhabitants of the houses around the lake and the local town, heady on the whiskey elixir that loosens tongues or seals deals, watch as their insular community is gently pummelled by the creeping advance of modern life. While they share the year's natural cycle, the unfolding months reveal their personal differences: Joe and Kate Ruttledge, returned after a long spell in London; Mary and Jamesie, their whole life lived there; John Quinn, the charming, brutal womaniser, who marries and loses as quickly the bride he finds at the Knock Marriage Bureau; The Shah, Kate's uncle, who wordlessly sells his business to his cripplingly honest assistant, Frank; and Jimmy Joe Kiernan, auctioneer and undertaker, a veteran IRA man still on the lookout for stray souls. And then there is Jamesie's brother Joseph, the best shot in the district, who went to England after a woman, and stayed there, his soul sold for the &quot;alphabetical&quot; order of English life.\n\nThere is little alphabetical to McGahern's view of life, though there is consummate poetry. His narrative quietly rumbles out its melody through gentle variance, undulating conversations over the restless scars of violent pasts and fractured presents, the Troubles only ever across the nearby border. Stories are for the re-telling, yet the intrusion of telephone wires and Blind Date merely formalises the inevitable, the secularisation of ritual, and the dying of belief, if not yet habit. Already acclaimed as one of Ireland's leading writers for works such as High Ground and Amongst Women, to read this offering is to appreciate the unique beauty of the novel form, and the rare, bewitching talent of John McGahern.","torrent":{"xt":"urn:btih:49d6bb8fbaa5ad0d70f6a9ad03a7ba532f280517","amp;dn":"John+McGahern+-+2+novels+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49d6bb8fbaa5ad0d70f6a9ad03a7ba532f280517","infoHashBuffer":{"type":"Buffer","data":[73,214,187,143,186,165,173,13,112,246,169,173,3,167,186,83,47,40,5,23]},"announce":[],"urlList":[]}}