{"title":"Teach your self Finnish (mp3 + pdf )","uid":4572270,"size":33559045,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4a95df85facfbc9abc0a264b35700c1ea1399ea0&amp;dn=Teach+your+self+Finnish+%28mp3+%2B+pdf+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fold2008","files":117,"time":1229098863,"description":"Teach Yourself Finnish is the course for anyone who wants to progress quickly from the basics to understanding, speaking and writing Finnish with confidence. Although aimed at those with no previous knowledge, it is equally suitable for anyone wishing to brush up existing knowledge for a holiday or business trip. Key structures and vocabulary are introduced in 18 thematic units progressing from introducing yourself and dealing with everyday situations to talking about work and driving in Finland. The first five units are a survival package. They give a basic introduction to the kind of language you need when you visit the country. In the later units you will become familiar with many aspects of Finnish life as well as the language. The emphasis is on communication throughout with important language structures introduced through dialogues on the accompanying recording. There are plenty of exercises to practise the language as it is introduced and tips throughout to help with grammar. Cultural information boxes give useful advice and information for anyone planning a trip to Finland.\n\nAverage quality of mp3 bitrate 22 kbps\n\nA sample of the quality of the pdf can be found below\n","torrent":{"xt":"urn:btih:4a95df85facfbc9abc0a264b35700c1ea1399ea0","amp;dn":"Teach+your+self+Finnish+%28mp3+%2B+pdf+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a95df85facfbc9abc0a264b35700c1ea1399ea0","infoHashBuffer":{"type":"Buffer","data":[74,149,223,133,250,207,188,154,188,10,38,75,53,112,12,30,161,57,158,160]},"announce":[],"urlList":[]}}