{"title":"BBC The Sky at Night 2007 09 Black Holes and Black Magic DVBC Xv","uid":4235380,"size":390382672,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4b0d3fde242600abdcd3ee1cb0240cdfd230b901&amp;dn=BBC+The+Sky+at+Night+2007+09+Black+Holes+and+Black+Magic+DVBC+Xv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":1,"time":1213281010,"description":"BBC The Sky at Night - Black Holes and Black Magic (2007)\n\n\n\n\nInformation\n\nSeptember&amp;#039;s Episode - Black Holes and Black Magic\nSaturday 08 September, 1.00pm BBC Two (short)\nRecorded: 04 (?) September BBC Four (long version)\n\nBlack Holes\n\nBlack holes were once thought to be the monsters of the Universe, devouring everything around them in a frenzied cosmic feast. But now astronomers think that rather than being a space menace, black holes may be fundamental to the creation of galaxies. \n\nBlack holes are regions of space where gravity is so strong that not even light can escape, making them impossible to see. But we can see the stuff that is being sucked in to these massive cosmic vacuum cleaners. Anything that approaches a black hole is first torn apart by its immense gravitational force and then forms a flat rotating disc that spirals into the hole. \n\nAs this debris gets closer and closer to the mouth of the black hole it speeds up and the bits start to smash together. The material heats up due to this friction [this is the same effect as when you rub your hands together to warm them up]. When this happens around a black hole, X-rays are given off which we can detect. If the black hole is really large and has lots of debris in its disc, then it can reveal itself as one of the brightest objects in the Universe - a quasar. \n\nThere are two main types of black hole - stellar and supermassive. Stellar sized black holes are the remnants of massive dead stars that have imploded. The nearest one to us is part of a binary system called Cygnus X-1, discovered in 1971. It is in the constellation of Cygnus, also known as the Northern Cross. It&amp;#039;s estimated that our galaxy contains millions of these stellar black holes. Supermassive black holes, on the other hand, can have initial masses millions of times that of the Sun. It&amp;#039;s now thought that they may lurk in the centre of every galaxy and be integral to the way galaxies evolve. There might also be other types of black holes, such as mini black holes, smaller (in volume) than atoms but as massive (in amount of matter) as whole mountains. Or even middle-sized black holes, mid-way between the stellar and supermassive variety. It&amp;#039;s possible that there could be such things as &amp;#039;white holes&amp;#039;, the opposite of black holes, spewing out matter and energy into the Universe. However, this is just another of the cosmic mysteries still awaiting a solution.\n\n\n\n\n   \n\n\nOfficial Website\n\nTechnical Specs\n\nGSpot v2.70a avi file details:\n------------------------------\nFilename.....:\nFilesize.....: 390,382,672 bytes\nRuntime......: 28:52.040 (43301 frames)\n\nVideo Codec..: XviD ISO MPEG-4 (B-VOP//)\nVideo Bitrate: 1659 kbps\nAspect Ratio.: 672x384 (1.750)\nFramerate....: 25.000 fps\nBitstream....: Unpacked\n\nAudio Codec..: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 122kbps 2ch VBR 48000Hz\nLanguage.....: English\n\n","torrent":{"xt":"urn:btih:4b0d3fde242600abdcd3ee1cb0240cdfd230b901","amp;dn":"BBC+The+Sky+at+Night+2007+09+Black+Holes+and+Black+Magic+DVBC+Xv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b0d3fde242600abdcd3ee1cb0240cdfd230b901","infoHashBuffer":{"type":"Buffer","data":[75,13,63,222,36,38,0,171,220,211,238,28,176,36,12,223,210,48,185,1]},"announce":[],"urlList":[]}}