{"title":"OS X 10.8 Mountain Lion DP4 VMware Image","uid":7357300,"size":4618420466,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c2d23ad5507be5399d9265fbc335dc2d67a8f63&amp;dn=OS+X+10.8+Mountain+Lion+DP4+VMware+Image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SoulUploader","files":3,"time":1339811685,"description":"Full release notes can be found in this post:\n\nUpdated Mountain Lion Developer Preview VMware Image. Completely Vanilla, all drivers are originally Apple's (although some are heavilty modified). Boots on average around 1m 15 seconds. Recommended you watch the setup video contained in the download to get it working properly, anything covered in that won't be addressed in the comments.\n\nLatest release of the Previews as of 16/06/2012. XCode can be installed via the App Store, as it functions *perfectly* as a Mac. AMD users should consult the setup guide beforehand as only certain models work so it's your call if you want to try it or not, however for it's always worth a shot.\n\nUnlike previous downloads, it's a .7z (too big to fit in an SFX), so extract with 7zip or WinRAR to about 6GB when extracted. Works with Player, Workstation and Fusion, both old and new versions. Watch the Setup Guide to set it all up properly (it'll help you to no end). Without following the setup guide it's more than likely you'll have no luck.\n\nPlease note: The Hardware Bypasser included was created using Tola's Patching Engine 2.03b and packaged using UPX 3.07, which results in false reports from certain virus scanners. All it does is reconstruct the vmware-vmx.exe file in the VMware Program Files folder when run. If you're unwilling to take my word for it, just open the archive in 7zip (before you extract) and delete &quot;vmware-vmx-patch.exe&quot;, which will remove it. \n\nIf you wanna follow my work/releases follow us at http://souldevteam.net/blog.","torrent":{"xt":"urn:btih:4c2d23ad5507be5399d9265fbc335dc2d67a8f63","amp;dn":"OS+X+10.8+Mountain+Lion+DP4+VMware+Image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c2d23ad5507be5399d9265fbc335dc2d67a8f63","infoHashBuffer":{"type":"Buffer","data":[76,45,35,173,85,7,190,83,153,217,38,95,188,51,93,194,214,122,143,99]},"announce":[],"urlList":[]}}