{"title":"Howling Bells...The Loudest Engine(2011)[FLAC]","uid":6961780,"size":283426511,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c9de0a38613734a0c3931cfd64541b9db88a954&amp;dn=Howling+Bells...The+Loudest+Engine%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1326785688,"description":"[img]http://image.allmusic.com/00/amg/cov200/drq600/q691/q69167k0d8m.jpg[/img]\n[color=Red]The Loudest Engine[2011] Cooking Vinyl 546 [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n 1  Charlatan  2:53 \n  2  Into the Sky  3:05 \n  3  The Wilderness  4:01 \n  4  Secrets  3:18 \n  5  Don't Run  3:32 \n  6  The Faith  2:56 \n  7  Live On  3:26 \n  8  The Loudest Engine  4:34 \n  9  Gold Suns, White Guns  3:32 \n  10  Sioux  3:27 \n  11  Baby Blue 3:07 \n  12  Invisible  3:28 \n\nHot on the heels of the critically acclaimed debut from Cloud Control, London-based, Sydney four-piece Howling Bells' third album, The Loudest Engine, continues the Australian indie bands' sudden love affair with '60s psychedelia and '70s Americana on 12 tracks that bear all the hallmarks of the Southern states they traveled through while supporting Coldplay. Given an extra-authentic Nevada Desert sheen by the presence of Killers' bassist Mark Stoermer as producer (his first solo role outside his band), it's a much grittier affair than its electro-tinged predecessor, Radio Wars, as evident on the propulsive basslines and screeching acid guitars of the gothic new wave title track, the grungy blues of &quot;Baby Blue,&quot; and the scuzzy garage rock of &quot;Invisible.&quot; It's a convincing and natural progression which is likely to sound even more powerful during the kind of live shows which inspired it, but fans of their previous shimmering, shoegazing sound shouldn't be too concerned, as the likes of the Cocteau Twins-esque &quot;Into the Sky,&quot; the gorgeous West Coast harmonies of the post-apocalyptic &quot;The Wilderness,&quot; and the chiming melancholy of &quot;Sioux&quot; are just as ethereal and magical as the best offerings from their first two records. Juanita Stein remains their most captivating weapon, her versatile femme fatale tones effortlessly gliding from ghostly PJ Harvey-style brooding on opening track &quot;Charlatan,&quot; to Kate Bush-inspired banshee dramatics on the twinkling &quot;Gold Suns, White Guns,&quot; but Stoermer's woozy production proves the first time that her striking vocals have found a backdrop to match them. The lackluster middle trio of &quot;Don't Run,&quot; &quot;The Faith,&quot; and &quot;Live On&quot; are a little too pedestrian when compared to the distinctive and uncompromising tracks on either side of them, but despite this half-way lull, The Loudest Engine is still a consistent and admirably raw back to basics affair which deserves to repeat the success of their neighboring retro-rock revivalists. \n\ncd ripped by X Lossless Decoder\n\nplease seed\n\n[url]http://dickthespic.org/about/[/url]","torrent":{"xt":"urn:btih:4c9de0a38613734a0c3931cfd64541b9db88a954","amp;dn":"Howling+Bells...The+Loudest+Engine%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c9de0a38613734a0c3931cfd64541b9db88a954","infoHashBuffer":{"type":"Buffer","data":[76,157,224,163,134,19,115,74,12,57,49,207,214,69,65,185,219,136,169,84]},"announce":[],"urlList":[]}}