{"title":"The Anthony Cumia Show 2015-04-14 Mike Recine","uid":11816815,"size":314261995,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4d4211e74bd1bea5d40b13c9da4e972a8c93a7fc&amp;dn=The+Anthony+Cumia+Show+2015-04-14+Mike+Recine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1429122408,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Mike Recine\n\nEpisode 145 -  While we wait for the SpaceX rocket to blast off for the International Space Station live, Ant talks about his old school lunar module toy, says he's already sick of presidential chatter, and we finally see SpaceX launch and watch it for a bit. Anthony then tells us the revelation he had after updating several passwords with &quot;finger security&quot;, admits he broke down and bought an Apple watch, talks about (and demonstrates) Tori Spelling's hibachi burn, a worker that was trapped in a plane's cargo hold, his own sleepy time on-air, and we're treated to a brand new Scorch video. Anthony goes through the mail, reads a TSA groping story, one on hot teacher sex, checks back in with SpaceX, and we hear from a Milwaukee police chief who &quot;keeps it real&quot;. Comedian Mike Recine joins TACS to discuss being on Conan, how he got into comedy, his thoughts on offending people, bombing, the Sopranos, and we learn that he pushes homemade sauce at gigs. Mike talks about his autistic brother, the guys chat about drinking, side jobs, the TV show Hoarders, stereotyping men and women by their jobs, the presidential candidates, Twitter haters, and reminisce about the &quot;Homeless Shopping Spree&quot;. They then chat about becoming desensitized, phone's getting people in trouble, fun with emojis, luck with the ladies back in school, Ant's birthday gift to himself, Jon Stewart, envelope pushers, and Mike talks about being in studio with Ron and Fez when Legion of Skanks made Fez cry.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:4d4211e74bd1bea5d40b13c9da4e972a8c93a7fc","amp;dn":"The+Anthony+Cumia+Show+2015-04-14+Mike+Recine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d4211e74bd1bea5d40b13c9da4e972a8c93a7fc","infoHashBuffer":{"type":"Buffer","data":[77,66,17,231,75,209,190,165,212,11,19,201,218,78,151,42,140,147,167,252]},"announce":[],"urlList":[]}}