{"title":"PS2 - In The Groove - DVD NTSC ISO 2005 like Dance Dance Revolut","uid":3460723,"size":3511956162,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:4e727a81a7b6bbd84a635e385ab86b3d24de8cf8&amp;dn=PS2+-+In+The+Groove+-+DVD+NTSC+ISO+2005+like+Dance+Dance+Revolut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rushguard","files":1,"time":1142977369,"description":" &lt;a href=&quot;http://www.inthegroove.com/page/PlayStation_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.inthegroove.com/page/PlayStation_2&lt;/a&gt;\n\n\nThe smash arcade hit In The GrooveÂ® is available at home for the PlayStationÂ®2. In The Groove is perfect for new players and expert players alike with five difficulty levels, a fitness mode, and popular music by signed artists and rising music groups from around the world. The game is easy to learn, totally addictive, great exercise, and fun for all ages. \n\n\nIn the Groove features: \nOver 70 brand new songs from proven talent and new independent artists, covering a wide variety of genres \nOver 550 new step patterns from step artists in the dance community. \nUnlockable songs and courses \nThree Styles of play: One Player, Two Player, or Double Pad. \nUp to 5 difficulty levels per song to accommodate all players from beginners to experts. \nInnovations in step choreography: mines, hands, and quads will have you making new kinds of moves. \n40+ modifier options, including 20+ new arrow modifiers for creative challenges. \nSelect multiple options on the same options line to create thousands of combinations. \n\n\n5 Different Play Modes: \nDance: The traditional mode of play. Dance for fun, or compete for personal or machine top score. \nBattle: Play against a human or computer opponent in a tug-o-war meter competition. Confuse your opponent with arrow modifiers while fending off attacks. \nMarathon: Play songs nonstop and try to survive our tricky scripted modifier sequences. \nTutorial: New players can try our hands-on tutorial and learn the ropes. \nFitness: Stay in shape by keeping track of your daily routines and tracking the amount of calories you burn. Choose between One Player, Two Player or Double Fitness Modes. \n\n","torrent":{"xt":"urn:btih:4e727a81a7b6bbd84a635e385ab86b3d24de8cf8","amp;dn":"PS2+-+In+The+Groove+-+DVD+NTSC+ISO+2005+like+Dance+Dance+Revolut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e727a81a7b6bbd84a635e385ab86b3d24de8cf8","infoHashBuffer":{"type":"Buffer","data":[78,114,122,129,167,182,187,216,74,99,94,56,90,184,107,61,36,222,140,248]},"announce":[],"urlList":[]}}