{"title":"Fit Series with Stephanie McMahon Workout","uid":12074871,"size":528297778,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4e808f0f3d4b1c2528b12d3a598ef4a24d356861&amp;dn=Fit+Series+with+Stephanie+McMahon+Workout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MrTVGuy","files":7,"time":1435611683,"description":"Wish you had a ripped, sexy body like the extraordinary women of the WWE? Well, now you can! With the help of WWE mogul and mother of 3, Stephanie McMahon you can achieve a lean, sculpted physique worthy of the main event. Crafted by world-renowned strength and conditioning coach Joe DeFranco, this system, complete with a 4-week calendar, transforms and strengthens the upper and lower body, chisels the abs, sheds fat with powerful cardio, and creates long, flexible muscle. Strong is the new sexy, so become queen of the ring and build your best body ever!\n\n[You will need sets of dumbbells that range from light to heavy.]\n\nWORKOUTS:\n\n(Optional): Each workout includes a quick and effective warm-up and cool down.\n\nUpper Body (14 min):\nStrut your stuff with this powerful strength circuit that uses bodyweight, dumbbells, and progressive reps to sculpt sexy arms, defined shoulders, and a gorgeous back.\n\nLower Body (15 min):\nTone, tighten, and turn heads with butt-blasting rounds of a super circuit that tackles your trouble zones while increasing muscular strength and endurance.\n\nAbs/Core (12 min):\nGet tough and get ripped with Tabata-style circuits (4 moves/4 minutes) that challenge core strength and function to trim inches and shred strong, sexy abs.\n\nCardio (17 min):\nIncinerate fat and calories with 2 heart-pumping circuits of fierce calisthenics like mountain climbers and T-plank rotations to improve endurance and drop pounds.\n\nFlexibility (7 min):\nImprove flexibility, reduce soreness, and recover faster with an essential series of yoga poses and mobility moves that help create long, lean, and limber muscle","torrent":{"xt":"urn:btih:4e808f0f3d4b1c2528b12d3a598ef4a24d356861","amp;dn":"Fit+Series+with+Stephanie+McMahon+Workout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e808f0f3d4b1c2528b12d3a598ef4a24d356861","infoHashBuffer":{"type":"Buffer","data":[78,128,143,15,61,75,28,37,40,177,45,58,89,142,244,162,77,53,104,97]},"announce":[],"urlList":[]}}