{"title":"Eastbound and Down Seasons 1-3 Complete","uid":7359348,"size":5594930730,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4f51e9d2348a7491a341b1e87b9032e295ceac40&amp;dn=Eastbound+and+Down+Seasons+1-3+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dermie_72","files":29,"time":1339894709,"description":"Season 1 - 3 of Eastbound and Down\n \nKenny Fucking Powers, eat your heart out. \n\nQuote from IMDB User Review:\n \n&quot;The pilot episode was really funny. Danny McBride has that elusive, thoroughly Southern quality of brazenly aggressive, righteous pride that infuses every note. I have met pure examples of the archetype of &quot;Kenny Powers&quot; and while they may be rare, McBride captures the essence honestly and vigorously. The strong cast really elevates a show that could so easily and effortlessly slide into a grating farce. The women in Kenny's life are played with brilliantly understated dignity that is rendered so subtly, so carefully, it turbo-charges the comedy. Katy Mixon's reactions had me howling with laughter. Jennifer Irwin's southern housewife is spot-on with her quiet, tortured expressions that are amazing in their subtlety. Katy and Jennifer coil the show's mainspring so remarkably tight, it explodes when the raucously sexy Sylvia Jefferies and the hilarious Danny McBride pile on. John Hawkes has the hardest job in the cast. Hawkes plays Kenny's older brother Dustin and has to be both dignified and provide some degree of plausibility for Kenny's existence. There is a rich vein of comedy and heartfelt sincerity that lies underneath Kenny and Dustin's relationship and I hope the creators can navigate through it over time as deftly as Hawkes has managed his role in the pilot. The pilot episode seemed effortlessly directed by Jody Hill. Hill let the writing and the performances do the heavy lifting by placing a premium value on subtlety and nuance. For all Kenny's hurricane-like energy to dominate a scene, Hill balances that power by tempering it with the lightest touches from the rest of the cast. I look forward to future episodes, these folks have something indescribably great on their hands.\n &quot;\n \nI'll seed this for as long as I can, if I'mnot seeding when you try, its because of connection issues. I will be back, so don't give up.\n \nAny problems, inbox me. ","torrent":{"xt":"urn:btih:4f51e9d2348a7491a341b1e87b9032e295ceac40","amp;dn":"Eastbound+and+Down+Seasons+1-3+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f51e9d2348a7491a341b1e87b9032e295ceac40","infoHashBuffer":{"type":"Buffer","data":[79,81,233,210,52,138,116,145,163,65,177,232,123,144,50,226,149,206,172,64]},"announce":[],"urlList":[]}}