{"title":"John Grisham - The Innocent Man (Unabridged) 48k .MP3","uid":4096116,"size":269919398,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4f6adea9cd146674b2be0116539e0b19c82e0cc3&amp;dn=John+Grisham+-+The+Innocent+Man+%28Unabridged%29+48k+.MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Diaperzone","files":184,"time":1206325450,"description":"The Innocent Man: Murder and Injustice in a Small Town (Unabridged)\n\n   Author: John Grisham\n   Reader: Craig Wasson\n   Year  : 2006\n\n48kps .MP3 Audiobook (Non-Fiction)\nCDs 1-10, Run time: 12:28:54\n\n\nGrisham&amp;#039;s first work of nonfiction focuses on the tragedy of Ron Williamson, a baseball hero from a small town in Oklahoma who winds up a dissolute, mentally unstable Major League washout railroaded onto death row for a hometown rape and murder he did not commit. \n\nJudging by this author-approved abridgment, Grisham has chosen to present Williamson&amp;#039;s painful story (and that of his equally innocent &quot;co-conspirator,&quot; Dennis Fritz) as straightforward journalism, eschewing the more familiar &quot;nonfiction novel&quot; approach with its reconstructed dialogues and other adjustments for dramatic purpose. \n\nThis has resulted in a book that, while it includes such intriguing elements as murder, rape, detection and judicial injustice, consists primarily of objective reportage, albeit shaded by the now-proven fact of Williamson&amp;#039;s innocence. \n\nThe absence of dialogue or character point of view could make for a rather bland audio. Boutsikaris avoids that by reverting to what might be called old-fashioned round-the-campfire storytelling, treating the lengthy exposition to vocal interpretations, subtle and substantial. He narrates the events leading up to the 1982 rape and murder of a young cocktail waitress with a mixture of suspicion and curiosity, moving on to astonishment at the prosecution&amp;#039;s use of deceit and false testimony to convict Williamson and Fritz and, eventually, elation at the exoneration of the two innocent men. Throughout, he maintains an appealing conversational tone, an effect made all the more remarkable by the book&amp;#039;s nearly total absence of conversatio","torrent":{"xt":"urn:btih:4f6adea9cd146674b2be0116539e0b19c82e0cc3","amp;dn":"John+Grisham+-+The+Innocent+Man+%28Unabridged%29+48k+.MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f6adea9cd146674b2be0116539e0b19c82e0cc3","infoHashBuffer":{"type":"Buffer","data":[79,106,222,169,205,20,102,116,178,190,1,22,83,158,11,25,200,46,12,195]},"announce":[],"urlList":[]}}