{"title":"Hidden Secrets - Part 69 - Secrets in Plain Sight","uid":12441967,"size":9788886694,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50077860bfd1cdb3da4b3fafd23acaa01d5da631&amp;dn=Hidden+Secrets+-+Part+69+-+Secrets+in+Plain+Sight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":118,"time":1442586354,"description":"What they are trying to say is THAT THEY WORSHIP SATAN.\n\nMasonic conspiracy theories are conspiracy theories involving Freemasonry; hundreds of such conspiracy theories have been described since the late 18th century.[1] Generally, these theories fall into three distinct categories: political (usually involving allegations of control of government, particularly in the United States and the United Kingdom), religious (usually involving allegations of anti-Christian or Satanic beliefs or practices), and cultural (usually involving popular entertainment). Many conspiracy theory writers have connected Freemasons (and the Knights Templar) with worship of the devil;[2][3][4][5][6] these ideas are based on different interpretations of the doctrines of those organizations.[7]\n\nOf the claims that Freemasonry exerts control over politics, perhaps the best-known example is the New World Order theory, but there are others. These mainly involve aspects and agencies of the United States government, but actual events outside the US (such as the Propaganda Due scandal in Italy) are often used to lend credence to claims.\n\nAnother set of theories has to do with Freemasonry and religion, particularly that Freemasonry deals with &quot;the occult&quot;.[8] These theories have their beginnings in the Taxil hoax.[9][10] In addition to these, there are various theories that focus on the embedding of symbols in otherwise ordinary items, such as street patterns, national seals, corporate logos, etc.\n\nThere are Masonic conspiracy theories dealing with every aspect of society. The majority of these theories are based on one or more of the following assumptions:\n\nThat Freemasonry is its own religion, requires belief in a unique Masonic &quot;god&quot;, and that belief in this Masonic &quot;god&quot; is contrary to the teachings of various mainstream religions (although usually noted in terms of being specifically contrary to Christian belief)[11]\nThat the 33rd degree of the Scottish Rite is more than an honorary degree, coupled with the belief that most Freemasons are unaware of hidden or secretive ruling bodies within their organization that govern them, conduct occult ritual, or control various positions of governmental power[12]\nThat there is a centralized worldwide body that controls all Masonic Grand Lodges, and thus, all of Freemasonry worldwide acts in a unified manner","torrent":{"xt":"urn:btih:50077860bfd1cdb3da4b3fafd23acaa01d5da631","amp;dn":"Hidden+Secrets+-+Part+69+-+Secrets+in+Plain+Sight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50077860bfd1cdb3da4b3fafd23acaa01d5da631","infoHashBuffer":{"type":"Buffer","data":[80,7,120,96,191,209,205,179,218,75,63,175,210,58,202,160,29,93,166,49]},"announce":[],"urlList":[]}}