{"title":"Forbidden Zone in Color (AVI)","uid":7644530,"size":1360108420,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:500aea5542235ec106bb1a58964af4410d5ab93a&amp;dn=Forbidden+Zone+in+Color+%28AVI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sulla_felix","files":5,"time":1347867049,"description":"Words like &quot;delirious&quot; and &quot;bizarre&quot; simply don't suffice to describe Forbidden Zone, director Richard Elfman's 1980 musical fantasy that makes its DVD debut after two decades as a cult favorite. Conceived as an extension of the avant-garde theater troupe/music group the Mystic Knights of the Oingo Boingo (later just Oingo Boingo, which counted Elfman, his brother Danny, and co-scripter Matthew Bright--later the director of Freeway--among its members), Forbidden Zone tells the story of Frenchy (production designer Marie-Pascal Elfman, Richard's then-wife), who accidentally enters the phantasmagorical Sixth Dimension through a door in her basement. There, her waifish good looks catch the eye of King Fausto (Herve Villechaize), much to the consternation of Queen Doris (the indomitable Susan Tyrell). A frantic, funny, and occasionally profane blend of Fleischer Brothers cartoons, German Expressionism, Depression-era musicals, and '60s underground movies, Forbidden Zone is definitely not for all viewers, but cult aficionados will be delighted by the sheer energy and imagination of this long-unavailable classic.\n\n-------------------------------------------------------------------------------------\n\nPirates, sharing is caring! Please do your part to show support and combat copyright everywhere! Seed the torrents you download, and upload your own!\n\nAnd remember... &quot;If Sulla did it, why can't I?&quot;\t\t\t\t","torrent":{"xt":"urn:btih:500aea5542235ec106bb1a58964af4410d5ab93a","amp;dn":"Forbidden+Zone+in+Color+%28AVI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"500aea5542235ec106bb1a58964af4410d5ab93a","infoHashBuffer":{"type":"Buffer","data":[80,10,234,85,66,35,94,193,6,187,26,88,150,74,244,65,13,90,185,58]},"announce":[],"urlList":[]}}