{"title":"BangBus - Rene XXX 480p 24.10.2001","uid":11264113,"size":406531943,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:506db80ecf001adc1a14475b12ea732182fe15a3&amp;dn=BangBus+-+Rene+XXX+480p+24.10.2001+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"christian2353","files":1,"time":1414001718,"description":"Screenshots\n &lt;a href=&quot;\nhttp://avenuexxx.com/archives/45956&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://avenuexxx.com/archives/45956&lt;/a&gt;\n\n\n\nWe met up with a buddy of mine named Jimmy at a local frat house, normally I dont hang out around the frat houses but this was an exception. We went to meet up with a group of guys who wanted to check out some raw bang bus movies. well, they all lost their *censored*and I made some new fans. Remember any guy can star in the bang bus so we took along Jimmy and luckily found a sexy mature chick at a nearby gas station. Her car had broken down and there wasn't a mechanic for a few miles. We just happened to be in the right place at the right time. Offering our services, we told her we would take her to the next shop about 5 miles down the road. Once we got her in the van we headed in the opposite direction, she didn't know shit, she was from France or something. She got kinda pissy because we were fucking around so much and not taking her directly to the mechanic. She started acting kinda weird like she knew that she was getting fucked one way or another. She prepared for a slamming by relaxing and taking everything in stride... well actually what I mean is, she began attacking Jimmy, riping his shirt off, I almost thought she was a cop or something but just a real women, living out her fantasy. Man we tore into this chick. I made her suck that dick, talk with the dick in her mouth, dance with the dick, ride that dick, and she fucking loved it. She was a fine piece of fuck meat, then my man Jimmy, after shagging her pink white ass, blew a load all over her cute little bitch face as she lapped it up like a fucking puppy that begged for seconds. Unfortunately there was no time for that because we had to return the van so we did the next best thing, we just dropped her of in some neighborhood on the way to the rental place","torrent":{"xt":"urn:btih:506db80ecf001adc1a14475b12ea732182fe15a3","amp;dn":"BangBus+-+Rene+XXX+480p+24.10.2001+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"506db80ecf001adc1a14475b12ea732182fe15a3","infoHashBuffer":{"type":"Buffer","data":[80,109,184,14,207,0,26,220,26,20,71,91,18,234,115,33,130,254,21,163]},"announce":[],"urlList":[]}}