{"title":"Multiprocessor Systems-on-Chips ed Jerraya and Wolf","uid":7230067,"size":4069137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50cda961eb7689819622efbd7098c9b1cf4d1998&amp;dn=Multiprocessor+Systems-on-Chips+ed+Jerraya+and+Wolf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1335805501,"description":"Multiprocessor Systems-on-Chips\nedited by Ahmed Amine Jerraya and Wayne Wolf\n\nModern system-on-chip (SoC) design shows a clear trend toward integration of multiple processor cores on a single chip. Designing a multiprocessor system-on-chip (MPSOC) requires an understanding of the various design styles and techniques used in the multiprocessor. Understanding the application area of the MPSOC is also critical to making proper tradeoffs and design decisions.\n\nMultiprocessor Systems-on-Chips covers both design techniques and applications for MPSOCs. Design topics include multiprocessor architectures, processors, operating systems, compilers, methodologies, and synthesis algorithms, and application areas covered include telecommunications and multimedia. The majority of the chapters were collected from presentations made at the International Workshop on Application-Specific Multi-Processor SoC held over the past two years. The workshop assembled internationally recognized speakers on the range of topics relevant to MPSOCs. After having refined their material at the workshop, the speakers are now writing chapters and the editors are fashioning them into a unified book by making connections between chapters and developing common terminology.\n\npublished by Morgan Kaufman, an imprint of El$evier\n\nRIP library dot nu, RIP ifile dot it ","torrent":{"xt":"urn:btih:50cda961eb7689819622efbd7098c9b1cf4d1998","amp;dn":"Multiprocessor+Systems-on-Chips+ed+Jerraya+and+Wolf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50cda961eb7689819622efbd7098c9b1cf4d1998","infoHashBuffer":{"type":"Buffer","data":[80,205,169,97,235,118,137,129,150,34,239,189,112,152,201,177,207,77,25,152]},"announce":[],"urlList":[]}}