{"title":"Abraham Lincoln VAMPIRE HUNTER - GLOBE","uid":7400821,"size":1154603254,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50eab7f589db9d99d8709d5200d36082dc35039b&amp;dn=Abraham+Lincoln+VAMPIRE+HUNTER+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1341070620,"description":"* XVID CAM  * 01H33M53S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* Plot :\n\nIn 1818, Abraham Lincoln (Benjamin Walker) lives in Indiana with his parents, Nancy (Robin McLeavy) and Thomas (Joseph Mawle), who works at a plantation owned by Jack Barts (Marton Csokas). There, Lincoln befriends a young African American boy, William Johnson (Anthony Mackie), and intervenes when he sees Johnson being beaten by a slaver. Because of his son's actions, Thomas is fired. That night, Lincoln sees Barts break into his house and attack Nancy. She falls ill the following day, and dies shortly afterwards. Thomas tells Lincoln that Barts poisoned Nancy.\n\nNine years later, Lincoln decides to get revenge against Barts. He attacks Barts at the docks, but Barts, who is actually a vampire, overpowers him. However, before Barts can kill him, Lincoln is rescued by Henry Sturgess (Dominic Cooper). Sturgess explains that vampires exist, and offers to teach Lincoln to be a vampire hunter. Lincoln accepts and, after a decade of training, travels to Springfield, Illinois. During his training, Sturgess tells Lincoln that the vampires in America descend from Adam (Rufus Sewell), a vampire who owns a plantation in New Orleans with his sister, Vadoma (Erin Wasson). Sturgess also tells Lincoln of the vampires' weakness, silver, and presents him with a silver pocket\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:50eab7f589db9d99d8709d5200d36082dc35039b","amp;dn":"Abraham+Lincoln+VAMPIRE+HUNTER+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50eab7f589db9d99d8709d5200d36082dc35039b","infoHashBuffer":{"type":"Buffer","data":[80,234,183,245,137,219,157,153,216,112,157,82,0,211,96,130,220,53,3,155]},"announce":[],"urlList":[]}}