{"title":"The Truth about Muhammad","uid":4253037,"size":1023328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5152c26b8283a6b50d03919b22642248768855d6&amp;dn=The+Truth+about+Muhammad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"IndianChristian","files":3,"time":1214102760,"description":"Excellent booklets by some north indian muslim turned christian preacher.\nThere are 3 booklets not two.\n\nThanks to original uploader. \n\nuploaders comments:\n\nAt a time when hundreds of Christians are converting to Islam in the world (and of course that many muslims also leave islam every year to become christians inspite of Muhammads clear command to slaughter every muslim who leaves Islam - Sahih Bukhari 4.260) believing that Muhammad is the noblest men who walked the planet, this article comes as a shock for these Christians who have converted to Islam. It exposes exactly how holy was the founder of Islam? He certainly was no Jesus or Buddha. \n\nThe Bible says, My people are destroyed for lack of knowledge (Hosea 4:6). And there are scores of Christians converting to Islam due to their lack of knowledge of Islam. They are conned into believing that Islam is the true religion and Jesus Christ was not the Christ but a mere prophet and fore-bearer to Muhammad. \n\nThis article is an honest approach to expose this lie. The crux of Islam is Muhammad. If Muhammad was not a holy man then entire Islam vaporizes. And this is the case. The Islamic Sunnah describes in detail the nature of Muhammad and how he cannot be a Biblical prophet. Rashid Alamir in this article simply brings this fact to light. According to the Islamic Scriptures, Muhammad was not a prophet but a bandit, a thief and a rapist. Through he claimed to be Biblical prophet; he broke each and every of the Ten Commandments. Equally disturbing is the fact that Allah was willing to bend all the rules for his prophet even to the extent of revealing scripture to support Muhammads quest for thievery, rape, murder, incest, adultery and wealth. It is all given in detail in the Islamic Sunnah. You will come to know this only if you have read the books (not some arbitrary hadiths from these books but the actual books. When Muslims Imams quote hadiths they leave out the damaging part) comprising the Islamic Sunnah. \n\nPart 1 of the article it contains the following 4 sections:\n1. Was Muhammad really a prophet - An Introduction \n2. The Islamic Scriptures\n3. How the Quran was revealed - Is it similar to how the Bible was revealed?\n4. Muhammads suicide Attempts - Did our Biblical prophets do something similar when the angel of God conveyed Yahwehs message to them?\n\nPart 2 of the article contains the following 5 sections:\n1. Islam and the principle of Al-Takiyah\n2. The Tawhid - the oneness of Muhammad and Allah \n3. The Woman Muhammmad had\n4. Muhammads perverted Nature\n5. Muhammad, Champion of Womans rights?\n\nFor more articles by Rashid Alamir, Bible Tracts, Inspirational Christian literature, Christian comics and other Christian resources please visit\n","torrent":{"xt":"urn:btih:5152c26b8283a6b50d03919b22642248768855d6","amp;dn":"The+Truth+about+Muhammad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5152c26b8283a6b50d03919b22642248768855d6","infoHashBuffer":{"type":"Buffer","data":[81,82,194,107,130,131,166,181,13,3,145,155,34,100,34,72,118,136,85,214]},"announce":[],"urlList":[]}}