{"title":"Forensic Psychology: A Very Short Introduction","uid":8601456,"size":2109045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:518d03c012e17c515a39316bb73432165bda7971&amp;dn=Forensic+Psychology%3A+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"candymancan","files":1,"time":1371898131,"description":"\nLie detection, offender profiling, jury selection, insanity in the law, predicting the risk of re-offending , the minds of serial killers, and many other topics that fill news and fiction are all aspects of the rapidly developing area of scientific psychology broadly known as Forensic Psychology. This fascinating Very Short Introduction discusses all the aspects of psychology that are relevant to the legal and criminal process as a whole. It includes explanations of criminal behavior and criminality, including the role of mental disorder in crime, and it reveals how forensic psychology contributes to helping investigate the crime and catching the perpetrators. David Canter also explains how psychologists provide guidance to all those involved in civil and criminal court proceedings, including both the police and the accused, and what expert testimony can be provided by a psychologist about the offender at the trial. Finally, Canter describes how forensic psychology is used, particularly in prisons, to help in the management, treatment and rehabilitation of offenders, once they have been convicted.\n","torrent":{"xt":"urn:btih:518d03c012e17c515a39316bb73432165bda7971","amp;dn":"Forensic+Psychology%3A+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"518d03c012e17c515a39316bb73432165bda7971","infoHashBuffer":{"type":"Buffer","data":[81,141,3,192,18,225,124,81,90,57,49,107,183,52,50,22,91,218,121,113]},"announce":[],"urlList":[]}}