{"title":"Andreea Banica - Sexy (Tootie Master Edit)","uid":11376758,"size":991928652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:51b4864398e0f7a69daec9bd87d910ebf96f3387&amp;dn=Andreea+Banica+-+Sexy+%28Tootie+Master+Edit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CyberTootie","files":-1,"time":1415155996,"description":"Saying that &quot;I spent way too much time on this&quot; is probably an understatement...\n\nThis is the most gorgeous music video I have ever seen, picture quality-wise. The original suffered from stutter issues, which I took the time to fix, and was able to do so losslessly, contextually speaking.\n\nAndreea Banica\n&quot;Sexy&quot;\nMusic Video\nTootie Master Edit\nEditing by Tootie\n\nContainer: MKV\n\nVideo:\n1080p MJPEG (24.083 fps)\nSource:\nWhat was advertised as master copy of music video (Direct stream copy, see notes below)\n\nAudio Stream 1: &quot;Tootie Master Edit&quot; (Default)\nFLAC (1006kbps)\nSource: Juno Download WAV Download (Original stream with added silence for sync purposes)\n\nOverall average bitrate: 36.1 Mbps\n\n\nIt's apparent that this music video was filmed at 24fps or thereabouts, but was post-processed and mastered at 25fps. This caused the picture to stutter when filmed frames were used twice due to the difference in frame rates. For a while I thought it was the fact that the computer couldn't keep up with the bitrate, but after some investigation I found the source of the problem. I decided to try and fix the issue because I could losslessly work with the video at the frame level since the codec was MJPEG. At first I tried to remove what I'll call double-frames that were in the middle of shots and appending repeat frames of beginning and ending frames of shots to compensate. The result came out worse than the original. So I decided to try and just remove the offending double-frames and see if it could be decently resynced. It worked, and in fact the overall audio/video sync come out a tad bit better than the original.\n\nIt's important to note that the original audio/video sync consistency was horrible and that is still evident in this edit. After all this work though, there is a slight improvement.\n\nIt is also important to highlight what was done to the video: that distinct frames were removed from the video. There are parts of the video where post-processing movement is used and this tinkering becomes evident, but for most of the video, the only thing affected is the post-processing lighting effects which will not be noticeable during casual viewing of the video, if at all. I individually decided which of the double-frames to delete and chose the one that made the edit less noticeable. There is also at least one spot where film double-frames were not removed due to post-processing effects being the predominant part of the shot, such as the opening title transition","torrent":{"xt":"urn:btih:51b4864398e0f7a69daec9bd87d910ebf96f3387","amp;dn":"Andreea+Banica+-+Sexy+%28Tootie+Master+Edit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51b4864398e0f7a69daec9bd87d910ebf96f3387","infoHashBuffer":{"type":"Buffer","data":[81,180,134,67,152,224,247,166,157,174,201,189,135,217,16,235,249,111,51,135]},"announce":[],"urlList":[]}}