{"title":"Chris Carter - The Night Stalker(mobi)","uid":6729847,"size":649192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52c7a6a410e83b1e043831a6b9413d65fa582971&amp;dn=Chris+Carter+-+The+Night+Stalker%28mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".StoneX.","files":-1,"time":1318090683,"description":"An unidentified female body is brought into the Los Angeles County morgue. The cause of death is still unclear. Her body bares no marks; except for the fact that her most intimate parts have been stitched shut. But what shocks the pathologist the most is that the killer had left something inside her. Something so monstrous Detective Robert Hunter, of the Los Angeles Homicide Special Section, has to be pulled off a different case to take over the investigation.\nWithin days a new body surfaces. Like the previous victim, she's also been stitched shut and something has been left inside her. Something as ingenious as it is grotesque. And the killer isn't done yet, not by a long shot.\nWhen his inquiry collides with a missing persons' case being investigated by the attractive, razor-sharp Whitney Meyers, Hunter suspects the killer might be keeping several women hostage. Soon Robert finds himself on the hunt for a murderer who is much more monstrous than he ever could have expected; a predator whose past hides a terrible secret, and who won't stop until each of his victims has brought forth the awful truth that lies hidden deep inside them too.\nProduct Details\n\n    * Format: Kindle Edition\n    * File Size: 633 KB\n    * Publisher: Simon &amp; Schuster UK (August 18, 2011)","torrent":{"xt":"urn:btih:52c7a6a410e83b1e043831a6b9413d65fa582971","amp;dn":"Chris+Carter+-+The+Night+Stalker%28mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52c7a6a410e83b1e043831a6b9413d65fa582971","infoHashBuffer":{"type":"Buffer","data":[82,199,166,164,16,232,59,30,4,56,49,166,185,65,61,101,250,88,41,113]},"announce":[],"urlList":[]}}