{"title":"Alive Video Converter v 3.2-serial incl","uid":4604015,"size":6761651,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:52d41fe97f9dac6bdc3a7dec72a91beff63032f2&amp;dn=Alive+Video+Converter+v+3.2-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmb2012","files":2,"time":1230394830,"description":"Alive Video Converter is an all-in-one video converter software to convert video files from one format to another, and extract audio tracks from video. It allows you to convert all popular video formats including AVI, DivX, XviD, MPEG, WMV, MOV, ASF, QuickTime, MP4, 3GP, 3G2, MOD, FLV, dvr-ms, VOB to iPod, PSP, Zune, mobile 3GP and 3G2, you can also convert the above video formats to AVI, DivX, XviD, DVD, SVCD, VCD, MPEG-1, MPEG-2, WMV, ASF, VOB, MOV formats. With the very easy to use interface you can also extract audio tracks from video files to MP3, AC3, AAC, M4A audio formats. \n\nAlive Video Converter includes functions of iPod Video Converter, PSP Video Converter, Zune Video Converter, MP4 Converter and 3GP Video Converter. This PSP, 3GP, Zune, iPod, MP4 video converter that lets you enjoy all your popular video files on Sony PSP, mobile phone, Zune Player, video iPod and other MP4 partable devices.\n \t \n\n\nAlive Video Converter integrated with Windows Explorer is very simple and easy to use. Just right-click on video files in Windows Explorer, select Convert to AVI (or MPEG-1, MPEG-2, MP4, 3GP, etc), and convert them using your predefined settings. \n\nIn addition, The intuitive interface makes Alive Video Converter the perfect tool for both new and experienced users. It gives advanced users the ability to finish the conversion with command line or schedule in batches, and supports drag-drop to load or add video files, conversion with bitrate adjusting and width*height adjusting, and full conversion options and more!\n\n\nAll-in-one video tool:\nPSP Video Converter\nConvert video to PSP for playing on Sony PSP.\niPod Video Converter\nConvert video to iPod for enjoying your video on Apple iPod.\n3GP Converter\nConvert video to mobile 3GP and 3G2.\nZune Video Converter\nConvert video to Zune which can be played on Microsoft Zune Player.\nMP4 Converter\nConvert video to MP4 format.\nAVI/MPEG Converter\nConvert various video to AVI, MPEG format, including MPEG-1, MPEG-2, VCD/SVCD/DVD format.\nMOV Converter\nThis is a mov converter as well. It can convert your mov to DivX, XviD, AVI, MPEG, WMV format, or extract the audio from mov, and save as MP3 format.\nWMV Converter\nConvert WMV to other formats, such as MPEG, AVI, DivX, XviD, etc. You can also convert various video to WMV video format, or convert your wmv to MP3 format, which can be played on your MP3 player.\nVideo to MP3 Converter\nConvert DivX, XviD, WMV, ASF, MPEG-1, MPEG-2, MOV, MOD, RM, RMVB, or AVI to MP3 audio format directly.\nDivX/XviD Converter\nConvert your video to DivX, XviD format. Alive Video Converter can convert xvid to wmv, mpeg or other video formats.\nFLV Converter, Flash Converter\nConvert .flv to avi, mpeg, mp4, wmv, divx, xvid, 3gp, ipod, psp, or other formats\n\n\n\nConvert video to iPod video, PSP video, Zune, 3GP and 3G2 for sharing your video on partable devices.\nConvert video to VCD/DVD/SVCD compatible mpeg file;\nConvert AVI, DivX, XviD, MPEG-1, MPEG-2, WMV, ASF, MOV, VOB, MP4, FLV, dvr-ms files;\nExtract audio tracks from video to MP3, AAC, AC3, M4A files;\nSupport all popular video formats;\nSupport H.264 MPEG-4 AVC video format for PSP;\nSupport DivX, XviD avi format; \nSupport MPEG1, MPEG2, MS MPEG4 video format; \nConverting in batches with Alive Video Converter;\nSupport command line;\nIt is very simple and easy to use. Just right click on files in the Windows Explorer, select &quot;Convert to AVI&quot;(or MPEG, WMV, MP4, MP3, etc) and convert them using your predefined settings;\nSchedule converting supported by Alive Video Converter;\nSupport drag-drop to load video files;\nHigh converting speed, wonderful output quality.\n\nNew features of Alive Video Converter v 3.2: \nAdd supporting MP4 format.\nAdd supporting 3GP, 3G2 mobile format.\nAdd supporting PSP video format.\nAdd supporting iPod video format.\nAdd supporting Zune video format.\nAdd supporting H.264/PSP AVC and H.264/MPEG-4 AVC format.\nAdd supporting FLV, Microsoft Recorded TV Show (*.dvr-ms) format.\nSupport AC3, AAC and M4A MPEG-4 audio format.\nLet you convert video to MOV, VOB, ASF format.\nImprove encoding/decoding engine, and provide extreme converting speed.\nWindows Vista supported.\n\nSoftware Requirement: \n\nSoftware: Alive Video Converter runs on PC (Microsoft Windows 98/ME/NT/2000/XP/2003/Vista) to convert most popular video files including xvid, divx, avi, mpeg, mov, wmv, asf, vob, mp4, 3gp, 3g2. \n\nHardware: 64M RAM or more, 366 MHz or higher Intel or AMD CPU, \n","torrent":{"xt":"urn:btih:52d41fe97f9dac6bdc3a7dec72a91beff63032f2","amp;dn":"Alive+Video+Converter+v+3.2-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52d41fe97f9dac6bdc3a7dec72a91beff63032f2","infoHashBuffer":{"type":"Buffer","data":[82,212,31,233,127,157,172,107,220,58,125,236,114,169,27,239,246,48,50,242]},"announce":[],"urlList":[]}}