{"title":"Donald Byrd - Free Form (1961) [Jazz][mp3 320][schon55]","uid":5140084,"size":108348202,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:52e3e99940101c57be0ec6bd70700d3e41d19872&amp;dn=Donald+Byrd+-+Free+Form+%281961%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":15,"time":1256840001,"description":"Donald Byrd - Free Form \nYear: 1961\nLabel: Blue Note (1989)\nTotal time: 44:35\nQuality: 320 kbps\n\nDonald Byrd's 1961 recording Free Form is both a smorgasbord of modern jazz styles and a breakthrough album showing the Detroit born trumpeter's versatility and interest in diversity.  At age 30, turning down offers to teach and a full decade before turning to commercial funk fusion with his Blackbyrds, Byrd, alongside a wonderful collection of jazz professionals, proves his mettle as an individualist while also stylistically straddling the blurred lines of jazz.  Where his brass tone is very lean and toned, he does not resort to outlandish outbursts into the ionosphere, but shows a refined yet daring approach removed from his predecessors or peers -- Clifford Brown and Lee Morgan in particular.  With tenor saxophonist Wayne Shorter, a very young pianist Herbie Hancock, drummer Billy Higgins, and bassist Butch Warren, Byrd tackles different flavors of jazz with a voracious appetite, and delivers a very fresh perspective from them all.  From Column A -- soul junction -- &quot;Pentecostal Feelin'&quot; comes straight from the Horace Silver bag, an original funk with Shorter, Hancock, and Higgins head noddin' to the band.  Column B's &quot;Nai Nai&quot; is all straight-ahead hard bop, lighter but not wimpy as Byrd and Shorter play well together.  The more modal &quot;French Spice&quot; is still in the hard-to-post-bop mold, but has a two-note base until the horns burst out with a rich melody.  The title track spectacularly represents the so-called &quot;new thing,&quot; a tone row-based, searching, or clarion-type spontaneous improvisation where the band is purposefully set apart from the inventive drumming of Higgins in a firmly non-established meter.  Romance is also on the menu via the no frills ballad &quot;Night Flower&quot; as Byrd serenely leads the band into a curtain-closing venture into tenderness, with Hancock's underlying chords something to truly behold upon close listening.  This may be close to Donald Byrd's best early work, a strong statement that is by no means homogeneous, but expresses many of the avenues in jazz he was exploring while finding his own unique voice on the trumpet.  ~ Michael G.  Nastos, AMG\n\nPersonnel:\nDonald Byrd (Trumpet) \nWayne Shorter (Tenor Saxophone) \nHerbie Hancock (Piano) \nButch Warren (Double Bass) \nBilly Higgins (Drums) \n\nDonald Byrd - Free Form Tracks:\n01  Pentacostal Feelin' (Donald Byrd) 6:43 \n02  Night Flower (Donald Byrd) 6:48 \n03  Nai Nai (Donald Byrd) 6:38 \n04  French Spice (Donald Byrd) 8:03 \n05  Free Form (Donald Byrd) 11:12 \n06  Three Wishes (Herbie Hancock) 5:11","torrent":{"xt":"urn:btih:52e3e99940101c57be0ec6bd70700d3e41d19872","amp;dn":"Donald+Byrd+-+Free+Form+%281961%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52e3e99940101c57be0ec6bd70700d3e41d19872","infoHashBuffer":{"type":"Buffer","data":[82,227,233,153,64,16,28,87,190,14,198,189,112,112,13,62,65,209,152,114]},"announce":[],"urlList":[]}}