{"title":"immortals of meluha ( by amish tripathi) full pdf","uid":8406135,"size":1875671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5328327986380565b4bd72deb6815f53ca089b8f&amp;dn=immortals+of+meluha+%28+by+amish+tripathi%29+full+pdf+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"freakmj","files":1,"time":1366811950,"description":"The Immortals of Meluha is the first novel of the Shiva trilogy series by Amish Tripathi. The story is set in the land of Meluha and starts with the arrival of the Tibetan tribal Shiva. The Meluhan belief that Shiva is their fabled saviour Neelkanth, is confirmed when he consumes the Somras, a legendary healing potion, which turns his throat blue. Shiva decides to help the Meluhans in their war against the Chandravanshis, who had joined forces with a cursed group called Nagas. However, in his journey and the resulting fight that ensues, Shiva learns how his choices  actually reflected who he aspires to be and how it led to dire consequences.\n           Ultimately, when the book was published in February 2010, it went on to become a huge commercial success. It had to be reprinted a number of times to keep up with the demand. Tripathi even changed his publisher and hosted a big launch for the book in Delhi. It was critically appreciated by some Indian reviewers, others noted that Tripathi's writing tended to lose focus at some parts of the story. As of January 2013, The Immortals of Meluha, and its sequel, The Secret of the Nagas, have crossed a print run of a million copies. These books have continued to top the bestseller lists of Nielsen BookScan, with the gross retail sales being impressive at 22 crore within two years of publishing. The third installment, titled The Oath of the Vayuputras, was released on 27 February 2013. The Shiva Trilogy has become the fastest selling book series in the history of Indian publishing, with 1.5 million copies in print and over 40 crores in sales&quot;.\n      --------- BY mjfreak--------\nhey guys !!\nthis is your friend MJ . always uploading the best and free content to download from Torrent sites.\nNow he is askin for a little favour you all can do !\nPlz like mypage for the best , funniest and most relatable trolls, memes and pics\nPlease also check out my blog for more free PDFs, hacking material , day to day needs and other awesome things !\nPLEASE DO SUPPORT !! \nTHANKS IN ADVANCE :) :D\n","torrent":{"xt":"urn:btih:5328327986380565b4bd72deb6815f53ca089b8f","amp;dn":"immortals+of+meluha+%28+by+amish+tripathi%29+full+pdf+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5328327986380565b4bd72deb6815f53ca089b8f","infoHashBuffer":{"type":"Buffer","data":[83,40,50,121,134,56,5,101,180,189,114,222,182,129,95,83,202,8,155,143]},"announce":[],"urlList":[]}}