{"title":"Disney's Hercules (French) by Desesperado","uid":3749236,"size":243200475,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:542bbe95b1d4c701f3874dbd102d1cf947e952b5&amp;dn=Disney%5C%27s+Hercules+%28French%29+by+Desesperado&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"desesperado","files":2,"time":1185102173,"description":" &lt;a href=&quot;http://uk.psx.ign.com/articles/152/152045p1.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://uk.psx.ign.com/articles/152/152045p1.html&lt;/a&gt;\n\n\n\n\n\nHercules was a delightful romp through the Greek myths, and while the animation was beautifully done, the story was a little too much like previous Disney efforts. The same can be said about Disney&amp;#039;s Hercules, the new action game based on the movie. Sure it looks pretty good, but we&amp;#039;ve seen it all before, and on less powerful hardware.\n\nThe game follows the plot of the film fairly closely, with voice overs from James Woods (Hades) and Danny DeVito (Phil), among others. Gameplay is confined mostly to walking left or right, and hacking at enemies with your sword. You also have a regular punch that isn&amp;#039;t nearly as effective, and a super punch that takes time to wind up, but delivers a mighty blow.\n\nBackgrounds are a blend of sprites and polygons, and to the developer&amp;#039;s credit, the game does look like the movie. However, some of the faux-3D elements don&amp;#039;t work as well as they should, as hitting an enemy that&amp;#039;s flying in and out of the screen is haphazard at best. Indeed, much of the game feels like it was set up this way, with almost random placing of enemies and obstacles. It&amp;#039;s more tedious than challenging.\n\nControl is decent enough, although on levels like the Crash Bandicoot-like Gauntlet, where Herc runs into the screen, control is maddeningly sluggish. This may have been done to up the difficulty level, but all it does is aggravate the player.\n\nIf this game had come out on the Genesis four years ago, it would have been revolutionary. As it is, we&amp;#039;d rather just play Aladdin.\n\n","torrent":{"xt":"urn:btih:542bbe95b1d4c701f3874dbd102d1cf947e952b5","amp;dn":"Disney%5C%27s+Hercules+%28French%29+by+Desesperado","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"542bbe95b1d4c701f3874dbd102d1cf947e952b5","infoHashBuffer":{"type":"Buffer","data":[84,43,190,149,177,212,199,1,243,135,77,189,16,45,28,249,71,233,82,181]},"announce":[],"urlList":[]}}