{"title":"David Cooper - God Is a Verb: Kabbalah, Mystical Judaism (pdf)","uid":8354672,"size":4000287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5447d0b4d8a74d660ea7010cb3b2cbf59cf368bd&amp;dn=David+Cooper+-+God+Is+a+Verb%3A+Kabbalah%2C+Mystical+Judaism+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1365455122,"description":"Rabbi David A. Cooper - God Is a Verb: Kabbalah and the Practice of Mystical Judaism (Berkley, 1997). 334 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nIntroductory book on Jewish kabbalah emphasizing its accessibility to contemporary spiritual seekers, regardless of religious background. \n\ndescription:\n\nSince medieval times, the mystical tradition of Kabbalah was restricted to qualified men over forty - because it was believed that only the most mature and pious could grasp its complexity and profound, life-changing implications. More recently, Kabbalah nearly disappeared - as most of its practitioners perished in the Holocaust. In the national bestseller God Is a Verb, this powerful spiritual tradition, after centuries of secrecy and near-extinction, is explained clearly by one of its most prominent teachers.\n\nWho are we? Where did we come from? Where are we going? How do we get there? These questions have fueled Kabbalists for nearly a millennium. Rabbi David A. Cooper is the first to bring this obscure and difficult tradition to a mainstream audience in a way that gently leads us to the heart of the subject, showing us how to transform profound teachings into a meaningful personal experience - and appreciate fully this great mystical process we know as God.\n\nReview\n\n&quot;Rabbi Cooper opens wide the centuries-old treasure house of the Jewish tradition. This is a wise book...broad and accessible. It's one of those books that people will read a lot over the years&quot; - Jack Kornfield, bestselling author of A Path with Heart\n\n&quot;David Cooper's rich wisdom and practical exercises bring Judaism alive in an exciting new way.&quot; - Joan Borysenko, Ph.D., author of A Woman's Book of Life\n\n&quot;Offers insight into the everyday practice of mystical Judaism...lively prose...a rewarding book.&quot; - Publishers Weekly\n\n&quot;A superb, sensitive, and gentle guide.&quot; - Ram Dass, author of Be Here Now\n\nAbout the Author\n\nRabbi David A. Cooper studied mystical Judaism in Jerusalem's Old City for more than eight years, and has authored several books on meditation, spiritual retreats, and Jewish mystical practice. He also recorded the bestselling audiotape series The Mystical Kabbalah, and along with his wife, Shoshana, directs the Heart of Stillness Hermitage near Boulder, Colorado.\n\nFor another excellent introduction to kabbalah, see this:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8233033/Herbert_Weiner_-_9_1_2_Mystics__The_Kabbala_Today_(pdf)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8233033/Herbert_Weiner_-_9_1_2_Mystics__The_Kabbala_Today_(pdf)&lt;/a&gt;","torrent":{"xt":"urn:btih:5447d0b4d8a74d660ea7010cb3b2cbf59cf368bd","amp;dn":"David+Cooper+-+God+Is+a+Verb%3A+Kabbalah%2C+Mystical+Judaism+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5447d0b4d8a74d660ea7010cb3b2cbf59cf368bd","infoHashBuffer":{"type":"Buffer","data":[84,71,208,180,216,167,77,102,14,167,1,12,179,178,203,245,156,243,104,189]},"announce":[],"urlList":[]}}