{"title":"Need For Speed Most Wanted Portable - [Espera]","uid":6410865,"size":2140334249,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5568639062728141e7fdf518b4b7c807a553e446&amp;dn=Need+For+Speed+Most+Wanted+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JacopoX","files":2,"time":1305969621,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Need For Speed Most Wanted 1 Click.exe&quot;\n3.Enjoy\n\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nNeed for Speed: Most Wanted (commonly abbreviated to as NFS: MW) is a racing video game, developed by EA Black Box game's street racing-oriented game play, with certain (but not all) customization options from the Need for Speed: Underground series. The game is succeeded by Need for Speed: Carbon, which serves as a sequel to Most Wanted, and later Need for Speed: World, which features both the cities of Rockport and Palmont, making that game a successor to both Most Wanted and Carbon. Most Wanted was a commercial success; it sold nearly 6 million copies worldwide.\n\nMost Wanted has been released for Windows-based personal computers, the PlayStation 2, PlayStation Portable, Nintendo GameCube, Xbox, Xbox 360 (as a launch title), Game Boy Advance, Nintendo DS and mobile phones. Another version of Most Wanted, titled Need for Speed: Most Wanted: 5-1-0 has been released for the PlayStation Portable. This is the first game in the Need for Speed series to be rated T (even though the European version is Still Rated 3+).\n\nNeed for Speed: Most Wanted 'Black Edition', a collector's edition of Most Wanted, was released in celebration of the Need for Speed series' 10th anniversary and in conjunction with the release of Most Wanted. The Black Edition features additional races, bonus cars and other additional content. The Black Edition also comes with a special feature DVD that contains interviews and videos about the game. The Black Edition was released for Microsoft Windows, PlayStation 2 and Xbox in the United States and Australia;[1] only the PlayStation 2 version of Black Edition was released additionally for Europe.\n\nSystem requirements\n\nMicrosoft Windows\n\n    Windows 2000 or better\n    1.4 GHz CPU\n    256 MB RAM\n    3 GB hard disk space,\n    DirectX 9.0c compatible 32 MB video card with one of these chipsets Radeon 7500; Radeon Xpress 200; GeForce 2 MX; Intel 915; S3 GammaChrome S18 Pro\n    DirectX 9.0c compatible sound card\n\n","torrent":{"xt":"urn:btih:5568639062728141e7fdf518b4b7c807a553e446","amp;dn":"Need+For+Speed+Most+Wanted+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5568639062728141e7fdf518b4b7c807a553e446","infoHashBuffer":{"type":"Buffer","data":[85,104,99,144,98,114,129,65,231,253,245,24,180,183,200,7,165,83,228,70]},"announce":[],"urlList":[]}}