{"title":"A Summer of Sundays - Lindsay Eland.epub","uid":9368946,"size":3575888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55b3e7e49f24e77e43956fb8c2516ea5cf012385&amp;dn=A+Summer+of+Sundays+-+Lindsay+Eland.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387484738,"description":"Fans of The Mother Daughter Book Club (Heather Vogel Fredericks) and The Wedding Planner's Daughter (Coleen Paratore) series will fall in love with the humor, classic charm, and very determined heronine of Lindsay Eland's sophomore novel.\n\nWhen you're the third of six kids, it's easy to get lost in the shuffle, but Sunday Fowler is determined that this summer she'll find the one thing that makes her stand out from her siblings.\n\nAnd when she discovers a silver box in the basement of the library her parents are renovating, she might just have found something to gain her the attention she so craves. Inside is a series of letters addressed to &quot;The Librarian&quot; and a manuscript. But who wrote them? With the help of annoying neighbor-turned-new-friend Jude, Sunday is determined to track down the author. And when she unveils this novel to the world, she'll be famous!\n\nBut uncovering this manuscript means stirring up secrets that some people in the town hoped to keep buried. And Sunday must decide if some things -- loyalty, trust, friendship -- are worth more than her name in the headlines.","torrent":{"xt":"urn:btih:55b3e7e49f24e77e43956fb8c2516ea5cf012385","amp;dn":"A+Summer+of+Sundays+-+Lindsay+Eland.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55b3e7e49f24e77e43956fb8c2516ea5cf012385","infoHashBuffer":{"type":"Buffer","data":[85,179,231,228,159,36,231,126,67,149,111,184,194,81,110,165,207,1,35,133]},"announce":[],"urlList":[]}}