{"title":"Final Crisis Aftermath","uid":5160818,"size":576364551,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:56ed775686cd3e1c1763f972df45bed02274a62e&amp;dn=Final+Crisis+Aftermath&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ParrowJack","files":24,"time":1258134773,"description":"Collection of all four Final Crisis Aftermath titles.\n\n\n\nFinal Crisis Aftermath - Dance\nJapan's Super Young Team just wants to be seen as heroes by their adoring public.  Unfortunately, their part in Final Crisis went unnoticed, and they've been reduced to performing at public appearances and on TV.  Now, intense media scrutiny and a deadly threat complicates the motives of the team.\nWritten by Joe Casey, with art by ChrisCross.\n\n\nFinal Crisis Aftermath - Escape\nThomas Andrew Tresser, aka Nemesis, is kidnapped by a mysterious unknown force.  He has one thing on his mind, Escape!\nwritten by Ivan Brandon, with art by Marco Rudy.\n\n\nFinal Crisis Aftermath: Ink\nThis mini-series follows Mark Richards, The Tattooed Man, as he comes to grips with his new role as a hero and card-carrying ally of the Justice League. However, despite The T-Man's heroic role in helping to avert the recent Crisis, the cops in his crime-ridden hometown city of Liberty Hill are a little hesitant to look past his history as a villain. To make matters worse, his troubled son is caught up in a violent gang war.\nWritten by Eric Wallace, with art by Fabrizio Fiorentino.\n\n\nFinal Crisis Aftermath: Run\nThe Human Flame is a dead man. The heroes of the DC Universe have targeted him as the lowlife who caught the murder of the Martian Manhunter on his cell phone. On top of that, the villains want to kill him for selling them out to Libra.\nWritten by Matthew Sturges and illustrated by Freddie E. Williams II.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:56ed775686cd3e1c1763f972df45bed02274a62e","amp;dn":"Final+Crisis+Aftermath","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56ed775686cd3e1c1763f972df45bed02274a62e","infoHashBuffer":{"type":"Buffer","data":[86,237,119,86,134,205,62,28,23,99,249,114,223,69,190,208,34,116,166,46]},"announce":[],"urlList":[]}}