{"title":"Glory Hole Girlz #3 [DVDRip]","uid":10715506,"size":731959296,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:579ec2e02641dc6e9f42f94462e16a8a40a1aa4e&amp;dn=Glory+Hole+Girlz+%233+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1407404557,"description":"Glory Hole Girlz #3 [DVDRip]\n\nToni (F), Carmen, Sonja, Paris, Jackie\n\nDirty D corrupts these girls by taking them to a seedy adult bookstore. Each girl sucks off multiple strangers in a sticky floored jack shack. Watch them accept each and every cock into their mouth with unbiased excitement and intense attention!! These babes are cock gobbling machines, so give them what makes them happy!\nParis begged Dirty D to experience the infamous Glory Hole first hand. She is an oral freak that loves sucking dicks to get her groove on. Once in the booth, Paris quickly unleashes her huge melons and drops to her knees to get busy. This girl has a tongue ring and knows how to use it! Watch Paris milk each anonymous cock dry\nCarmen is six months pregnant! Her raging hormones make her very horny and hungry! The gloryhole is the perfect place to satisfy all of her cravings. She is eating for two and it shows. Watch as she gobbles up loads of hot fresh man milk. Dirty D is is doing his part to promote healthy babies with high quality protein!\nSonja is a crazy wild little Latina freak that Dirty D met at the taco shack. She REALLY has a taste for white boy burrito and salsa. Listen to her gag while she chokes down each hard cock. Sonja tries shove so much cock down her throat that she bangs her head against the wall. It's amazing that she manages to keep her lunch down while bouncing cocks off her tonsils.\nJackie is a wild three hole slut with an insatiable appetite for cock. I take her to the gloryhole to for a cock suck off. Once in the booth Jackie quickly strips naked, drops to her knees and goes right to sucking dick. After sucking two cocks Jackie is wet and ready to fuck. She backs her pussy up to the hole and lets a stranger pound it. He shoots his hot load in and all over her pussy. Jackie lets the next guy tag her pussy and ass. That lucky pervert shoots a large load in her ass that drips out.\nToni is a sexy teen spinner. She told Dirty D how much she likes porn and sucking cock. Dirty D asked her to be everyone's Valentine. Once in the booth Toni quickly strips naked exposing her all natural perky tits and shaved pussy. She gets down on her knees sticks two fingers through the hole and it is on. Toni goes at sucking off these strangers with a mad fervor. Watch Toni drains these horny perverts balls dry!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=rcmjo3pwgwcaorz6vupc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=rcmjo3pwgwcaorz6vupc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=p8ui7p1icb12x8k3uuer.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=p8ui7p1icb12x8k3uuer.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:579ec2e02641dc6e9f42f94462e16a8a40a1aa4e","amp;dn":"Glory+Hole+Girlz+%233+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"579ec2e02641dc6e9f42f94462e16a8a40a1aa4e","infoHashBuffer":{"type":"Buffer","data":[87,158,194,224,38,65,220,110,159,66,249,68,98,225,106,138,64,161,170,78]},"announce":[],"urlList":[]}}