{"title":"Invisible, Inc. (Incognita) v15.10.2014","uid":11228785,"size":233516006,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:586dcb1cb3428f5c1303e587f386d39719d69822&amp;dn=Invisible%2C+Inc.+%28Incognita%29+v15.10.2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1413492229,"description":"Klei Entertainment, the creators of Don't Starve and Mark of the Ninja\npresent Invisible, Inc. (previously known as Incognita)\n\n&quot;Invisible, Inc. is a mercenary espionage agency operating in the late 21st century. Infiltrate procedurally generated corporate facilities in tense, turn-based missions where every move could be your last. Find profit in chaos as you guide your team around the world in search of lucrative contracts.&quot;\n\nChangelog:\nv15.10.2014 (Early Access Update 4: Live Assets):\nNew Features\n- 2 new Agents to unlock at the team selection screen\n- New Cybernetics Lab location\n- Monst3r will buy items in the agency's stash as well as sometimes have trinkets to sell.\n- Incognita's programs can be sold at Server Farms\n- Agent Information panel available in mission (click on their animated profile image)\n- A new throw-able item.\n- Add speech animation to guard HUD displays.\n- Added manual camera control option to Gameplay options. This prevents *all* automatic camera panning.\n- Accelerator Chip bonuses now stack with the hacking bonus.\n- Removing Valuable Tech from a scanner will disable it permanently.\nBalance Changes\n- Stealth, Hacking and Anarchy skills have been reevaluated, also given a fifth upgrade level.\n- Agents' special abilities are now provided by unique augments. ( Shalem ends up with +2 armor piercing to start)\n- Parasite loses cool down and gains increasing cost with active parasites.\n- The artifact heavy vault has been adjusted.\n- The Executive is planning a big night out and has more cash on hand.\n- Programs are now only found at Server Farm Terminals but there are more programs available at each terminal.\n- EDIT * Agents do not get extra equipment after being rescued, but start with their unique augment.\n- EDIT * Prisoner has 8 AP.\nBug Fixes\n- UI buttons don't 'click' without actually receiving a mouse-down event\n- Window resizing is aspect ratio constrained on Windows.\n- Unlockable images are correctly blacked out when viewing the Score screen.\n- Fixed certain tiles being incorrectly identified as seen or unseen for LOS calculations.\n- Fixed game data hash validation for OSX.\n- Fix possible crash when using data blast on a non-existent location.\n- Fix some mission dialogues being incorrectly reshown when loading a save game.\n- Fix most (all?) instances of guard instant-shooting after overwatch on the same turn.\n- Revert observe ability to original behavior, so that the agent observing must be in LOS (or have control of a camera with LOS)\n- Fixed inputting of symbol characters on OSX.\n- Fix possible crash when checking PC distance from interrogated guards.\n- When reloading from a save game with an error, the level will load from the last successful action rather than the beginning.\n- Fix possible crash when using Shade.\n- Fix misaligned text cursor when editing an empty edit box.\n- Knocked-out prisoners are draggable.\n- Usability improvements when using the accelerator chip.\n- Game Over will only occur when all units are dead and/or pinned, instead of simply KO'd.\n- The Captain is no longer always KO'd for 6 turns.\n- Fixed a bug where special guards could lose their impass status.\n- Fixed agents sometimes going invisible when using overwatch.\n- Fixed doubling-effect when employing both Parasite I and II at the same time.\n- Turrets now count as cover against guards.\nv02.10.2014:\n- Fixed the board room table prop\n- Fixed animation bug with female agents\n- Fixed a corp turn lock up bug\n- Fixed a shut down bug\n- A number of fixes to reduce the occurrences of the guard overwatch instant shooting.\n\nIf you like the game, support the developer, buy it!       &lt;a href=&quot;\nhttps://www.humblebundle.com/store/p/invisibleinc_storefront&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.humblebundle.com/store/p/invisibleinc_storefront&lt;/a&gt;       &lt;a href=&quot;\nhttp://store.steampowered.com/app/243970/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/243970/&lt;/a&gt;","torrent":{"xt":"urn:btih:586dcb1cb3428f5c1303e587f386d39719d69822","amp;dn":"Invisible%2C+Inc.+%28Incognita%29+v15.10.2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"586dcb1cb3428f5c1303e587f386d39719d69822","infoHashBuffer":{"type":"Buffer","data":[88,109,203,28,179,66,143,92,19,3,229,135,243,134,211,151,25,214,152,34]},"announce":[],"urlList":[]}}