{"title":"The Guns of Navarone (1961)","uid":4918127,"size":1466930713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5882e66b59fe9e4de87c78c26fc38e4bb5601604&amp;dn=The+Guns+of+Navarone+%281961%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fanebabanu","files":3,"time":1243528987,"description":"The Guns of Navarone (1961)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0054953/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0054953/&lt;/a&gt;\n\nAn impregnable fortress... An invincible army... and the unstoppable commando team.\n\nTwo powerful German guns control the seas past the Greek island of Navarone making the evacuation of endangered British troops on a neighboring island impossible. Air attack is useless so a team of six Allied and Greek soldiers is put ashore to meet up with partisans to try and dynamite the guns. The mission is perilous enough anyway but are the Germans on the island getting further help too?\n\n1943. With the battle of Stalingrad turning the war against them, the Germans are attempting to bully neutral Turkey into joining the Axis; to this end they have trapped 2,000 British soldiers on Kiros, an island in the Aegean, with only one sea route for evacuation, a sea route commanded by two gigantic German antiship batteries deployed in a massive cliffside bunker on the island of Navarone. Immune to air attack and too much for Allied battleships to suppress, the British muster Keith Mallory, a commando officer who has been working on occupied Crete for nearly two years and who is an expert mountaineer, to ferry a team of British commandos to the only area of Navarone that is not monitored by the Germans, a 400-foot cliff. Greek resistance is to meet the team inland and guide them around German patrols to the area of the German guns. However, the commanding officer of the British team suffers grave injury in the climb and Mallory must take control of the mission, despite clashes with explosives expert John Anthony Miller, who upon the arrival of the night of the raid finds his equipment has been sabotaged, thus exposing a traitor in the team's ranks.","torrent":{"xt":"urn:btih:5882e66b59fe9e4de87c78c26fc38e4bb5601604","amp;dn":"The+Guns+of+Navarone+%281961%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5882e66b59fe9e4de87c78c26fc38e4bb5601604","infoHashBuffer":{"type":"Buffer","data":[88,130,230,107,89,254,158,77,232,124,120,194,111,195,142,75,181,96,22,4]},"announce":[],"urlList":[]}}