{"title":"Xilisoft Video Editor V1.0.34.1030 Incl serial","uid":5143921,"size":16164678,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:591a169e44068c0a12ec2a52ea329dba2dcebea5&amp;dn=Xilisoft+Video+Editor+V1.0.34.1030+Incl+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ProDvDRipper","files":1,"time":1257107663,"description":"No need to be worried about formats, frame rate or file sizes, the functions of video join, split and cut can be easily achieved by Xilisoft Video Editor. The video editing software allows you to edit video files in various formats like AVI, MPEG, H.264, SWF, MOV, WMV, etc. for playback on popular devices like iPod, iPhone, PSP, PS3, and so on. The three processes, video join, split and cut, can run in background without too much space occupation.\n\nAs a video joiner, splitter and cutter, Xilisoft Video Editor has an intuitive interface and makes it easy to turn original videos into works of art. And also you can watch the video in the preview window. Xilisoft Video Editor is well worthy of having a try.\n\n* Join multiple videos and combine them into one\n* Split one video into several segments\n* Cut off the unwanted segments of your video\n\n\nHandy video editing settings serve your video edit\n# Format choice in joiner\nYou can join many videos in different formats at one time and the format of output file will be one of the input formats.\n# Preferences in joiner\nXilisoft Video Editor allows you to set frame rate, bit rate, and resolution to get the best effect.\n# Manual or auto split\nSplit manually by dragging the slider to locate the split point. Or split automatically by setting split time or file size, or averagely.\n# Choose desired clips to output\nCut off any clips you want and they will be shown in list. If you are not satisfied with some clips, you can directly delete them in the list and output the desired clips as a one.\n\nVarious output parameters\n# Various parameters\nThe comprehensive video editing software provides many detailed parameters including frame rate, video bit rate, and resolution. By setting them, you will get expectant effects in a short time.\n# Support preview\nThe video edit software supports previewing the source video and target file. If necessary, you can adjust the sequence of output video file.\n\nRun Xilisoft Video Editor in background\n* Run in background\nYou can run the video editing software in background when cutting, splitting or joining video to possess less space.\n* After done action\nXilisoft Video Editor can automatically shut down or do other actions when the cutting, splitting or joining is finished.\n* Preview video\nThe video editor provides large preview window for you to preview the original and the output file.\n* Multiple languages and skins\nThe video editing software supports two pretty skins and multiple languages including: English, German, Japanese and Chinese.\n\nReferences\nInput File Format Support\nVideo: AVI, MPEG, MPG, MPEG-1, MPEG-2, MPEG-4, WMV, MP4, MOV, VOB, ASF, 3GP, 3G2, SWF, H.264, QT, DAT\n\nOutput File Format Support\nVideo: AVI, MPEG, MPG, MPEG-1, MPEG-2, MPEG-4, WMV, MP4, MOV, VOB, ASF, 3GP, 3G2, SWF, H.264, QT, DAT\n\nSystem Requirements\nOS: MicrosoftÃ‚Â® Windows XP (SP2 or later), Windows Vista\nProcessor: 1GHz Intel/AMD processor or above\nRAM: 256MB RAM (512MB or above recommended)\nFree Hard Disk: 30MB space for installation\nGraphic Card: Super VGA (800Ã—600) resolution, 16-bit graphics card or higher.","torrent":{"xt":"urn:btih:591a169e44068c0a12ec2a52ea329dba2dcebea5","amp;dn":"Xilisoft+Video+Editor+V1.0.34.1030+Incl+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"591a169e44068c0a12ec2a52ea329dba2dcebea5","infoHashBuffer":{"type":"Buffer","data":[89,26,22,158,68,6,140,10,18,236,42,82,234,50,157,186,45,206,190,165]},"announce":[],"urlList":[]}}