{"title":"Packtpub.Tcl.Tk.8.5.Programming.Cookbook.Feb.2011","uid":6681972,"size":3465719,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59b4359ef3a6082f64d2f920389edd40d78b0d26&amp;dn=Packtpub.Tcl.Tk.8.5.Programming.Cookbook.Feb.2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1316235578,"description":" &lt;a href=&quot;http://www.wowebook.com/book/tcl-tk-8-5-programming-cookbook/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.wowebook.com/book/tcl-tk-8-5-programming-cookbook/&lt;/a&gt;\n\nBook Description\nWith Tcl/Tk, you can create full-featured cross-platform applications in a simple and easy-to-understand way without any expensive development package; the only tools required are a simple text editor and your imagination. This practical cookbook will help you to efficiently interact with editors, debuggers, and shell type interactive programs using Tcl/Tk 8. This cookbook will comprehensively guide you through practical implementation of Tcl/Tk 8 commands and tools.\n\nThis book will take you through all the steps needed to become a productive programmer in Tcl/Tk 8. Right from guiding you through the basics to creating a stand-alone application, it provides complete explanation of all the steps along with handy tips and tricks.\n\nThe book begins with an introduction to the Tcl shell, syntax, variables, and programming best practices in the language. It then explores procedures and the flow of events with control constructs followed by advanced error trapping and recovery. From Chapter 4, a detailed study of string expressions and handling enables you to handle various string functions and use lists to expand the string functionality. The book then discusses in-depth the Tcl Dictionary and how to utilize it to store and retrieve data. File operations and Tk GUI handling are covered extensively along with a developing a real-world address book application to practice the concepts learned.\n\nA practical, comprehensive cookbook to master the depths and breadths of Tcl/Tk 8 programming\n\nWhat you will learn from this book\n\nExpand your Tcl/Tk abilities by gaining in-depth knowledge of the core commands\nLearn efficient programming by using control constructs in your program\nHandle numerous types of string expressions by performing formatting, searches, and advanced manipulations on them\nGain expertise in using lists with examples teaching you the various available operations\nDemystify the Tcl Dictionary and learn how it can be a viable substitute for a third-party database\nPerform various operations on the dictionary elements in both single and multiple layer dictionaries\nCreate, manage, and empower your Graphical User Interface with Tk window management, to develop attractive applications\nEase your file system access with an in-depth study of File operations\nPerform advanced error trapping and recovery with error handling commands in Tcl\nApproach\nThis book provides a step-by-step approach to the Tcl/Tk language with the help of re-usable examples and images. It is a series of carefully organized, easy-to-follow, standalone recipes to solve your queries. Whether you go through the recipes chapter-wise or pick up any recipe randomly, you will find clear and complete explanation of the task covered in the recipe.\n\nWho this book is written for\nIf you are a beginner interested in adding Tcl/Tk 8 to your list of languages, or an experienced Tcl/Tk programmer looking to sharpen your knowledge, be assured, you will find your prefect guide in this book. Whether you are developing for your personal use or commercial applications, this book will provide you with a ready reference to the building blocks of Tcl/Tk 8.\n\nBook Details\nPaperback: 236 pages\nPublisher: Packt Publishing (February, 2011)\nLanguage: English\nISBN-10: 1849512981\nISBN-13: 978-1849512985","torrent":{"xt":"urn:btih:59b4359ef3a6082f64d2f920389edd40d78b0d26","amp;dn":"Packtpub.Tcl.Tk.8.5.Programming.Cookbook.Feb.2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59b4359ef3a6082f64d2f920389edd40d78b0d26","infoHashBuffer":{"type":"Buffer","data":[89,180,53,158,243,166,8,47,100,210,249,32,56,158,221,64,215,139,13,38]},"announce":[],"urlList":[]}}