{"title":"[SexuallyBroken] 2014-09-29 - Carter Cruise [MP4][1280x720] HD","uid":11185782,"size":798982284,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:59bbb75851ed8a5701b0745ade9888236d759408&amp;dn=%5BSexuallyBroken%5D+2014-09-29+-+Carter+Cruise+%5BMP4%5D%5B1280x720%5D+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"CrAGRG","files":1,"time":1412914399,"description":"[SexuallyBroken] 2014-09-29 - Carter Cruise [mp4][1280x720]\n\nDescription:\nCarter Cruise is a beautiful blonde that looks too wholesome to be into the kinky things that she is into. But behind that girl next girl facade beats the heart and loins of a sexual animal. She is here today to get tied up and ragdoll fucked until her big blue eyes rattle in her skull. Lucky for this fucktoy, that is exactly what we specialize in. Bound down in a chair tie with her arms cranked behind her in a strict strappado, Carter's mouth hole is positioned at perfect fucking height. A neck rope is added to make a handle to better guide that facepussy. We walk up and make full use of that face. As the cock goes in, the drool comes out. Carter sputters and gasps as her world is reduced to being a cock sheath. All she can do is try and survive, sneaking in gulps of air when she can. Enough warmup. Shifting a still bound Carter into our handy fuck stool, we now have access to both ends. We fuck that face a little before yanking down those skintight leggings to get full use of that pussy. And then it is on. Back and forth we dip, using both ends to the hilt, completely owning Carter's holes. She cums, hard, unable to get on top of is as she is overloaded with the dick. He makeup is destroyed and her face is shiny and covered with her own juices. We pound out that pussy and leave behind our initials. By the times we are done, Carter is a twitchy, glassy eyed lump, held up on the chair only by her bondage. Today school was in session and the lesson was Sexuallybroken. We like teaching newbies Carter. You will be back to see if the lesson stuck... \n\nTags:\nBlonde, Blow job, Blue Eyes, Drool, Face Fucking, Long Hair, Natural Breast, Neck Rope, Piercings, Rough fucking, Sucking \n\nScreenS:\n &lt;a href=&quot;\nhttp://imgur.com/nzvtU3n&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgur.com/nzvtU3n&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgur.com/co58ZhR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgur.com/co58ZhR&lt;/a&gt;","torrent":{"xt":"urn:btih:59bbb75851ed8a5701b0745ade9888236d759408","amp;dn":"%5BSexuallyBroken%5D+2014-09-29+-+Carter+Cruise+%5BMP4%5D%5B1280x720%5D+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59bbb75851ed8a5701b0745ade9888236d759408","infoHashBuffer":{"type":"Buffer","data":[89,187,183,88,81,237,138,87,1,176,116,90,222,152,136,35,109,117,148,8]},"announce":[],"urlList":[]}}