{"title":"The Death of a President - William Manchester.epub","uid":9278581,"size":4859208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a51198c357029413135f0ad425fdd53b57a4fa6&amp;dn=The+Death+of+a+President+-+William+Manchester.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sameer_were","files":1,"time":1385897660,"description":"The Death of a President by William Manchester\nRequirements: ePub reader, 5 Mb\nOverview: At this fiftieth anniversary of President Kennedy's assassination, let's look back. \n\nAs the world still reeled from the tragic and historic events of November 22, 1963, William Manchester set out, at the request of the Kennedy family, to create a detailed, authoritative record of the days immediately preceding and following President John F. Kennedy's death. Through hundreds of interviews, abundant travel and firsthand observation, and with unique access to the proceedings of the Warren Commission, Manchester conducted an exhaustive historical investigation, accumulating forty-five volumes of documents, exhibits, and transcribed tapes. His ultimate objective--to set down as a whole the national and personal tragedy that was JFK's assassination--is brilliantly achieved in this galvanizing narrative, a book universally acclaimed as a landmark work of modern history. (Amazon) \n\nThe book was not without controversy. Mrs. Kennedy disagreed strongly with some things contained in the book and threatened to block its publication unless changes were made. Manchester did make some changes, which he called &quot;harmless&quot;. The book was published in 1967, but according to Manchester's son John, it allowed to go out of print; it was re-published in October, 2013. \nGenre: Non-fiction, History","torrent":{"xt":"urn:btih:5a51198c357029413135f0ad425fdd53b57a4fa6","amp;dn":"The+Death+of+a+President+-+William+Manchester.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a51198c357029413135f0ad425fdd53b57a4fa6","infoHashBuffer":{"type":"Buffer","data":[90,81,25,140,53,112,41,65,49,53,240,173,66,95,221,83,181,122,79,166]},"announce":[],"urlList":[]}}