{"title":"River Monsters - Season 2 - Complete","uid":6754934,"size":2835313364,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5c61086c63cf306b6dcc273a2ff30a500c2054ca&amp;dn=River+Monsters+-+Season+2+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Isadorabelle","files":8,"time":1319010697,"description":"This torrent is River Monsters season 2, the complete season. All the files are labeled correctly. \n\nBe kind and seed!\n\n2.1 Demon Fish\nJeremy Wade journeys to the infamous Congo River in Africa in search of the world's most ferocious fish. This supernatural monster predator pushes Jeremy to his physical and mental limit. It requires all of his skills and the help of a witch doctor. \n\n2.2 Death Ray\nJeremy Wade heads to the Mekong River in Thailand in search of one of the world's largest, most terrifying river fish: the giant freshwater stingray. Armed with a venomous, 10-inch barbed tail, this 700-pound monster tests Jeremy to his physical limit. \n\n2.3 Killer Snakehead\nAngler Jeremy Wade sets his sights on an aggressive Far Eastern predator that's now invading America's backyards. Accused of homicide, and said to breathe air and crawl on land, the snakehead is a monster that sounds more like a gangster than a fish.\n\n2.4 Congo Killer\nJeremy Wade travels to one of the few rivers left on earth that will still test a fisherman. The Congo, a river steeped in legends... and soaked in violence. One spirit in particular is said to lure fishermen from their boats to their death. \n\n2.5 Alaskan Horror\nExtreme angler Jeremy Wade searches for the lethal lake monster of native legend that's been dragging people down to an icy grave for centuries. He ends up landing the largest fish he's ever caught, but is this the monster? \n\n2.6 Rift Valley Killer\nJeremy Wade is on a quest to Africa's Rift Valley to explore the roots of fishing and the monsters these first fishermen faced. It's a dangerous place, filled with killer crocs, hippos and warring gangs, but at its heart is a worthy prize: the Mputa, aka Nile perch, Africa's largest freshwater fish. \n\n2.7 Hidden Predator\nThe biggest bull shark ever recorded was caught in South Africa, in a river. Was this monsterous freshwater catch a horrifying fluke, or are there more shark giants prowling this river? Jeremy Wade heads to South Africa to see if he can land a monster! ","torrent":{"xt":"urn:btih:5c61086c63cf306b6dcc273a2ff30a500c2054ca","amp;dn":"River+Monsters+-+Season+2+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c61086c63cf306b6dcc273a2ff30a500c2054ca","infoHashBuffer":{"type":"Buffer","data":[92,97,8,108,99,207,48,107,109,204,39,58,47,243,10,80,12,32,84,202]},"announce":[],"urlList":[]}}