{"title":"Van Morrison at the movie sountrack hits 320","uid":6713199,"size":188149532,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c92f5c560b35fddb9e28a59262b54531ea2f810&amp;dn=Van+Morrison+at+the+movie+sountrack+hits+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"judast","files":19,"time":1317441410,"description":"If Hollywood's marriage with pop music is too often a marketing-driven shotgun affair, there remain musicians whose artistry can't help but elevate whatever film project they're associated with. This 19-track compendium underscores that notion, gathering a career-spanning collection of the Irish rock-R&amp;B legend's contributions to an eclectic body of films that stretches from Pope of Greenwich Village's effusive early solo hit &quot;Jackie Wilson Said&quot; to the unlikely live collaboration with Roger Waters on &quot;Comfortably Numb&quot; that seasons Martin Scorsese's Oscar-nominated The Departed. The collection serves as a concise primer to the high points of Van Morrison's mercurial career, from the gritty career-breakout hits (&quot;Gloria,&quot; &quot;Baby Please Don't Go&quot;) of his British Invasion band Them through such early solo touchstones as &quot;Wild Night,&quot; &quot;Brown Eyed Girl,&quot; &quot;Domino,&quot; and the collection's fine, previously unreleased live version of &quot;Moondance&quot; from An American Werewolf in London. But, as tracks like &quot;Wonderful Remark,&quot; &quot;Bright Side of the Road,&quot; &quot;Someone Like You,&quot; and his Chieftains collaboration &quot;Irish Heartbeat&quot; ably argue, it's also an invitation to explore less heralded, if equally seductive, corners of the singer's rich oeuvre. --Jerry McCulley","torrent":{"xt":"urn:btih:5c92f5c560b35fddb9e28a59262b54531ea2f810","amp;dn":"Van+Morrison+at+the+movie+sountrack+hits+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c92f5c560b35fddb9e28a59262b54531ea2f810","infoHashBuffer":{"type":"Buffer","data":[92,146,245,197,96,179,95,221,185,226,138,89,38,43,84,83,30,162,248,16]},"announce":[],"urlList":[]}}