{"title":"Buckethead LIVE at the Catalyst (Santa Cruz, CA) 2006","uid":4137841,"size":7322353233,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5d973536eda20b3d738658565b1793d9cb809950&amp;dn=Buckethead+LIVE+at+the+Catalyst+%28Santa+Cruz%2C+CA%29+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"somemacuser","files":27,"time":1208351498,"description":"============Buckethead Live at the Catalyst============\n\nBuckethead LIVE at the Catalyst (Santa Cruz, CA) 2006\n\nI shot this footage at a live concert at the Catalyst night club in Santa Cruz, CA in june of 2006.  For those of you who know the Catalyst,  you know this isn&amp;#039;t an easy feat.  I created a fake press-pass and snuck in my HDV cam and  and I filmed this video.  Here ya go!  oh, and you might want to get some headcheese to snack on while you watch this... -DMT\n\nHigh Definition Night Vision converted to Black and White. - You get to see his fingers while he&amp;#039;s playing.\n\nBuckethead (born Brian Carroll) is an American guitarist and composer. He is known for wearing a white plastic mask and a KFC bucket on his head while performing.\n\nHe is a prolific composer, having released 38 solo albums and performed on over 50 more. He has also made a guest appearance on 44 different albums from various artists. His music spans across diverse areas such as thrash metal, funk, electronica, jazz and avant-garde music.\n\nAlthough a multi-instrumentalist (playing guitar, bass guitar, banjo, keyboards, ukulele, organ, violin, clarinet, saxophone, recorder, drums, gong, and piano), Buckethead is best known for his electric guitar playing, characterized by diverse playing styles spanning thrash guitar, fingerpicking, and slap guitar. Guitar One voted him number 8 on a list of the &quot;Top 10 Greatest Guitar Shredders of All Time&quot;.\n\nAlthough Buckethead now works primarily as a solo artist touring the United States with a trio, he has had a wide variety of high profile collaborations with such artists as Les Claypool, Tony Williams, Bootsy Collins, Bernie Worrell, Iggy Pop, Serj Tankian, Guns N&amp;#039; Roses, Saul Williams, Mike Patton, Viggo Mortensen and with Bill Laswell on Praxis.\n\nBuckethead also has a career writing and performing music for major motion pictures. Some of the films he has worked on include: Saw II, Ghosts of Mars, Beverly Hills Ninja, Mortal Kombat, Mortal Kombat: Annihilation, Last Action Hero and the soundtrack of Mighty Morphin Power Rangers: The Movie.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Buckethead&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Buckethead&lt;/a&gt;","torrent":{"xt":"urn:btih:5d973536eda20b3d738658565b1793d9cb809950","amp;dn":"Buckethead+LIVE+at+the+Catalyst+%28Santa+Cruz%2C+CA%29+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d973536eda20b3d738658565b1793d9cb809950","infoHashBuffer":{"type":"Buffer","data":[93,151,53,54,237,162,11,61,115,134,88,86,91,23,147,217,203,128,153,80]},"announce":[],"urlList":[]}}