{"title":"The Beatles - 1964-07-19 - 'Blackpool Night Out', Blackpool","uid":7641972,"size":72659369,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5e373e710965f80acb6cc61a6da2ddadeb58253b&amp;dn=The+Beatles+-+1964-07-19+-+%27Blackpool+Night+Out%27%2C+Blackpool&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TUFF_GONG","files":10,"time":1347804037,"description":" &lt;a href=&quot;http://veryrare.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://veryrare.org&lt;/a&gt;\n\nThe Beatles performed on the television show &quot;Blackpool Night Out&quot; twice in their career. Four tracks from the second appearance, in 1965, were included on the &quot;Anthology 2&quot; cd's. This is the first appearance, which has never been officially released in any form.\n\nThe performance took place on July 19, 1964, at the ABC Theatre In Blackpool. The show was broadcast live by ITV. It marked the first performances of the songs &quot;A Hard Day's Night&quot; and &quot;If I Fell&quot;, both of which were featured on the &quot;A Hard Day's Night&quot; LP, released in the UK nine days earlier.\n\n&quot;Can't Buy Me Love&quot; had been in their setlist since April 1964 (the single was released in March), &quot;You Can't Do That&quot; had been added in June, and &quot;Long Tall Sally&quot; had been a long-time standard of the band.\n\nLineage:\n\nReel-to-Reel (7.5 ips) &gt;&gt; CD-R &gt;&gt; FLAC\n\nIn addition to the songs, the Beatles also took part in some comedy bits, the audio of which is included here, from an inferior source than the songs, so the above lineage doesn't apply to the first track.\n\nTracklist:\n\n01 - Operating Table Sketch\n02 - Intro\n03 - A Hard Day's Night\n04 - Things We Said Today\n05 - You Can't Do That\n06 - If I Fell\n07 - Long Tall Sally\n\nFor the mods: This has never been included on any official release. It was only broadcast once, on the day it was recorded, but may have been rerun once or twice in the following months.\n\nMy own involvement in how this particular recording saw the light of day:\n\nAbout ten years ago now, I was a newbie trader and I had got my hands on a bootleg called &quot;Mythology&quot; which included these songs in atrocious quality. It sounded like someone had held up a cheap tape recorder to a TV set--which may actually have been the source.\n\nNot knowing any better, I posted to a now-defunct message board asking if there was any better source for this show. Lo and behold, some guy happened to mention that he had a reel-to-reel of this show that sounded pretty good, but he wasn't sure because he didn't have the &quot;Mythology&quot; bootleg. He posted some clips which caused a Beatlefan frenzy. It was a major, major unbooted upgrade. In the end, he sent me and two other people a CD-R of the recordings, then sent his original reel-to-reel to Apple Corps. (the Beatles' company) because he figured they'd want it.\n\nThis has been the &quot;core&quot; source for this show ever since. I wasn't the one who initially spread it, though. IIRC, one of the other two people who received the CD-R promised the originator that he'd tree it, which he did, and it has found its way on various compilations ever since.\n\nI uploaded the Beatles' show from Vancouver 1964 the other day. I'm uploading this now because it's the only other worthwhile inclusion on the Purple Chick bootleg &quot;Seattle Down Now&quot;. The rest of that compilation is made up of sound clips from various newsreels (so, no complete songs), the Seattle 1964 show (which is the most awful-sounding audience tape I've ever heard--be my guest if you want to upload it, because I'm not gonna), and the Hollywood Bowl 1964 show (half of which was included on the official &quot;Live At the Hollywood Bowl&quot; LP). So, now, if you get this and my other upload, you have everything off that compilation that you need. Enjoy!","torrent":{"xt":"urn:btih:5e373e710965f80acb6cc61a6da2ddadeb58253b","amp;dn":"The+Beatles+-+1964-07-19+-+%27Blackpool+Night+Out%27%2C+Blackpool","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e373e710965f80acb6cc61a6da2ddadeb58253b","infoHashBuffer":{"type":"Buffer","data":[94,55,62,113,9,101,248,10,203,108,198,26,109,162,221,173,235,88,37,59]},"announce":[],"urlList":[]}}