{"title":"The Brian Jonestown Massacre - Tepid Peppermint Wonderland","uid":4021619,"size":239050840,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e3f0a65f506b78c94667005403513df1fb03eed&amp;dn=The+Brian+Jonestown+Massacre+-+Tepid+Peppermint+Wonderland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"torcano","files":43,"time":1202687246,"description":"by Johnny Loftus, Allmedia\n \nOver the years, Anton Newcombe and the Brian Jonestown Massacre have gotten more promotional mileage out of their self-sabotage than they have ink spilled on their shambolic musical blend of the Stones, Velvets, and Summer of Love-derived transcendence. Megalomania, drug abuse, internal strife, aborted tours, and frustrated fans ? it&amp;#039;s a checklist for band destruction. And yet the Brian Jonestown Massacre endure. They got a boost outside of their sizable niche in 2003 with the release of a documentary that traced both their contentious relationship with the Dandy Warhols and Newcombe&amp;#039;s mercurial antics/genius. Ondi Timoner&amp;#039;s Dig! won the Grand Jury Prize for Best Documentary at the 2004 Sundance Film Festival, and it proved a captivating depiction of the group&amp;#039;s long strange trip. As the film showed, BJM albums can be a long time coming. So Tee Pee Records has capitalized on the exposure with Tepid Peppermint Wonderland, a two-disc, nearly 40 song set of rare, old, unreleased, and live material. Each track is accompanied by recollections from various band participants (there have been over 40 since the group&amp;#039;s 1990 inception), and there&amp;#039;s a wealth of photos from that same stretch. But by including album cuts from throughout their career, Tepid Peppermint also re-emphasizes just how great ? after all the drama ? the Brian Jonestown Massacre can really be. Disc one includes the softly swirling haze of 2004 single &quot;If Love Is the Drug,&quot; the Bravery Repetition &amp; Noise highlight &quot;Sailor,&quot; and both &quot;Anenome&quot; and &quot;All Around You (Intro)&quot; from the amazing, grimy, and beautiful 1996 effort Their Satanic Majesties&amp;#039; Second Request. &quot;Wisdom&quot; could be an ancient Charlatans UK single, and &quot;Stars&quot; is a brittle, very heavily &amp;#039;60s acoustic number about tortured love ? &quot;I warned you I&amp;#039;d kill you/And I love you&quot; ? that Anton&amp;#039;s notes say is the first song he ever wrote on guitar. Tepid Peppermint&amp;#039;s second disc is equally strong, beginning with an unreleased track and moving through the band&amp;#039;s first-ever single (&quot;Evergreen&quot;), live versions of &quot;Let Me Stand Next to Your Flower&quot; and &quot;Hide and Seek,&quot; the nearly garage rock stomp of 1996&amp;#039;s &quot;Oh Lord,&quot; and &quot;Not if You Were the Last Dandy on Earth,&quot; the Warhols-baiting single that plays a pivotal role in the documentary. The album closes with &quot;Sue,&quot; eight minutes that put Newcombe and the Brian Jonestown Massacre&amp;#039;s most central themes ? drugs, drone, dirt, and melody ? into epic relief. \n \n","torrent":{"xt":"urn:btih:5e3f0a65f506b78c94667005403513df1fb03eed","amp;dn":"The+Brian+Jonestown+Massacre+-+Tepid+Peppermint+Wonderland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e3f0a65f506b78c94667005403513df1fb03eed","infoHashBuffer":{"type":"Buffer","data":[94,63,10,101,245,6,183,140,148,102,112,5,64,53,19,223,31,176,62,237]},"announce":[],"urlList":[]}}