{"title":"Mortal Kombat X 1.7.0 mega mod Tegra","uid":13704816,"size":1387557221,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:5e65e9fd45a16a01cecf0553933676fa6a90d106&amp;dn=Mortal+Kombat+X+1.7.0+mega+mod+Tegra&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1456812509,"description":"Experience the over-the-top, visceral fighting of MORTAL KOMBAT X!\r\n\r\nBring the power of next-gen gaming to your mobile and tablet device with this visually groundbreaking fighting and card collection game. \r\n\r\nAssemble an elite team of Mortal Kombat warriors and prove yourself in the greatest fighting tournament on Earth.\r\n\r\nBRUTAL 3 v 3 KOMBAT \r\nCreate your own team of Mortal Kombat fighters and lead them into battle to earn experience, new special attacks, and powerful artifacts.\r\n\r\nMASSIVE ROSTER OF FIGHTERS\r\nCollect Mortal Kombat veterans like Scorpion, Johnny Cage, Sub-Zero, Sonya, Kitana, Ermac, and many others.  Discover the newest additions to Mortal Kombat such as the insect-like D’Vorah, fiery Cassie Cage, bloodthirsty Kotal Khan, and the mysterious Kung Jin.\r\n\r\nJAW DROPPING X-RAYS AND FATALITIES\r\nMortal Kombat X brings its trademark Fatalities and X-Rays to mobile, with stunning graphics, these over the top moves punch you right in the guts.\r\n\r\nCHALLENGE OTHER PLAYERS\r\nCompete with other players in Faction Wars, an online competitive mode where players engage other player teams.  Rank up in your own Faction’s leaderboard to earn weekly prizes.\r\n\r\nSUMMON ALLIES INTO BATTLE\r\nFind other players to be your Ally. Borrow a kombatant and strike a decisive blow against your enemies.\r\n\r\nUNLOCK REWARDS IN BOTH THE CONSOLE AND MOBILE GAME\r\nPlay the game and unlock exclusive rewards for the console version of Mortal Kombat X, including ultra rare characters like Klassic Kitana and Injustice Scorpion. Playing the console version unlocks rewards in mobile as well.\r\n\r\nNOTICE:\r\n* Mortal Kombat X features high quality visuals. Performance is not optimized on devices with less than 1GB RAM.\r\n** A minimum of 1.5 GB of free space is required on your device.\r\nContent is generally suitable for ages 17 and up. Contains intense violence, blood, and gore.\r\n\r\nWhat’s new:\r\nNew Gold versions of Shinnok, Johnny Cage and Reptile have been added, along with Cross-Platform unlocks Tuxedo Cassie and Cyber Jacqui. Also, brand new Equipment, Shinnok’s Amulet provides several advantages. New Booster Packs and Bug Fixes as well!\r\n\r\nMega Mod Info:\r\n1. Infinite Souls\r\n2. Infinite Koins\r\n3. Infinite Ally Credit\r\n4. Enemy has Zero Touchness\r\n5. Enemy has Zero Recovery\r\n6. Infinite Energy of Cards\r\n7. Player has fastest Skill. Enemy has slowest Skill\r\n8. Anti-ban\r\n9. Infinite Health\r\n10 Unlocked Characters\r\n11 Unlocked Backgrounds\r\n\r\nThis is the Tegra GPU version\r\n\r\nInstall the game from Google Play and stop the downloading at 2%. After that, install APK of your gpu version. Then place data folder in SDCard/Android/Obb/ and play.\r\nRequires: Android OS 4.0 and up","torrent":{"xt":"urn:btih:5e65e9fd45a16a01cecf0553933676fa6a90d106","amp;dn":"Mortal+Kombat+X+1.7.0+mega+mod+Tegra","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e65e9fd45a16a01cecf0553933676fa6a90d106","infoHashBuffer":{"type":"Buffer","data":[94,101,233,253,69,161,106,1,206,207,5,83,147,54,118,250,106,144,209,6]},"announce":[],"urlList":[]}}