{"title":"HISTORY OF POP AND ROCK MUSIC - part 395","uid":7422574,"size":466357075,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5ec6b43beaa1185c6dd96cb4fc0c1bcaba790ece&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+395&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1341709457,"description":"                    PART  395\n\n\n          SIMON &amp; GARFUNKEL  -  Overs (1967)\n          SIMON &amp; GARFUNKEL  -  A Hazy Shade Of Winter  (1967)\n          SIMON &amp; GARFUNKEL  -  Mrs.Robinson  (1968)  \n          LEMONHEADS   -  Mrs.Robinson (1992) \n\n\n\n    &quot;Overs&quot; was written by Paul Simon for &quot;The Graduate&quot; soundtrack, but the film's producers rejected it. &quot;The Graduate&quot; is a 1967 American comedy-drama film directed by Mike Nichols.The film tells the story of Benjamin Braddock (played by Dustin Hoffman), a recent university graduate with no well-defined aim in life, who is seduced by an older woman, Mrs. Robinson (Anne Bancroft), and then proceeds to fall in love with her daughter Elaine (Katharine Ross). \n    &quot;A Hazy Shade of Winter&quot; is a song written by Paul Simon, recorded and released by Simon &amp; Garfunkel in 1967, and then included on their 1968 album, &quot;Bookends&quot;  (although it also appeared on their Live from New York City, 1967). It peaked at #13 on the Billboard Hot 100 making it the second highest-charting song on the album after &quot;Mrs. Robinson&quot;, which reached #1when it was released on the back of its inclusion on the soundtrack of The Graduate. Critic Richie Unterberer described the song as &quot;one of Simon and Garfunkel's best songs, and certainly one of the toughest and more rock-oriented&quot;.\n   &quot;Mrs. Robinson&quot; is a song written by Paul Simon. When released as a single in 1968, it hit number one on the Billboard Hot 100 chart in the US, for their second chart-topping hit after &quot;The Sound of Silence&quot;. An early version of the song appeared in the motion picture The Graduate (1967) and its subsequent soundtrack, while the complete song debuted on their album Bookends (1968). The song earned the duo a Grammy Award for Record of the Year in 1969.  \n\n   The Lemonheads are an American alternative rock band first formed in 1986 by Evan Dando, Ben Deily and Jesse Peretz. Dando has remained the band's only constant member.Since its formation, recording and touring lineups of the band have included co-founders Deily and Peretz, John Strohm, Doug Trachten, Corey Loog Brennan, Byron Hoag, Ben Daughtry, Juliana Hatfield, Nic Dalton, Dave Ryan, Patrick &quot;Murph&quot; Murphy , Bill Gibson, Mark 'Budola' Newman, Kenny Lyon, Vess Ruhtenberg, Devon Ashley, Karl Alvarez and Bill Stevenson, P. David Hazel and various others.After their initial punk-influenced releases and tours as an independent/&quot;college rock&quot; band in the late '80s, the Lemonheads' popularity with a mass audience grew in 1992 with the major label album It's a Shame about Ray, which was produced, engineered, and mixed by The Robb Brothers (Bruce Robb, Dee, and Joe). This was followed by a cover of Simon and Garfunkel's &quot;Mrs. Robinson&quot;, which eventually became one of the band's most successful singles.\n      \n","torrent":{"xt":"urn:btih:5ec6b43beaa1185c6dd96cb4fc0c1bcaba790ece","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+395","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ec6b43beaa1185c6dd96cb4fc0c1bcaba790ece","infoHashBuffer":{"type":"Buffer","data":[94,198,180,59,234,161,24,92,109,217,108,180,252,12,27,202,186,121,14,206]},"announce":[],"urlList":[]}}