{"title":"Sherlock S03E01 3x01 720p HDTV MPEG2-SM10HD (PS3 Compatible)","uid":9422963,"size":1802800996,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5ef207c7a78b13bf3fa0ece7129f31fb2bd86d27&amp;dn=Sherlock+S03E01+3x01+720p+HDTV+MPEG2-SM10HD+%28PS3+Compatible%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DeeJayPirate","files":1,"time":1388625153,"description":"DeeJay Ahmed: This Is Not My Torrent, Not My Rip, Not My Encode!! I Just Posted It Here!!\n\nSherlock is a British television crime drama that presents a contemporary adaptation of Sir Arthur Conan Doyle's Sherlock Holmes detective stories. Created by Steven Moffat and Mark Gatiss, it stars Benedict Cumberbatch as Sherlock Holmes and Martin Freeman as Doctor John Watson. Nine episodes have been produced, the first three of which aired in 2010. Series two aired in 2012, and a third series will air in 2014. The series has been sold to over 200 territories. Sherlock depicts &quot;consulting detective&quot; Holmes, assisting the Metropolitan Police Service, primarily Detective Inspector Greg Lestrade (Rupert Graves), in solving various crimes. Holmes is assisted by his flatmate, Dr John Watson, who has returned from military service in Afghanistan. Although the series depicts a variety of crimes and perpetrators, Holmes' conflict with his archnemesis Jim Moriarty (Andrew Scott) is a recurring feature.\n\nFoV provided the source file, which is incompatible with PS3 so to compensate for that as well as making it readily available for all PC rigs SM10HD re-encode the MKV into an MPEG2 and then manually mux the audio to sync up with it. We then alter the filters so the colours retain their maximum intensity and display nicely on big screens and home monitors. We do not share this process with others.\n\nWe seed for a minimum of 24 hours after the initial upload. After that it is down to the rest of the community.\n\nThanks for choosing SM10HD. There is a fan page dedicated to us on Facebook. Just search it out.","torrent":{"xt":"urn:btih:5ef207c7a78b13bf3fa0ece7129f31fb2bd86d27","amp;dn":"Sherlock+S03E01+3x01+720p+HDTV+MPEG2-SM10HD+%28PS3+Compatible%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ef207c7a78b13bf3fa0ece7129f31fb2bd86d27","infoHashBuffer":{"type":"Buffer","data":[94,242,7,199,167,139,19,191,63,160,236,231,18,159,49,251,43,216,109,39]},"announce":[],"urlList":[]}}