{"title":"J.D. Robb - Eve Dallas 31 - Strangers in Death-viny","uid":6426478,"size":1991487,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f1ca4274bec5f29e0c8ca8f72da02e2fa9b7322&amp;dn=J.D.+Robb+-+Eve+Dallas+31+-+Strangers+in+Death-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306494375,"description":"J.D. Robb - Eve Dallas 31 - Strangers in Death-viny\n\nTechnology may be different in 2060 New York, yet the city is still a place of many cultures and great divides. And as ever, some murders receive more attention than others - especially those in which the victim is a prominent businessman, found in his Park Avenue apartment, tied to the bed - and strangled - with cords of black velvet.\n\nIt doesn't surprise Lieutenant Eve Dallas that Thomas Anders's scandalous death is a source of titillation and speculation for the public - and humiliation for his family. While everyone else in the city is talking about it, those close to Anders aren't so anxious to do so. Fortunately, because Dallas's billionaire husband, Roarke, happens to own the prime real estate where Anders's sporting-goods firm was headquartered, she has some help with access. Before long, she's knocking on doors - or barging through them - to look for the answers she needs.\n\nBut the facts don't add up. Physical evidence suggests that the victim didn't struggle. The security breach in the highly fortified apartment indicates that the killer was someone close to Anders, but everyone's alibi checks out, from the wife who was off in the tropics to the loving nephew who stands to inherit millions. Was this a crime of passion - or a carefully planned execution?\n\nIt's up to Dallas to solve a sensational case where all involved guard secrets from one another - and strangers may be connected in unexpected, and deadly, ways.","torrent":{"xt":"urn:btih:5f1ca4274bec5f29e0c8ca8f72da02e2fa9b7322","amp;dn":"J.D.+Robb+-+Eve+Dallas+31+-+Strangers+in+Death-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1ca4274bec5f29e0c8ca8f72da02e2fa9b7322","infoHashBuffer":{"type":"Buffer","data":[95,28,164,39,75,236,95,41,224,200,202,143,114,218,2,226,250,155,115,34]},"announce":[],"urlList":[]}}