{"title":"Die Mannequin - Discography (2006-2012) [FLAC]","uid":8376439,"size":948544144,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5f26acdd5e018693c30ba8641b1d48f558c2207d&amp;dn=Die+Mannequin+-+Discography+%282006-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1366062359,"description":"\n  Die Mannequin - Discography (2006-2012) [FLAC]\n\n  2006 How to Kill\n  2008 Unicorn Steak\n  2009 FINO + BLEED\n  2012 Danceland\n\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Source: CD and WEB\n  Codec: FLAC\n  Bit Rate: ~ 800 - 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz \n\n  Dynamic Die Mannequin vocalist and guitarist Care Failure -- who somewhat sounds like a Courtney Love for a new generation -- left home when she was 16, only to weather run-ins with drugs and homelessness. She met Pat M. (aka Ghostwolf), who let her crash at his place, even offering his room to allow her space from the half dozen or so guys staying in the house. Failure wound up staying for over a year, and as the two became friends, they inevitably began collaborating musically as well. The Toronto-based singer's luck further ran her into an encounter with Death from Above 1979's Jesse Keeler, who wound up producing Failure's EP How to Kill under the MSTRKRFT moniker with his partner, Al-P.\n\n   On the EP, Failure did not yet have a permanent band around her, so she played everything except drums, which Keeler handled himself. Following the album's recording, Failure turned to friends to round out her Die Mannequin; old pal and drummer Ghostwolf and bassist Anthony Useless eventually completed the trashy rock crew. In 2006, Die Mannequin snagged opening spots on tours for Guns N' Roses and Buckcherry, and also signed a deal with EMI Publishing. The How to Kill EP appeared in January 2007 via Cordless Recordings. The band performed at Toronto's NXNE that same year, while summer was spent on the road with Vancouver's Pride Tiger before opening up Canadian dates for the Deftones.","torrent":{"xt":"urn:btih:5f26acdd5e018693c30ba8641b1d48f558c2207d","amp;dn":"Die+Mannequin+-+Discography+%282006-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f26acdd5e018693c30ba8641b1d48f558c2207d","infoHashBuffer":{"type":"Buffer","data":[95,38,172,221,94,1,134,147,195,11,168,100,27,29,72,245,88,194,32,125]},"announce":[],"urlList":[]}}