{"title":"The Omega Conspiracy - Dr. I.D.E. Thomas","uid":10400366,"size":4151219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6038e21da9beaee3248405764d306c791fc9a9a5&amp;dn=The+Omega+Conspiracy+-+Dr.+I.D.E.+Thomas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"starxteel","files":4,"time":1403311959,"description":"Do we ever learn from history? What were the conditions on the Earth that resulted in its destruction except for Noah and his family? What are the conditions on the Earth today? Will history repeat itself in our time?\nDemons are real, and their history reaches back to before Noah's flood. Just like then, they are influencing humans negatively, and just like then God's judgment is very near. I.D.E. Thomas reveals startling similarities between the past and today; between ancient peoples and modern peoples, signs that point to a return of mysterious beings known in the Bible as &quot;Nephilim&quot;. By examining demonic activity, Dr. I. D. E. Thomas concludes that many signs point toward the imminent return of Christ. From satanism to flying saucers in the twentieth century reaching all the way back to the mysterious 'sons of God'. The Omega Conspiracy could well be their final battle.\nThomas explores both scripture and worldwide paranormal events to take a close look at this fascinating subject.\n(Note: Nephilim means giants NOT &quot;fallen ones&quot; or &quot;man of renown&quot; in Gen 6:4a)\n\nAbout the author:\n Dr. I.D.E. Thomas was Pastor Emeritus of United Community Church in Glendale, CA and former Senior Pastor of First Baptist Church in Maywood, CA. He was a native of Wales in the United Kingdom, and had devoted the last 30 years as a minister. He had also served as a commentator for the BBC. In addition, he was the chancellor of a seminary in California, and had opened a number of similar seminaries in various foreign countries in the Orient such as Japan, Korea, Taiwan, and Guam. Dr. Thomas passed away in 2013. ","torrent":{"xt":"urn:btih:6038e21da9beaee3248405764d306c791fc9a9a5","amp;dn":"The+Omega+Conspiracy+-+Dr.+I.D.E.+Thomas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6038e21da9beaee3248405764d306c791fc9a9a5","infoHashBuffer":{"type":"Buffer","data":[96,56,226,29,169,190,174,227,36,132,5,118,77,48,108,121,31,201,169,165]},"announce":[],"urlList":[]}}