{"title":"Lagwagon - Hang (2014) [FLAC]","uid":11319154,"size":299770153,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:604c46bf70de187827b323d75eb6b897b0645fdc&amp;dn=Lagwagon+-+Hang+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1414542688,"description":"\n  Lagwagon - Hang (2014) [FLAC]\n\n  Genre: Rock\n  Style: Punk\n  Source: CD \n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Burden of Proof\n  02 Reign \n  03 Made of Broken Parts \n  04 The Cog in the Machine \n  05 Poison in the Well \n  06 Obsolete Absolute \n  07 Western Settlements \n  08 Burning Out in Style \n  09 One More Song \n  10 Drag \n  11 You Know Me \n  12 In Your Wake \n\n  As the first band signed to Fat Wreck Chords (that wasn't NOFX), Lagwagon helped to shape the face of punk in the '90s with their driving 1992 debut Duh, establishing their energetic and irreverent skatepunk as a trademark sound of the label. Nine years after their last release (Resolve, their 2005 tribute to their late drummer Derrick Plourde), Lagwagon have emerged from the studio with Hang, an album the shows the band has a lot to say about the current state of affairs in the United States. It would seem that after nearly a decade without new material, Lagwagon have finally reached the end of their rope, focusing their discontent into their music in a way that harks back to a time when the genre felt like a vehicle for change. Right out of the gate, the band takes a shot at American conservatives, chastising them for hiding behind religion and wedge issues like abortion and gun control while the world is being slowly ripped apart by ecological disasters that are being willfully ignored. Almost as beautifully as the way the band gets its message across is the album's construction, which creates a wonderful ebb and flow as the songs flow from one to the next with the kind of refinement that can only come from nearly 25 years together as a band. If Lagwagon were waiting for just the right moment to spring an album upon the world, they couldn't have picked a better time to do it, and the serious vibe and timely message of Hang make it an album that fans of the band (and punk in general) won't want to pass up","torrent":{"xt":"urn:btih:604c46bf70de187827b323d75eb6b897b0645fdc","amp;dn":"Lagwagon+-+Hang+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604c46bf70de187827b323d75eb6b897b0645fdc","infoHashBuffer":{"type":"Buffer","data":[96,76,70,191,112,222,24,120,39,179,35,215,94,182,184,151,176,100,95,220]},"announce":[],"urlList":[]}}