{"title":"A Culture of Conspiracy: Apocalyptic Visions in Contemporary Ame","uid":4674414,"size":1475196,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:607578735ef84a79dd734f1897087810c5d3151f&amp;dn=A+Culture+of+Conspiracy%3A+Apocalyptic+Visions+in+Contemporary+Ame&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1232844753,"description":"Many people assume that the X-Files conspiracy theory-malevolent space aliens in cahoots with shadowy government agencies-is the brainchild of caffeinated scriptwriters with an overnight deadline. But according to this fascinating cultural study, such scenarios have a long and disturbing intellectual pedigree. Political scientist Barkun (Religion and the Racist Right: The Origins of the Christian Identity Movement) traces them to a venerable tradition of &quot;New World Order&quot; conspiracy theories combining fundamentalist dread of the Antichrist with secular right-wing suspicions that the powers that be are controlled by Masons, Jesuits, Jews and, above all, the Illuminati. Starting in the 1980s, extraterrestrials began to appear at the summits of these conspiracy-theory hierarchies, a process accelerated by the Internet's anarchic dissemination and recombination of myths and rumors. The resulting &quot;improvisational millennialism&quot; has yielded any number of baroque &quot;superconspiracies&quot; (one theory yokes together UFOs, the Gestapo, the Mafia and the Wobblies), but Barkun contends there are serious repercussions. As New World Order themes have infiltrated the previously apolitical UFO subculture, he argues, they have become more respectable and widespread: racialist and anti-Semitic ideologies have resurfaced in the coded guise of alien cabals, and a vast popular audience has been introduced by Hollywood to the notion that the government is a totalitarian clique in black helicopters-a view once confined to right-wing extremists. Scholarly but fluently written and free of excessive jargon, Barkun's exploration of the conspiratorial worldview combines sociological depth with a deadpan appreciation of pop culture and raises serious questions about the replacement of democracy by conspiracy as the dominant paradigm of political action in the public mind. \nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved","torrent":{"xt":"urn:btih:607578735ef84a79dd734f1897087810c5d3151f","amp;dn":"A+Culture+of+Conspiracy%3A+Apocalyptic+Visions+in+Contemporary+Ame","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"607578735ef84a79dd734f1897087810c5d3151f","infoHashBuffer":{"type":"Buffer","data":[96,117,120,115,94,248,74,121,221,115,79,24,151,8,120,16,197,211,21,31]},"announce":[],"urlList":[]}}