{"title":"Sex-mUndi - 13 EL Momento Mas Deseado [DVDRip][SPanish]","uid":6914423,"size":727384950,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6095dc8650b6229d8f98c581ef2a960daf16014d&amp;dn=Sex-mUndi+-+13+EL+Momento+Mas+Deseado+%5BDVDRip%5D%5BSPanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"virana","files":-1,"time":1324976202,"description":"Desde la revoluciÃƒÂ³n sexual de los sesenta ha llovido mucho, el planeta se ha hecho mÃƒÂ¡s pequeÃƒÂ±o, las formas de vida y las relaciones humanas han cambiado lo suficiente como para que haya llegado el momento de abordar el estado de salud de la sexualidad, el erotismo y las relaciones humanas en el mundo. En &quot;Sex Mundi, la aventura del sexo&quot;, hemos recorrido el planeta recogiendo tradiciones y ritos ancestrales que conviven en el tiempo y a veces incluso en el lugar, con formas y sistemas de relaciones impensables hace cincuenta aÃƒÂ±os, con avances tecnolÃƒÂ³gicos que parecen de ciencia ficciÃƒÂ³n y que nos han permitido conocer nuevas profesiones, nuevas posibilidades y a personajes sorprendentes.\n\nEs esa diversidad y ese contraste lo que te proponemos en &quot;Sex Mundi, un recorrido por el mundo&quot; de la mano de prestigiosos pensadores, antropÃƒÂ³logos, biÃƒÂ³logos, sexÃƒÂ³logos y conocidos personajes de la cultura que nos ayudarÃƒÂ¡n a entender mejor el mundo en que vivimos. Grabada en 23 paÃƒÂ­ses y realizada en alta definiciÃƒÂ³n, esta fascinante serie pretende ser una actualizaciÃƒÂ³n documental del estado de la sexualidad y las relaciones humanas en este planeta globalizado que alberga una enorme y sugerente diversidad social.","torrent":{"xt":"urn:btih:6095dc8650b6229d8f98c581ef2a960daf16014d","amp;dn":"Sex-mUndi+-+13+EL+Momento+Mas+Deseado+%5BDVDRip%5D%5BSPanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6095dc8650b6229d8f98c581ef2a960daf16014d","infoHashBuffer":{"type":"Buffer","data":[96,149,220,134,80,182,34,157,143,152,197,129,239,42,150,13,175,22,1,77]},"announce":[],"urlList":[]}}