{"title":"Final Solution - Gujarat Riots - 2002 - Godhra","uid":5474675,"size":1456045032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:613eb09b9e49e920ba9205f7005ae5a4f384a40e&amp;dn=Final+Solution+-+Gujarat+Riots+-+2002+-+Godhra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ralph2324","files":-1,"time":1270068982,"description":"\n Final Solution\n\n\nIn February and March 2002, the Indian State of Gujarat witnessed horrific incidents of unparallelled violence that can only be described as Genocide. Over 2000 people, including British Citizens were slaughtered with more than 100,000 people displaced in under-resourced refugee camps. Houses were systematically looted; businesses burnt down, hundreds of women gang raped and many children murdered.\n\nSubstantial evidence suggests that the Gujarat State government, led by the current Chief Minister Narendra Modi and the police orchestrated the violence and were responsible for the carnage. Yet, despite domestic and international public pressure, not a single prominent individual has been held to account or brought to justice.\n\nCommentating on the violence in Gujarat, The US based Human Rights Watch states - &quot;What happened in Gujarat was not a spontaneous uprising, it was a carefully orchestrated attack against Muslims. The attacks were planned in advance and organised with extensive participation of the police and state government officials.&quot; The violence in 2002 followed a deteriorating trend of human rights abuses against the Christian, Muslim and Dhalit minorities in Gujarat, this trend has continued since 2002. Indeed, in 2005, the Chief Minister of Gujarat was banned from visiting the US for his part in the Genocide and continued Human rights abuses in Gujarat, citing Modi to be in &quot;in severe violation of religious freedoms&quot;.\n\nThis film is worth a million textbooks, because it shows first-hand what was happening in Gujarat and draws some very relevant parallels with the Jewish experience in Nazi Germany.\n\nNever Again? Watch this film and wake up.... \n\n\n &lt;a href=&quot;\nhttp://www.rakeshfilm.com/finalsolution.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rakeshfilm.com/finalsolution.htm&lt;/a&gt;","torrent":{"xt":"urn:btih:613eb09b9e49e920ba9205f7005ae5a4f384a40e","amp;dn":"Final+Solution+-+Gujarat+Riots+-+2002+-+Godhra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"613eb09b9e49e920ba9205f7005ae5a4f384a40e","infoHashBuffer":{"type":"Buffer","data":[97,62,176,155,158,73,233,32,186,146,5,247,0,90,229,164,243,132,164,14]},"announce":[],"urlList":[]}}