{"title":"American Holocaust by David E. Stannard","uid":7302003,"size":9709190,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62c0f3615f100c09ec1581884abff72e1f1475bd&amp;dn=American+Holocaust+by+David+E.+Stannard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kundalini666","files":1,"time":1338064481,"description":"In a work of impassioned scholarship, David E. Stannard describes in horrific\ndetail the mass destruction of entire New World societies that followed in the\nwake of European contact with the Western Hemisphere-destruction that lasted\nfor more than four centuries, and that continues in many places even today.\nIn a sweeping introductory overview of the native cultures of the Americas as\nthey existed prior to 1492, Stannard provides a vibrant context for understanding\nthe human dimension of what was lost in that tragic firestorm of violence\nand introduced disease. He concludes with a searching examination of the religious\nand cultural roots of Euro-American racism and genocidal behavior.\n\n&quot;Vivid and relentless, combining a formidable array of primary sources with\nmeticulous analysis-a devastating reassessment of the Conquest as nothing\nless than a holy war.&quot; Kirkus Reviews\n\n&quot;The product of massive reading in the important sources .... Stannard's convincing\nclaim is that what happened was the worst demographic disaster in the history\nof our species.&quot; The Boston Sunday Globe\n\n&quot;A devastating portrait of the death, disease, misery, and apocalyptic destruction\nexperienced by American Indians during the centuries after 1492.&quot;\nThe Washington Post Book World\n\n&quot;Drawing on the latest demographic, geographical, and anthropological\nresearch ... [and] driven by a gruesome account of the ascetic Christian roots of\ngenocidal racism, Stannard's is a terrifying, spirit-withering story.&quot;\nThe Chicago Sunday Tribune","torrent":{"xt":"urn:btih:62c0f3615f100c09ec1581884abff72e1f1475bd","amp;dn":"American+Holocaust+by+David+E.+Stannard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62c0f3615f100c09ec1581884abff72e1f1475bd","infoHashBuffer":{"type":"Buffer","data":[98,192,243,97,95,16,12,9,236,21,129,136,74,191,247,46,31,20,117,189]},"announce":[],"urlList":[]}}