{"title":"Alex Jones Show - 2012 Mar 13 TU [sebaygo1]","uid":7101302,"size":84736165,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6335f60f5008539f7a3ee3472e2bb318f5eb5f11&amp;dn=Alex+Jones+Show+-+2012+Mar+13+TU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":6,"time":1331707629,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nTuesday, 13 March 2012\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site ::\n\nOn the Tuesday, March 13 edition of the Alex Jones Show, Alex talks with investigative journalist and author Greg Palast, described as a &quot;cross between Sam Spade and Sherlock Holmes.&quot; Palast is a recipient of the George Orwell Courage in Journalism Prize for his BBC television documentary, Bush Family Fortunes. He is the author of several books, including The Best Democracy Money Can Buy and Armed Madhouse. \n\nAlex also talks with journalist Jon Rappoport, who has worked as a freelance investigative reporter for over 30 years. Jon has hosted, produced, and written radio programs and segments in Los Angeles and Las Vegas at KPFK and KLAV. He has appeared as a guest on over 200 radio and television programs, including ABC's Nightline, Tony Brown's Journal, and Hard Copy. He has lectured extensively across the US on the question: Who runs the world and what can we do about it?\n\nNOTE: Today's upload is not commercial-free. PrisonPlanet.tv did not post a &quot;members' edit&quot; audio file for the broadcast.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:6335f60f5008539f7a3ee3472e2bb318f5eb5f11","amp;dn":"Alex+Jones+Show+-+2012+Mar+13+TU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6335f60f5008539f7a3ee3472e2bb318f5eb5f11","infoHashBuffer":{"type":"Buffer","data":[99,53,246,15,80,8,83,159,122,62,227,71,46,43,179,24,245,235,95,17]},"announce":[],"urlList":[]}}