{"title":"Frontiers in Antennas - Next Generation Design and Engineering","uid":6660726,"size":13328333,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:635e85eb9681c23848b21295af3346f879aa4075&amp;dn=Frontiers+in+Antennas+-+Next+Generation+Design+and+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315503563,"description":"The state of the art in antenna design and engineering\n\nEdited by one of the world's foremost authorities on smart antennas and featuring contributions from global experts, Frontiers in Antennas discusses the latest advances in antenna design and engineering. This pioneering guide deals primarily with frontier antenna designs and frontier numerical methods. Many of the concepts presented have emerged within the last few years and are still in a rapid state of development. Each chapter provides in-depth details on a unique and modern antenna technology.\n\nFrontiers in Antennas covers:\n\n    * Ultra-wideband antenna arrays using fractal, polyfractal, and aperiodic geometries\n    * Smart antennas using evolutionary signal processing methods\n    * The latest developments in Vivaldi antenna arrays\n    * Effective media models applied to artificial magnetic conductors and high impedance surfaces\n    * Novel developments in metamaterial antennas\n    * Biological antenna design methods using genetic algorithms\n    * Contact and parasitic methods applied to reconfigurable antennas\n    * Antennas in medicine: ingestible capsule antennas using conformal meandered methods\n    * Leaky-wave antennas\n    * Plasma antennas which can electronically appear and disappear\n    * Numerical methods in antenna modeling using time, frequency, and conformal domain decomposition methods\n\nAbout the Author\n\nFrank B. Gross, Ph.D., served as a professor in Electrical Engineering at the Florida State University for 18 years, teaching and performing research in antennas, radar, sonar, microwave engineering, energy conversion, propagation, and electromagnetics. He earned an award as the Tau Beta Pi Teacher of the Year. Dr. Gross worked with the MITRE Corporation, Georgia Tech Research Institute, SAIC, and is currently a senior scientist at Argon ST. He has more than 35 years of experience in radar, smart antennas, electromagnetics, antenna design, and propagation. Dr. Gross wrote Smart Antennas for Wireless Communications with Matlab and contributed to Antenna Engineering Handbook, Fourth Edition.\nProduct Details\n\n    * Hardcover: 544 pages\n    * Publisher: McGraw-Hill Professional; 1 edition (January 14, 2011)\n    * Language: English\n    * ISBN-10: 0071637931\n    * ISBN-13: 978-0071637930","torrent":{"xt":"urn:btih:635e85eb9681c23848b21295af3346f879aa4075","amp;dn":"Frontiers+in+Antennas+-+Next+Generation+Design+and+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"635e85eb9681c23848b21295af3346f879aa4075","infoHashBuffer":{"type":"Buffer","data":[99,94,133,235,150,129,194,56,72,178,18,149,175,51,70,248,121,170,64,117]},"announce":[],"urlList":[]}}