{"title":"Midnight's Furies - Nisid Hajari","uid":14513520,"size":1653187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:647fb6d0cff8a4ad904b347c07e1faf38940013d&amp;dn=Midnight%27s+Furies+-+Nisid+Hajari&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1462313882,"description":"A  few bloody months in South Asia during the summer of 1947 explain the world that troubles us today.**\r\n\r\nNobody expected the liberation of India and birth of Pakistan to be so bloody — it was supposed to be an answer to the dreams of Muslims and Hindus who had been ruled by the British for centuries. Jawaharlal Nehru, Gandhi’s protégé and the political leader of India, believed Indians were an inherently nonviolent, peaceful people. Pakistan’s founder, Mohammad Ali Jinnah, was a secular lawyer, not a firebrand.  But in August 1946, exactly a year before Independence, Calcutta erupted in street-gang fighting. A cycle of riots — targeting Hindus, then Muslims, then Sikhs — spiraled out of control. As the summer of 1947 approached, all three groups were heavily armed and on edge, and the British rushed to leave. Hell let loose. Trains carried Muslims west and Hindus east to their slaughter. Some of the most brutal and widespread ethnic cleansing in modern history erupted on both sides of the new border, searing a divide between India and Pakistan that remains a root cause of many evils. From jihadi terrorism to nuclear proliferation, the searing tale told in Midnight’s Furies explains all too many of the headlines we read today","torrent":{"xt":"urn:btih:647fb6d0cff8a4ad904b347c07e1faf38940013d","amp;dn":"Midnight%27s+Furies+-+Nisid+Hajari","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"647fb6d0cff8a4ad904b347c07e1faf38940013d","infoHashBuffer":{"type":"Buffer","data":[100,127,182,208,207,248,164,173,144,75,52,124,7,225,250,243,137,64,1,61]},"announce":[],"urlList":[]}}