{"title":"EnigmaT Set Rips { Cuts } - October 4th, 2014","uid":11155828,"size":729374054,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:649eb415a3cbdf549d5a32bb4db7649803774a4a&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+4th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":72,"time":1412419867,"description":"Adam Szabo &amp; Willem De Roo - Stingray (ASOT 683 Rip)-enTc\nAddictive Glance - Ellie (Original Mix) (Cut From LEON Set)-enTc\nAlex Di Stefano - Dark Purple (Cut From MIKE Set)-enTc\nAlfonso Muchacho - Galaxies (Cut From Barone Set)-enTc\nAlpha Force - Back In Time (Iversoon &amp; Alex Daf Remix) (ASOT 683 Rip)-enTc\nAly &amp; Fila Feat. Ever Burn - Is It Love (ASOT 683 Rip)-enTc\nAndre Sobota - Common Place (David Granha Remix) (Cut From Barone Set)-enTc\nAnske &amp; Patrick Ytting - Distant Worlds (Cut From Lange Set)-enTc\nArmin van Buuren - Hystereo (KhoMha Remix) (ASOT 683 Rip)-enTc\nArmin van Buuren Feat. Ray Wilson - Yet Another Day (Dreamy Emotional Remix) (ASOT 683 Rip)-enTc\nAudiko - Coming Back To Life (Cut From MIKE Set)-enTc\nAvii - 99 Souls (Original Mix) (Cut From Concept Set)-enTc\nBehind The Sunset - Actus Secundus (Reiklavik Remix - Intro Edit) (Cut From Romel Set)-enTc\nBHB - Neapolis (Joseph Ali Remix) (Cut From El Jay Set)-enTc\nBinary Finary - Forever Neon (Frank Dueffel Remix) (Cut From Kaeno Set)-enTc\nBinary Finary - Forever Neon (Original Mix) (Cut From Romel Set)-enTc\nBlue Foundation - Sweep (Kevin Di Serna &amp; Ditian Remix) (ABGT 099 Rip)-enTc\nBP - Somebody Else (ABGT 099 Rip)-enTc\nBreame - Reject (Genix Remix) (ABGT 099 Rip)-enTc\nCapobianco and DJ Dream - Liquid Dream (Cut From Patterson Set)-enTc\nCid Inc. - Fragile Circle (ABGT 099 Rip)-enTc\nDan Sieg - Welcome To The Alley (ABGT 099 Rip)-enTc\nDan Stone - Proteus (ASOT 683 Rip)-enTc\nDarmec - Quasar (Dario Sorano Remix) (Cut From MIKE Set)-enTc\nDenis Kenzo &amp; Sveta B. - Deep In My Heart (ASOT 683 Rip)-enTc\nDenis Sender &amp; Esmee Bor Stotijn - My Witness (ASOT 683 Rip)-enTc\nEdu Padilla - Secrets (BluSkay Remix) (Cut From Tero A Set)-enTc\nFunkin Matt - America (Cut From Concept Set)-enTc\nG8 - The Book Of Enoch (Original Mix) (Cut From Kaeno Set)-enTc\nGareth Emery featuring Bo Bruce - U (New World Punx Bootleg Mix) (GDJB Rip)-enTc\nGM Project - Deadly Sins (Sundrowner AM Mix) (Cut From Barone Set)-enTc\nGuy J - Candyland (ABGT 099 Rip)-enTc\nHenrik Twardzik - Coloured Light (Simon Patterson Remix) (Cut From Patterson Set)-enTc\nIversoon &amp; Alex Daf - Aqua (Original Mix) (Cut From El Jay Set)-enTc\nJames Bowie - Your Free (Original Mix) (Cut From Tero A Set)-enTc\nJames Teej Feat. Richie Hennessey - Disclosure (Simon Vuarambon Remix) (ABGT 099 Rip)-enTc\nJay Cosmic, The Chainsmokers, Botnek, Zedd, Foxes, 3LAU - S.V.C.T.T.R. (Cut From Concept Set)-enTc\nJens Jakob - Cupid (LowProfile Remix) (Cut From El Jay Set)-enTc\nKhalil Touihri - Sabotage (Cut From Barone Set)-enTc\nKhen - Sweet Break Up (ABGT 099 Rip)-enTc\nKhoMha vs. Fatboy Slim &amp; Riva Starr - Eat Sleep Dusk Riddles (KhoMha Mashup) (GDJB Rip)-enTc\nLee Osborne Feat. Roxanne Emery - Safe In The Sky (ASOT 683 Rip)-enTc\nLeo Reyes vs. Dannic &amp; Bright Lights - Dear Life is Wide Open (Markus Schulz Mashup) (GDJB Rip)-enTc\nLukas Blekaitis - Winter Calling (Manida Remix) (Cut From Cos Heav Set)-enTc\nMarcprest - Losing Memory (Cosmic Heaven Remix) (Cut From Cos Heav Set)-enTc\nMark L - Terminator (Javy X Remix) (Cut From Kaeno Set)-enTc\nMarkus Schuz - ID -October 2014- (-SPAMMED- GDJB Rip)-enTc\nMaRLo - Barracuda (ASOT 683 Rip)-enTc\nMarsbeing - Sorrow (Original Mix) (Cut From Barone Set)-enTc\nMax Graham &amp; Mark Sherry vs. Steve Angello, Dimitri Vangelis &amp; Wyman - The Evil Payback (Markus Schulz Mashup) (GDJB Rip)-enTc\nMike Shiver, Theresia Svensson &amp; Johnny Norberg vs. Max Graham &amp; Mark Sherry - The Evil Shade (Markus Schulz Mashup) (GDJB Rip)-enTc\nMitaric - A Rumor's Not A Rumor That Doesn't Die (Cut From Barone Set)-enTc\nNick Arbor - Timecode (Original Mix) (Cut From Yves Set)-enTc\nOcean Dynamic - Aquamarine (Cut From Masoud Set)-enTc\nOutside The Bounds - Pseudopodia (Original Mix) (Cut From El Jay Set)-enTc\nOVRSD - Before (Original Mix) (Cut From Concept Set)-enTc\nPaul Webster &amp; McAree &amp; Clancy - Happy Ending (ASOT 683 Rip)-enTc\nPhil Dinner - Assassin (Witness45 Remix) (Cut From Romel Set)-enTc\nPhonic Scoupe - Lust (Cid Inc. Remix) (Cut From Barone Set)-enTc\nRageVision - By Your Side (Skydiver Remix) (Cut From Cos Heav Set)-enTc\nRene Ablaze - Trance Essentials (Dreamy Remix) (Cut From Saux Set)-enTc\nRickber Serrano &amp; Laritonz feat. Meli Malavasi - Move (Original Mix) (-SHORT- Cut From Rayel Set)-enTc\nRobert R. Hardy - Unique Girl (Monojoke Remix) (Cut From Barone Set)-enTc\nRobert Vadney - Revolution (Hard Mix) (Cut From El Jay Set)-enTc\nRuben de Ronde &amp; LTN - Fernweh (Cut From Masoud Set)-enTc\nRuben de Ronde &amp; LTN - Fernweh (Ruben de Ronde Mix) (ABGT 099 Rip)-enTc\nSecond Sine - Ipanema Girls (Nick Callaghans Off The Grid Remix) (Cut From Kaeno Set)-enTc\nSimon O'Shine &amp; Sergey Nevone - In Spite of Everything (ASOT 683 Rip)-enTc\nTim Mason - Together (ABGT 099 Rip)-enTc\nVertical Mode - Computer Music (Cut From Patterson Set)-enTc\nWilliam P - Strategic (French Skies Tech Remix) (Cut From El Jay Set)-enTc\nZatox &amp; Nikkita - Poltergeist (Adrena Line Edit) (Cut From Yves Set)-enTc\n","torrent":{"xt":"urn:btih:649eb415a3cbdf549d5a32bb4db7649803774a4a","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+4th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649eb415a3cbdf549d5a32bb4db7649803774a4a","infoHashBuffer":{"type":"Buffer","data":[100,158,180,21,163,203,223,84,157,90,50,187,77,183,100,152,3,119,74,74]},"announce":[],"urlList":[]}}