{"title":"Canned Heat-Kaleidoscope(2007)[EAC-FLAC][TWR24][CR-Bt]","uid":4591983,"size":308780923,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:65c4a3b46b410f973c93182be1938a5a0f34b88f&amp;dn=Canned+Heat-Kaleidoscope%282007%29%5BEAC-FLAC%5D%5BTWR24%5D%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":16,"time":1229870759,"description":"\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp.\n\n\n\nCanned Heat\nKaleidoscope aka Live at Topanga Corral\nRelease Date: 2007 09 18\nLabel: Lilith\n\nThis is one of the strongest documents to feature Canned Heat in concert. However, contrary to the title, these performances are not from the Topanga Corral -- where the Heat were the house band off and on during the mid-1960s. Instead, it was later revealed the origins were actually from a Los Angeles club called the Kaleidoscope circa 1968. They most likely hail from the same batch of tapes that yielded the 4-plus-minute epic &quot;Refried Boogie,&quot; which spread over Sides Three and Four on the Living the Blues (1968) two-LP package. The personnel includes Alan &quot;Blind Owl&quot; Wilson (guitar/harmonica/vocals), Larry &quot;The Mole&quot; Taylor (bass), Henry &quot;Sunflower&quot; Vestine (guitar), Bob &quot;The Bear&quot; Hite (vocals), and Aldolfo &quot;Fito&quot; de la Parra (drums). Indeed, these recordings were made prior to the rapid drug-related decline and eventual replacement of Vestine -- who is actually in top flight throughout -- with Harvey Mandel in mid-1969. Another factor in the chronology is the soulful interpretation of standard blues numbers, which would be incrementally abandoned for longer and more rambling psychedelic jams by the time of Live in Europe (1970). However, the difference between the early 1970s incarnation and this 'classic' lineup seems to lie primarily in their respective approaches. This seminal aggregate explores more traditional outlets such as the languid approach to B.B. King's &quot;Sweet Sixteen,&quot; sporting some incendiary fretwork from the coupling of Wilson's smooth slide and Vestine's sinuous and punctuating leads. The former further exemplifies his bottleneck prowess on a rollicking reading of Elmore James' &quot;Dust My Broom&quot; that swings solid from tip to tail. As does the upbeat and slightly Creole-flavored &quot;I Wish You Would,&quot; landing somewhere between the Yardbirds' aggressive take and Billy Boy Arnold's original. While interested parties are encouraged to find this set, caveat emptor, as the exact same material exists under a bevy of monikers. Most notable among these are Live at the Kaleidoscope 1969 (2000), Very Best of the Blues Years (2000), and as part of a two-fer with Vintage (1969) on Live at the Topanga Corral/Vintage (2001) -- which arguably boasts the best sound, having been remastered.\n\n Lindsay Planer, All Music Guide\n\n\nTracks:\n\t\n1\tBullfrog Blues\t\t7:11\n2\tSweet Sixteen\t\t10:57\n3\tI'd Rather Be the Devil\t5:13\n4\tDust My Broom\t\t5:47\n5\tWish You Would\t\t8:03\n6\tWhen Things Go Wrong\t9:11\n\n\n\n","torrent":{"xt":"urn:btih:65c4a3b46b410f973c93182be1938a5a0f34b88f","amp;dn":"Canned+Heat-Kaleidoscope%282007%29%5BEAC-FLAC%5D%5BTWR24%5D%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65c4a3b46b410f973c93182be1938a5a0f34b88f","infoHashBuffer":{"type":"Buffer","data":[101,196,163,180,107,65,15,151,60,147,24,43,225,147,138,90,15,52,184,143]},"announce":[],"urlList":[]}}