{"title":"ROARIN&amp;rsquo; RICK&amp;rsquo;S RARE BIT FIENDS 01-21 (1994-1996) (Ki","uid":8913781,"size":460912477,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:66a74cbc55e0fac1b19ff5f3042485b0471bd86e&amp;dn=ROARIN%26rsquo%3B+RICK%26rsquo%3BS+RARE+BIT+FIENDS+01-21+%281994-1996%29+%28Ki&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1379088846,"description":"The first half of this series was posted a couple of months ago by our friend LeonardTSpock (not to be confused with ZacharyQuintoSpock, who is friend to nothing except overacting).\n\nThis title was a cool series of strips related to, and featuring the contents of, Rick Veitch's dreams. If you're unfamiliar with Veitch, he is a longtime Vertigo and independent comics artist (and often writer) who's generally known for his collaborations with Alan Moore (on Swamp Thing, Miracleman, Supreme, and so on).\n\nVeitch was also a very early supporter of the concept of online, digital comics creation &amp; distribution. Of course, that bullshit will never catch on!\n\nI shall swipe the description from LeonardTSpock's post:\n\n------\n\nIssues 1-21 of &quot;Roarin' Rick's Rare Bit Fiends&quot;\n\nKing Hell, 1994-1996, 32 pages each\n\nMostly Written and Illustrated by Rick Veitch\n\nOther contributors include Dave Sim, Neil Gaiman, Moebius, Michael Zulli, Paul Pope, Martin Wagner, Bill Willingham, Cam Kennedy, Stephen R Bissette, Don Simpson, Drew Hayes, Phil Yeh, Aleksander Zograf, James A Owens, Jana Christy, John Mitchell, Jana Christy\n\nVeitch created a series of strips titled Roarin' Rick's Rare Bit Fiends (a reference to Winsor McCay's Dream of the Rarebit Fiend), which first appeared as backup features in his self-published titles. In 1994 he began a full-sized Rare Bit Fiends series. King Hell published 21 issues of Rare Bit Fiends and has collected the first 20 in three paperback volumes, which also include essays by Veitch speculating about the nature of dreaming. The original series also reproduced dream comics submitted by readers.","torrent":{"xt":"urn:btih:66a74cbc55e0fac1b19ff5f3042485b0471bd86e","amp;dn":"ROARIN%26rsquo%3B+RICK%26rsquo%3BS+RARE+BIT+FIENDS+01-21+%281994-1996%29+%28Ki","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66a74cbc55e0fac1b19ff5f3042485b0471bd86e","infoHashBuffer":{"type":"Buffer","data":[102,167,76,188,85,224,250,193,177,159,245,243,4,36,133,176,71,27,216,110]},"announce":[],"urlList":[]}}