{"title":"RAHAN - Complete","uid":15399030,"size":3730132878,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:66b8aa2eb04feaf0ff0e78c113139932ea8e025f&amp;dn=RAHAN+-+Complete&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sever29","files":213,"time":1469433656,"description":"Rahan is a French comics series about an intelligent prehistoric man, that appeared first as part of Pif gadget starting in March 1969, then published in albums of 2 to 4 complete stories. It was initially written by Roger Lecureux, and after his death in 1999, by his son, Jean-François Lecureux. Most of the artwork is drawn by André Chéret, as well as some other artists (Enrique Romero, Zam, DeHuescar).\r\n\r\nAfter the destruction of his tribe in a volcano eruption, Rahan moves from land to land and tribe to tribe while spreading goodwill among those-who-walk-on-two-feet, and a powerful ethic of cooperation. With his open altruism often at odds with his powerful will to survive, Rahan's ethic is encompassed by the qualities represented by the bear-claw necklace he received from his dying adoptive father, Crao: courage, loyalty, generosity, resilience, wisdom. Also, after he gets married, he receives a sixth claw, the claw of curiosity. That is well deserved, since in every one of the more than 100 stories spread over 30 years and 3300 pages of illustration (as of June 2005), Rahan uses the scientific method to pick up some bit of knowledge from nature and spin it to some useful purpose - for himself, for some human tribe or even to help some animals in distress. He comes up with the catapult, the net, the fishing pole, the lens, diverts water for use in drinking and agriculture, flies on wings of leather, uses concave mirrors to concentrate the rays of the sun to heat caves and fight rampaging animals,.... Every adventure combines the positive social attitude of a true leader with the inventiveness of a true scientist.\r\n\r\nAll adventures are presented in a rich, realistic and consistent illustration by the masterful hand of the illustrator. The action jumps off the page and fairly comes to life, helping to make the lessons learned that much more memorable to the reader. The drawings are mainly signed by André Chéret. Some artwork was also provided by Romero, Guy Zam (French) and José de Huescar (French).\r\n\r\nRahan, the main character of this series is sometimes compared with Tarzan or Conan the Barbarian, though beyond the prehistoric, wild setting there are almost no similarities.\r\n\r\nIn 1986, Rahan was adapted into an animated series.\r\n\r\nIn 2006 a movie version was to be released, directed by Christophe Gans and starring Mark Dacascos in the title role but it has been postponed.\r\n\r\nThe black edition of Rahan which is still available for sale at several online stores was edited by Soleil Prod in 1998 and it's considered the most complete and beautifully crafted edition","torrent":{"xt":"urn:btih:66b8aa2eb04feaf0ff0e78c113139932ea8e025f","amp;dn":"RAHAN+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66b8aa2eb04feaf0ff0e78c113139932ea8e025f","infoHashBuffer":{"type":"Buffer","data":[102,184,170,46,176,79,234,240,255,14,120,193,19,19,153,50,234,142,2,95]},"announce":[],"urlList":[]}}