{"title":"SHAREGO EBOOK  Hollywood Sex, Immorality, and Insurrection in Am","uid":4625007,"size":5560932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66e5ecd76a216f47b346793b45fb7c0ce11cf27a&amp;dn=SHAREGO+EBOOK++Hollywood+Sex%2C+Immorality%2C+and+Insurrection+in+Am&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dodgerblue","files":1,"time":1231179107,"description":"SHAREGO EBOOK  Hollywood Sex, Immorality, and Insurrection in American Cinema; 1930-1934\n[img]http://i269.photobucket.com/albums/jj44/downarchive2/member2/2holyy.jpg[/img]\nPre-Code Hollywood: Sex, Immorality, and Insurrection in American Cinema, 1930-1934\nColumbia University Press | 1999-08-15 | English | ISBN: 0231110952 | 400 pages | PDF | 6 MB\n\nWho says the world of classic Hollywood moviemaking was never risquÃƒÂ©? We tend to think of black-and-white movies as representing a sanitized world, where crime never paid, ladies of the evening had hearts of gold, and married couples slept in separate beds. But in fact, censorship in American cinema didn't begin in earnest until 1934, when Will Hays and Joseph Breen began enforcing the legendary Hollywood production code. In this revelatory book, Thomas Doherty looks at sound movies of 1930-34--what is now known as the &quot;pre-code&quot; era.\n\nThis was a Hollywood of loose dames, hot whoopee, and coked-up killers who'd do anything for a pot of jack. It was a world that was often amoral and anarchic--an industry that allowed James Cagney and Paul Muni wild orgies of violence, openly flaunted the sexuality of Marlene Dietrich and Mae West, gave King Kong permission to crush cars and eat people, and allowed Tod Browning to make Freaks, one of the ghastliest, most sensationalistic, and greatest American movies.\n\nDoherty's book captures this mad universe beautifully, describing films in such delightful detail that you may find yourself tossing it on your couch and racing to the video store. He also documents the downfall of the period, the outrage that was leveled against early sound films, and the emerging code that repressed American movies for almost 30 years. Film fans reveling in the debauchery of Hollywood's naughtiest era will also want to see Mark A. Vieira's Sin in Soft Focus. --Raphael Shargel\n[img]http://1337x.org/torrentimg-9775.png[/img]\n","torrent":{"xt":"urn:btih:66e5ecd76a216f47b346793b45fb7c0ce11cf27a","amp;dn":"SHAREGO+EBOOK++Hollywood+Sex%2C+Immorality%2C+and+Insurrection+in+Am","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66e5ecd76a216f47b346793b45fb7c0ce11cf27a","infoHashBuffer":{"type":"Buffer","data":[102,229,236,215,106,33,111,71,179,70,121,59,69,251,124,12,225,28,242,122]},"announce":[],"urlList":[]}}