{"title":"US 10th Mountain Division in World War II","uid":11533428,"size":2846346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6731d9bd725d347aa8da0294e949bda0ea725b3b&amp;dn=US+10th+Mountain+Division+in+World+War+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1416600232,"description":"The 10th was the only American mountain division to be raised in World War II, and still has a high profile, being involved in operations from Iraq to Somalia and from Haiti to Afghanistan. It did not arrive in Europe until winter 1944/45, but then fought hard in the harsh mountainous terrain of Northern Italy until VE-Day five months later, losing c. 1,000 men killed and c. 3,000 wounded. Fighting in a series of battles in the Po Valley that included an amphibious assault across Lake Garda, the division made a key contribution to Allied victory in Europe.\n\nThe division was special in a number of ways. Its personnel were selected for physical fitness and experience in winter sports, mountaineering, and hunting, unlike the rest of the infantry. Since winter sports were at that time the preserve of the wealthy, the division's educational level was as unusually high as its fitness. It was highly trained in mountain and winter warfare, including the use of skis and snowshoes, while its organization, field clothing, and some personal equipment also differed from that of the usual infantry division. The division made extensive use of pack-mules, and its reconnaissance unit was horse-mounted, conducting the last horse-mounted charge in US history in April 1945.\n\nFeaturing full-color artwork and rare photographs, this is the gripping story of the US Army's only mountain division in action during the closing months of World War II","torrent":{"xt":"urn:btih:6731d9bd725d347aa8da0294e949bda0ea725b3b","amp;dn":"US+10th+Mountain+Division+in+World+War+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6731d9bd725d347aa8da0294e949bda0ea725b3b","infoHashBuffer":{"type":"Buffer","data":[103,49,217,189,114,93,52,122,168,218,2,148,233,73,189,160,234,114,91,59]},"announce":[],"urlList":[]}}