{"title":"Emmerdale - Episodes 00117-00123 December 1973 (VHSRip)","uid":11160686,"size":1282717696,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:67a256b53910faf2ec1abd565a547f37d7cd3c9b&amp;dn=Emmerdale+-+Episodes+00117-00123+December+1973+%28VHSRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rent420","files":7,"time":1412532836,"description":"Emmerdale, known as Emmerdale Farm until 1989, is a popular and critically acclaimed British soap opera that has aired on ITV since 1972. It is set in the fictional village of Emmerdale (known as Beckindale until 1994) in West Yorkshire, England, and was created by Kevin Laffan, with Steve Frost and Gavin Blyth serving as Executive Producer and Series Producer respectively since 2009.\n\nEmmerdale is the third most popular soap opera on British television, behind Coronation Street and EastEnders.\n\nThe series is produced by Yorkshire Television and broadcast on the ITV network, and was first aired on 16 October 1972. It was originally conceived and broadcast as a daytime programme in an afternoon slot, becoming an early evening programme in 1978 in most ITV regions - but excluding London and Anglia, both of which followed in the mid-1980s. Until the mid-1980s, Emmerdale took seasonal breaks and was not an all year round soap. The series was first broadcast over the Christmas holiday period in 1988.\n\nI wish I thank ALL of the cappers from TheBox.bz who shared these wonderful classic episodes. I have changed folder and files names for better organization and to protect those wonderful cappers. For episode summaries visit: http://emmerdale.wikia.com/wiki/Emmerdale_episodes\n\nEnjoy and please help seed if you can :-)\t\n\nOh and please feel free to share any and all of these episodes on other site if you want to :-)","torrent":{"xt":"urn:btih:67a256b53910faf2ec1abd565a547f37d7cd3c9b","amp;dn":"Emmerdale+-+Episodes+00117-00123+December+1973+%28VHSRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a256b53910faf2ec1abd565a547f37d7cd3c9b","infoHashBuffer":{"type":"Buffer","data":[103,162,86,181,57,16,250,242,236,26,189,86,90,84,127,55,215,205,60,155]},"announce":[],"urlList":[]}}