{"title":"Tekken 6 Pc Game - {Core-X}","uid":13000046,"size":879110728,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:67dd7be4137b86751f6664fa00a5045cb47b2910&amp;dn=Tekken+6+Pc+Game+-+%7BCore-X%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ranger.03","files":62,"time":1450190671,"description":"Description\r\nTekken 6 is a fighting game that has been developed by Namco Bandai. Tekken 6 is the 7th installment of the world acclaimed Tekken series. Tekken series had taken the world by storm since its first release in 1994 since then several installments have been introduced and a few movies have also been made. You can also download Tekken 5 PC Game.Tekken 6 has lots of improvements compared to its predecessor. There are fairly large areas associated to the fighting stages and now the character customization has also been improved. There has been an inclusion of a new Rage system by which the player will get more injuries. When he/she will be hit when he/she will reach a certain point. Once this system is activated a reddish energy aura will cover up the the character and the energy bar will turn red. Tekken 3 is another game that you can download.Then there is another feature included in this version and that is bound system. With this feature the player can hit the opponent hard. and once the opponent got hit. He will go in the stunned state and that is the time where you can hit the player with additional kicks or punches. The graphics of the game is quite stunning. and it has also a physical engine called Octave engine which will allow the water to behave like it should. Tekken 4 can also be downloaded.All in all Tekken 6 is a great game which will test your speed as well as skills","torrent":{"xt":"urn:btih:67dd7be4137b86751f6664fa00a5045cb47b2910","amp;dn":"Tekken+6+Pc+Game+-+%7BCore-X%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67dd7be4137b86751f6664fa00a5045cb47b2910","infoHashBuffer":{"type":"Buffer","data":[103,221,123,228,19,123,134,117,31,102,100,250,0,165,4,92,180,123,41,16]},"announce":[],"urlList":[]}}