{"title":"Newtown: An American Tragedy (2013) Matthew Lysiak (multi)","uid":9498740,"size":2501886,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68884a5910833255eae39ff40bc131f11fd2ba58&amp;dn=Newtown%3A+An+American+Tragedy+%282013%29+Matthew+Lysiak+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1390168090,"description":"Format: mobi/epub/azw3\nLength: 289 pages\nGenre: Non-Fiction/True Crime\nDate: 10 December 2013\n\n12/14/12\n\nSandy Hook Elementary School\n\nNewton, Connecticut\n\nTwenty-six people dead; twenty of them schoolchildren between the ages of six and seven. Now, here is the startling, comprehensive look at this tragedy, and into the mind of the unstable killer, Adam Lanza.\n\nDrawing on hundreds of interviews and a decade's worth of emails from Lanza's mother to close friends that chronicled his slow slide into mental illness, Newtown pieces together the perfect storm that led to this unspeakable act of violence that shattered so many lives.\n\nNewtown explores the two central theories that have permeated the media since the attack: some claim Lanza suffered from severe mental illness, while others insist that, far from being a random act of insanity, this was a meticulously thought out, premeditated attack at least two years in the making by a violent video-gamer so obsessed with &quot;glory kills&quot; and researching mass murderers that he was willing to go to any length to attain the top score.\n\nLanza's dark descent from a young boy with adjustment disorders to a calculating killer is interwoven with the Newtown massacre as it unfolded at the time, told from the points of view of eye witnesses, survivors, parents of victims, first responders, and Adam's relatives. A definitive account of a tragedy that shook a nation.\n\nAuthor:\n\nMatthew Lysiak is a staff writer for the Daily News (New York) who has received national recognition for his exclusive reporting on the shootings at Sandy Hook Elementary and the Newtown killer Adam Lanza, the Aurora gunman James Holmes, the Tucson shooter Jared Loughner, the Fort Hood army psychiatrist Nidal Malik Hasan, and more.\n\nAdam Verner is a full-time narrator and voice talent with over one hundred titles recorded. He is the recipient of AudioFile Earphones Awards for Pavilion of Women by Pearl S. Buck and The Big It by A. B. Guthrie, Jr.","torrent":{"xt":"urn:btih:68884a5910833255eae39ff40bc131f11fd2ba58","amp;dn":"Newtown%3A+An+American+Tragedy+%282013%29+Matthew+Lysiak+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68884a5910833255eae39ff40bc131f11fd2ba58","infoHashBuffer":{"type":"Buffer","data":[104,136,74,89,16,131,50,85,234,227,159,244,11,193,49,241,31,210,186,88]},"announce":[],"urlList":[]}}