{"title":"Hyperlight v1.3.6 Final By bobiras2009","uid":7476847,"size":26999901,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:6967499cca0500c55c41cfff7beea686d0c9878e&amp;dn=Hyperlight+v1.3.6+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1343312064,"description":"Ready for Hyperlight? Go faster than light and destroy everything on your way!\nâ˜… Hyperlight has got nominations for &quot;Most Innovative Game of the Year&quot; and &quot;Xperia PLAY Game of the Year&quot; by PocketGamer!\nâ˜… Hyperlight was featured by Apple on iPhone in &quot;New and Noteworthy&quot; and &quot;WHAT'S HOT&quot;\nâ˜… Xperia PLAY optimized!\n\nBurn your enemies faster-than-light in this innovative, psychedelic and super-fast retro arcade space shooter!\n\nYou control a stylized spaceship in a virtualized cosmic environment where evil beings try to reach you in order to turn off the last human hope. However your ship, the Hyperlight, posses a special power! if successfully used, it can wipe out all your foes: it can travel at faster-than-light speed (FTL) making it impossible for anyone to catch it and is also able to disintegrate everything it touches!\n\nWith simple gestures, you can move the Hyperlight at regular speed but also turn on its FTL engine to perform incredibly rapid attacks!\nControls are simple and you can choose from touch only controls, tilt only or the exotic tilt &amp; touch.\n\nThere are also dozens of power-ups and weapons you can easily activate simply by gathering them on the battlefield: the Hyperlight ship is able to use them automatically. Hyperlight is easy to play but hard to master, there are so many ways to improve your skills that you will find yourself playing it for months! For a complete list of all the gameplay secrets of this game see the guide included!\n\nCan you survive these incredible hordes of enemies?\nEnemies will try to do everything to stop you, assuming several attack formations, different strategies, also leaving powerful dimensional trails on the battlefield that only at FTL speed you can cross!\n\nAnd watch out for the evil commanders: huge bosses await the Hyperlight in the dark corners of the universe!\n\nFeatures:\n\n    Universal App: runs in HD on high-res Android devices.\n    Extremely innovative gameplay: burn your enemies faster-than-light!\n    3 Control systems to meet your taste: Virtual Joystick, Tilt only and Tilt &amp; Touch.\n    Stunning 2.5D neon-style graphics, effects and animated backgrounds.\n    Exciting techno and rock musics!\n    Arcade mode with 40 different levels.\n    Infinity mode for an endless fun.\n    Several huge bosses to face.\n    OpenFeint support, with leaderboards and 24 achievements.\n    Install to SD card supported! (~1Mb on internal memory)\n    Powered by Unity3D.\n\nWhat's in this version : (Updated : Jul 15, 2012)\n\n    Optimizations and Bugfix\n\nRequired Android O/S : 2.2+","torrent":{"xt":"urn:btih:6967499cca0500c55c41cfff7beea686d0c9878e","amp;dn":"Hyperlight+v1.3.6+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6967499cca0500c55c41cfff7beea686d0c9878e","infoHashBuffer":{"type":"Buffer","data":[105,103,73,156,202,5,0,197,92,65,207,255,123,238,166,134,208,201,135,142]},"announce":[],"urlList":[]}}