{"title":"T.Biedzki - 10 Bram Swiata [PL]","uid":12952951,"size":247482097,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:698ae9cc98c1e45e82ffd7cf75f92cf52eea3995&amp;dn=T.Biedzki+-+10+Bram+Swiata+%5BPL%5D+MP3%4096&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":21,"time":1449753451,"description":"Audiobook PL - 19 części /   \r\nrozmiar: 235 MB / czas: 05:42:37\r\nczyta: Roch Siemianowski\r\n\r\nZbiór reportaży i opowieści podróżniczych, które czyta się niemal jak najbardziej wciągającą powieść sensacyjną! Autor - polski podróżnik i globtroter - zjeździł niemal cały &quot;Trzeci Świat&quot; i przeżył wiele dramatycznych chwil... Spośród setek odwiedzonych miejsc i dziesiątek zapierających dech w piersiach przygód, które przeżył - wybrał do tej książki dziesięć, które wywarły na nim największe wrażenie, i poprzez nie zabiera czytelnika na krańce świata, pokonując również takie granice, których nie ma na mapach...\r\nDociera na Jawę, by towarzyszyć górnikom wydobywającym w skrajnie niebezpiecznych warunkach siarkę z dna czynnego wulkanu. Przenosi się do Indii, gdzie atakuje go nożownik i spotyka przerażających żebraków oraz &quot;Świętych Mężów&quot;. Płynie po Amazonce, przedziera się przez dżunglę i poznaje niezwykłego Indianina. W Boliwii unika śmiertelnie niebezpiecznego więzienia - przedostając się przez &quot;zieloną granicę&quot; do Peru, by uczestniczyć tam w krwawej ofierze potomków Inków. W afrykańskim Mali szuka zaginionego podczas wojny przyjaciela, a w dolinie rzeki Omo w Etiopii poznaje dzikie plamiona, których za kilka lat nie będzie - by zaraz potem uciekać stamtąd przed powodzią, w której ginie siedemset osób... W Betlejem pomaga ranionej przez izraelskich żołnierzy pięknej palestyńskiej dziewczynie, a dwa lata później poznaje w Damaszku jej ojca - syryjskiego terrorystę. W Stambułu podczas trzęsienia ziemi wali się hotel, w którym mieszka, w Kurdystanie opowiada mu o swoim życiu stary bojownik kurdyjski, który nienawidzi Turków - a w Nikozji poznaje skrzywdzonego przez los cypryjskiego Turka, który nienawidzi Greków...\r\n\r\nJest to książka o świecie, w którym natura, historia, nędza, okrucieństwa i wojny kształtują losy i charaktery ludzi. A równocześnie cudowna pięknem opisanych bohaterów, pełna emocji i wydarzeń nimal &quot;nie z tej ziemi&quot;.\r\nA kiedy się ją skończy, nasza fascynacja przygodą łączy się z ulgą - że żyjemy tu, a nie tam","torrent":{"xt":"urn:btih:698ae9cc98c1e45e82ffd7cf75f92cf52eea3995","amp;dn":"T.Biedzki+-+10+Bram+Swiata+%5BPL%5D+MP3%4096","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"698ae9cc98c1e45e82ffd7cf75f92cf52eea3995","infoHashBuffer":{"type":"Buffer","data":[105,138,233,204,152,193,228,94,130,255,215,207,117,249,44,245,46,234,57,149]},"announce":[],"urlList":[]}}