{"title":"Carbon Nanotubes - From Basic Research to Nanotechnology","uid":15520879,"size":5310443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a5ab42b40eaf7787a2e526ede061885db284e0f&amp;dn=Carbon+Nanotubes+-+From+Basic+Research+to+Nanotechnology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470750538,"description":"Carbon Nanotubes - From Basic Research to Nanotechnology - Valentin N. Popov, Philippe Lambin (Springer, 2006).pdf\r\n\r\nIt is about 15 years that the carbon nanotubes have been discovered by Sumio Iijima in a transmission electron microscope. Since that time, these long hollow cylindrical carbon molecules have revealed being remarkable nanostructures for several aspects. They are composed of just one element, Carbon, and are easily produced by several techniques. A nanotube can bend easily but still is very robust. The nanotubes can be manipulated and contacted to external electrodes. Their diameter is in the nanometer range, whereas their length may exceed several micrometers, if not several millimeters. In diameter, the nanotubes behave like molecules with quantized energy levels, while in length, they behave like a crystal with a continuous distribution of momenta. Depending on its exact atomic structure, a single-wall nanotube –that is to say a nanotube composed of just one rolled-up graphene sheet– may be either a metal or a semiconductor. The nanotubes can carry a large electric current, they are also good thermal conductors. It is not surprising, then, that many applications have been proposed for the nanotubes. At the time of writing, one of their most promising applications is their ability to emit electrons when subjected to an external electric field. Carbon nanotubes can do so in normal vacuum conditions with a reasonable voltage threshold, which make them suitable for cold-cathode devices","torrent":{"xt":"urn:btih:6a5ab42b40eaf7787a2e526ede061885db284e0f","amp;dn":"Carbon+Nanotubes+-+From+Basic+Research+to+Nanotechnology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a5ab42b40eaf7787a2e526ede061885db284e0f","infoHashBuffer":{"type":"Buffer","data":[106,90,180,43,64,234,247,120,122,46,82,110,222,6,24,133,219,40,78,15]},"announce":[],"urlList":[]}}