{"title":"I'll Drink to That - Betty Halbreich - Audiobook MP3","uid":11497844,"size":250212594,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6b7bd4f3068896ca3029281b150c1389f61afba8&amp;dn=I%27ll+Drink+to+That+-+Betty+Halbreich+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1416269389,"description":"\nA classic tale of personal transformation amid a stunning backdrop of old world glamour and current high style, Betty Halbreich moves from a trapped woman to a ferociously independent icon.\n\nEighty-six-year-old Betty Halbreich is a true original. A tough broad who could have stepped straight out of Stephen Sondheim's repertoire, she has spent nearly 40 years as the legendary personal shopper at Bergdorf Goodman, where she works with socialites, stars, and ordinary women off the street. She has helped many find their true selves through clothes, frank advice, and her own brand of wisdom. She is trusted by the most discriminating persons - including Hollywood's top stylists - to tell them what looks best. But Halbreich's personal transformation from a cosseted young girl to a fearless truth teller is the greatest makeover of her career.\n\nA Chicago native, Halbreich moved to Manhattan at 20 after marrying the dashing Sonny Halbreich, a true character right out of Damon Runyon who liked the nightlife of New York in the '50s. On the surface, they were a great match, but looks can be deceiving; an unfaithful Sonny was emotionally distant while Halbreich became increasingly anguished. After two decades, the fraying marriage finally came undone. Bereft without Sonny and her identity as his wife, she attempted suicide.\n\nMeticulous, impeccable, hardworking, elegant, and - most of all - delightfully funny, Halbreich has never been afraid to tell it to her clients straight. She won't sell something just to sell it. If an outfit or shoe or purse is too expensive, she'll dissuade you from buying it. As Halbreich says, &quot;There are two things nobody wants to face: their closet and their mirror.&quot; She helps women do both, every day","torrent":{"xt":"urn:btih:6b7bd4f3068896ca3029281b150c1389f61afba8","amp;dn":"I%27ll+Drink+to+That+-+Betty+Halbreich+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b7bd4f3068896ca3029281b150c1389f61afba8","infoHashBuffer":{"type":"Buffer","data":[107,123,212,243,6,136,150,202,48,41,40,27,21,12,19,137,246,26,251,168]},"announce":[],"urlList":[]}}