{"title":"The Corporation Nation 1 and 2","uid":6568821,"size":2505014124,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6ba8ec9da3306419874649701d812a72ee5e3f01&amp;dn=The+Corporation+Nation+1+and+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BoWLiN","files":3,"time":1311812807,"description":"Grabbed these from various sources and compiled them here. Enjoy =P\n-\n\nCorporation Nation Master\nIntroduction - The New Problem with No Name\n\nThe corporate mystique is a set of cherished beliefs and illusions at the very heart of American culture. We are all, in some measure, captives of the new mystique, which is at the root of the way we think about the most important institutions in our society-chief among them corporations themselves. The corporate mystique dictates how we think about not only what corporations are and the importance of their roles in our lives, but what government and markets, business and democracy, and the good life are all about. It is the main recipe for how to live and think in a corporate world. (Read the rest here.)\n\n-\nCorporation Nation 2 - The Great Pension Fund Hoax!\n\nThis 4 hour presentation is part 2 of the Corporation Nation series. While a shorter, condensed version will be released soon, The Great Pension Fund Hoax is presented as documentary evidence of corruption and greed within our government and as a reference work.\n\nThis is not for entertainment.\n\nUnderstanding this information about the Comprehensive Annual Financial Report (CAFR) system of accounting in government will answer the question that has eluded you for so long, just as it did me...\n\nWhy?\n\nWhy do corporations get away with murder? Why does government allow this to happen by passing laws and regulations, and deregulating the very framework that these corporations operate within, both nationally and internationally? Why are We, the People suffering at the hands of this oligarchical government, while our taxpayer dollars are being used against us? And why does there seem to be no difference between the private sector and the public one?\n\nAnswer: Because government owns it all!!! ","torrent":{"xt":"urn:btih:6ba8ec9da3306419874649701d812a72ee5e3f01","amp;dn":"The+Corporation+Nation+1+and+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba8ec9da3306419874649701d812a72ee5e3f01","infoHashBuffer":{"type":"Buffer","data":[107,168,236,157,163,48,100,25,135,70,73,112,29,129,42,114,238,94,63,1]},"announce":[],"urlList":[]}}