{"title":"The Quatermass Xperiment/Quatermass 2/X: The Unknown [FULLBD] [E","uid":9759601,"size":46870446279,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:6bca59bd28e59aa6f30bb971b14d99c8a0515586&amp;dn=The+Quatermass+Xperiment%2FQuatermass+2%2FX%3A+The+Unknown+%5BFULLBD%5D+%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"repopo","files":-1,"time":1394792709,"description":"This is the aussie release, sold on its own and as part of a Hammer Boxset.  Spanish subtitles have been added and are selectable on-the-fly. The main feature is:\n\nTHE QUATERMASS XPERIMENT (1955)\nA  missile, launched by the team led by Prof. Quatermass, lands in the English countryside. Of the three members of the crew, two have mysteriously disappeared. The third one, barely alive, undergoes an horrible metamorphosis turning into a monstrous &quot;thing&quot;. When he breaks out and, chased in vain by inspector Lomax, starts killing humans and animals to feed his transformation, Quatermass realizes that this is the way chosen by an alien form of life to invade the Earth.\n\nAs a bonus the next movies are enclosed also in HD (1080i/25fps)\n\nQUATERMASS 2 (1957)\nProfessor Quatermass, trying to gather support for Moon colonisation his project to colonize the Moon, is intrigued by the mysterious traces that have been showing up on his radar - meteorites crashing down?. Following them to the place where they should be landing he finds a destroyed village, a mysterious factory too close to his designs for the Moon colony for comfort, and some strange, aerodynamic objects containing a mysterious, ammonia-based gas that infects one of his assistants. Officially, the factory is producing synthetic food; but despite the veil of secrecy surrounding it Quatermass succeeds in finding out it harbours aliens with deadly designs on the Earth... Second in Hammer Films' trio of screen versions for Nigel Kneale's classic 1950s BBC serials, with the same director and star as 1955's &quot;The Quatermass Experiment&quot;.\n\nX: THE UNKNOWN (1956)\nBritish Army radiation drills at a remote Scottish base attract a subterranean, radioactive entity of unknown nature that vanishes, leaving two severely radiation-burned soldiers... and a &quot;bottomless&quot; crack in the earth. Others who meet the thing in the night suffer likewise, and with increasing severity; it seems to be able to &quot;absorb&quot; radiation from any source, growing bigger and bigger. What is it?? How do you destroy a thing that &quot;feeds&quot; on energy?\n","torrent":{"xt":"urn:btih:6bca59bd28e59aa6f30bb971b14d99c8a0515586","amp;dn":"The+Quatermass+Xperiment%2FQuatermass+2%2FX%3A+The+Unknown+%5BFULLBD%5D+%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bca59bd28e59aa6f30bb971b14d99c8a0515586","infoHashBuffer":{"type":"Buffer","data":[107,202,89,189,40,229,154,166,243,11,185,113,177,77,153,200,160,81,85,134]},"announce":[],"urlList":[]}}