{"title":"The Last Days of Pompeii","uid":10441590,"size":1585729764,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c51754076de3898b567e545b388e2940c7a1789&amp;dn=The+Last+Days+of+Pompeii&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"strawberry5","files":-1,"time":1403896319,"description":"IMDB:      \nThe Last Days Of Pompeii tells the story of a poor blacksmith in ancient Rome who becomes a gladiator and in turn a wealthy man, while his son, upon encountering Jesus, grows up to become a Christian. The film is a spectacle from the middle thirties, after the De Mille manner, which is to say it tries to look big but is actually, upon closer examination, at best mid-sized. RKO didn't really have the bucks to make a film on as lavish a scale as they surely would have wished. The film has many flaws, but also virtues.\n\nIt was made by the King Kong team of Ernest Schoedsak and Merian Cooper, who were very resourceful gentlemen, highly creative and not at all like other Hollywood film-makers, and therefore the movie has a unique style that's difficult to put into words.\n\n The best way I can describe their approach is to say that it's highly individual; its makers had their own way of doing things, and therefore told their their story, or more properly showed it, so that the movie doesn't resemble other films with similar themes. Also on the plus side is its cast, not of thousands, maybe of hundreds; more likely of dozens. In the leading role Preston Foster's anchors the film in a kind of emotional reality. He may not have been the most versatile of actors but he was a most sincere one, and he is excellent in the lead. Also good is Basil Rathbone as Pontius Pilate, surprisingly unhammy. \n\nIt's a very good movie overall, hokey as hell but always watchable, and in the end, while the spectacle of Mount Vesuvius erupting isn't all it might be, the movie as whole at least holds firm, and I for one was moved by it, not to tears maybe, but in a more modest way, by the smaller, more intimate tale of a good man who comes to his senses too late, at least for redemption in this world.\n\n\nCopyright Disclaimer:  Under Section 107 of the Copyright Act 1976, allowance is made for fair-use purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use, tips the balance in favour of fair use.","torrent":{"xt":"urn:btih:6c51754076de3898b567e545b388e2940c7a1789","amp;dn":"The+Last+Days+of+Pompeii","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c51754076de3898b567e545b388e2940c7a1789","infoHashBuffer":{"type":"Buffer","data":[108,81,117,64,118,222,56,152,181,103,229,69,179,136,226,148,12,122,23,137]},"announce":[],"urlList":[]}}