{"title":"[Blacks On Blondes] Black Meat White Feet (2016)","uid":14011253,"size":2643890522,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6d2738cd59dda1c60bebd023f7b6ffa8e8eda31f&amp;dn=%5BBlacks+On+Blondes%5D+Black+Meat+White+Feet+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":14,"time":1458828523,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=7611200991\r\n \nhttp://imagedisco.net/?g=72689350\r\n\r\n\r\n\r\nDescription:\r\n\r\nPlot:\r\n\r\nStarring: Casey Calvert, Cassidy Klein, Eva Angelina, Alura Jenson, Brooklyn Chase, Lola Foxx\r\n\r\nInterracial, Foot fetish and worship. Oral sex, foot jobs and cumming on feet.\r\n\r\nWe're bringing you THE Milf of all Milfs-Alura Jenson. Alura is 44-30-44 and nothing gets her juices flowing like a big black cock. Alura's only using her 8.5 size feet to keep that big black cock hard and, so far,it's mission accomplished. The busty, blonde cougar gets her gorgeous feet fucked by Jon Jon's huge slab of black porn. Her toes?Worshiped. Those arches? Completely fucked until her nearly cramps up. Alura's agenda is clear:Use her feet until that black meat spews all its creamy goodness. \r\n\r\nBrooklyn Chase works hard to keep her body looking as good as it does. Brian Pumper,her trainer, has her working out when her ankle gives out. This recent turn of bad luck can't come at a worse time: Brooklyn's supposed to go out dancing this evening with her boyfriend. Brian takes her back to the pad in order to give her feet some much needed TLC. Brooklyn's aches soon disappear when the flirting gets too much to ignore. A trip to the E.R takes a back seat to the interracial footjob that Pumper has ordered. Brooklyn's feet get played with and fucked like the beautiful box between her legs. The same feet that worked up a sweat are now gliding up and down a huge black cock. Brooklyn's arches get worked out and Brian's load of jizz covers her gorgeous feet. Miraculously her ankle pain disappears much like the commitment to her boyfriend.\r\n\r\nIt ain't easy for Casey Calvert to keep up that top notch physique. She's always running and keeping her body fit, and it looks as if it's about to catch up with her. Casey's injured her feet while running and it looks like Brian Pumper is there for the rescue. Brian's love of feet can only mean that he's well rounded in the art foot healing. Brian and Casey take things inside and the foot worship begins. Casey's aching feet experience the healing power via big black cock. Brian plays with this beautiful feet right before making love to her arches. Casey teases with her pussy while those feet go to town on an enormous black cock. The liquid medicine needed for Casey's feet arrives in the form of a hefty load of black gravy.\r\n\r\nThe members have spoken up, and we've listened. Oh sure, they like little, petite feet making big, black meat jizz...but Members wanted more. Much more. They want to watch our white Snowbunnies get railed by that BBC. Trust me when I tell you the Snowbunnies walked off set disappointed they didn't get banged out, too. So, starting with our Cassidy Klein update and moving forward, you're going to enjoy watching them use their feet, their mouths, and their little pink cunts in order to make their Black Bull squirt. Just take a look at Cassidy, too. What a piece of ass! After she tries on a couple pairs of sexy wedges for you, Rico Strong is going to walk on set and take over. He'll worship Cassidy's feet. Then, Rico's gonna stretch Cassidy's pussy wide open, literally loosening it up a few notches with every pump. After he's done having his way with Cassidy, Rico unloads all over those freshly pedicured little piggies. We know you're going to appreciate the direction Black Meat White Feet has taken, and we've got some mighty fine white girls already standing in line and ready to roll!","torrent":{"xt":"urn:btih:6d2738cd59dda1c60bebd023f7b6ffa8e8eda31f","amp;dn":"%5BBlacks+On+Blondes%5D+Black+Meat+White+Feet+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d2738cd59dda1c60bebd023f7b6ffa8e8eda31f","infoHashBuffer":{"type":"Buffer","data":[109,39,56,205,89,221,161,198,11,235,208,35,247,182,255,168,232,237,163,31]},"announce":[],"urlList":[]}}