{"title":"FINAL FANTASY XIV: Echoes of Nostalgia (1.XX BGM for FFXIV 2.0 A","uid":8589171,"size":376981753,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6e46af0ded55d3e2f24c6e06c541ac0ac5abf76d&amp;dn=FINAL+FANTASY+XIV%3A+Echoes+of+Nostalgia+%281.XX+BGM+for+FFXIV+2.0+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DarkSerenity","files":44,"time":1371596600,"description":"#########\n#####ALBUM\n\nFINAL FANTASY XIV: Echoes of Nostalgia\n\nNot really feeling the new sound score for A Realm Reborn? Prefer the music of the original FFXIV? This might be right up your alley!\n\n#########\n#####DESCRIPTION\n\nA selection of classic FINAL FANTASY XIV 1.XX music, composed almost entirely by the reknown Nobuo Uematsu.\nIt is intended for use with the new FINAL FANTASY XIV: A Realm Reborn, which has changed a lot of FFXIV's score in favor of Masayoshi Soken's music.\nEchoes of Nostalgia is, as you might have guessed, for players who, for any reason, prefer the original FINAL FANTASY XIV's soundtrack.\n\n#########\n#####NOTES\n\n* Please note that as this album is intended for use in-game, the tracks have been carefully fitted to loop, so some tracks will not have its original intro.\n* It is highly recommended that you set up keyboard shortcuts / hotkeys for playing/pausing in your favorite audio program if it has that functionality. Foobar2000 works splendidly.\n* Highly recommend using the Numpad keys on the right side of the keyboard for said hotkeys, though of course it is entirely up to you and your particular setup (you might be on a laptop for instance, so you'll have to find what hotkeys work best)\n* Probably won't be updating &quot;Unknown&quot; track names when BEFORE METEOR comes out, you can rename them yourself if that bothers you!\n\n#########\n#####FAQ\n\nQ1. But there's a BEFORE METEOR soundtrack coming out with all the music anyway!\nA1. Correct. However its tracks will probably have fade out like a typical soundtrack, which obviously isn't very effective for tracks that loop.\n\nQ2. The PS3 doesn't let me listen to music from the XMB in game!\nA2. Unfortunately, for PS3 games, it's up to the developers of the game to allow listening to music from the HDD, so the ball's in Square-Enix's court. Sony has nothing to do with it. Sorry! Yet another pro of playing the PC version! Maybe the PS4 will allow it?\n\nQ3. You left out -insert favorite track-!\nA3. Sorry! I went with the tracks a typical FFXIV player heard most of the time while playing the original version, as well as a few unused or untitled tracks that you can make your own context for. I did my best to cover all the major areas.\n\nQ4. A Realm Reborn has some 1.XX music in it anyway!\nA4. Yes, ARR DOES have some tracks from the original FFXIV as fans have been demanding it. However, some of the way it's used doesn't quite sit well with people, so this album was created!\n\nQ5. What about .DAT files?\nA5. While you might be able to replace the .DAT files in ARR, I personally have no experience with DAT mining and decided not to go that route. By all means if you find an effective way to replace the .DATs with music from this album, more power to you!\n\nQ6. Who compiled this album??? Who is the character on the cover?\nA6. A fellow FINAL FANTASY XIV player enlisted with The Maelstrom. Till sea swallows all!~","torrent":{"xt":"urn:btih:6e46af0ded55d3e2f24c6e06c541ac0ac5abf76d","amp;dn":"FINAL+FANTASY+XIV%3A+Echoes+of+Nostalgia+%281.XX+BGM+for+FFXIV+2.0+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e46af0ded55d3e2f24c6e06c541ac0ac5abf76d","infoHashBuffer":{"type":"Buffer","data":[110,70,175,13,237,85,211,226,242,76,110,6,197,65,172,10,197,171,247,109]},"announce":[],"urlList":[]}}