{"title":"Coast to Coast AM December 16 2012","uid":7933809,"size":58219860,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6edd855b012f7f0cb148893dce3a5114fe994faa&amp;dn=Coast+to+Coast+AM+December+16+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"runcdfirst","files":5,"time":1355781776,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-16-12\nHost: \tGeorge Knapp\nGuests: \tOliver Stone, Peter Kuznick, Kendall Carver\n\nIn the first half, George Knapp was joined by film director, Oliver Stone and Professor of History, Peter Kuznick, for a discussion on how the notion of American exceptionalism still warps Americans' understanding of their nation's history and role in the world. Stone was critical of the country &quot;only seeing history through American eyes&quot; and, as a result, &quot;it's unable to have a global empathy.&quot; Beyond merely this skewed perspective on the past, Kuznick noted that research shows &quot;only 12% of high school seniors are proficient in U.S. history.&quot; Over the course of his appearance in the first hour, Stone shared his thoughts on a number of historic topics which have served as subjects for his critically acclaimed films, such as the 1980's economy, the JFK assassination, and Vietnam.\n\nThe idea that the United States had to drop the atomic bomb on Japan in order to avoid an invasion was one belief which Kuznick called &quot;one of the great myths&quot; of American history. He explained that Japan knew by July of 1944 that they could not win the war and their strategy became &quot;how to get the best surrender terms&quot; via working with the Russians diplomatically and inflicting American casualties in the event of a ground war. However, Kuznick said, this plan dissolved when the United States convinced the Soviets to invade Japan following the end of the European conflict. As such, Kuznick declared, &quot;the thing that finally ends the war was not the atomic bombings, which most Americans believe, it's the Russian invasion.&quot; Since Japan had been trying to surrender, he said, the Soviets actually saw the atomic bombing as unnecessary and more of an indirect attack of the Russians.\n\n----------------------------------------------------\n\nIn the latter half, chairman of International Cruise Victims, Kendall Carver, talked about odd and mysterious disappearances on-board cruise ships and how the industry stonewalls investigations of crimes on the high seas. He recalled how his daughter, Merrian, disappeared from a cruise in August of 2004, which led him on a quest to find out what happened to her. Carver detailed how the cruise ship company forbid its employees from discussing the case with his investigators and repeatedly lied about video tape evidence which would have shed light on Merrian's fate. Based on his research, Carver revealed that Merrian's story is not unique and that once every two weeks someone disappears from a cruise ship.\n\nCarver also shared a number of other troubling details about the cruise ship industry, such as that they &quot;take the legal position that they are under no obligation to investigate a crime,&quot; whether it be a disappearance, sexual assault, or robbery. Additionally, the companies and their ships are registered in foreign countries, which makes criminal investigations the responsibility of those host nations and allows for the companies to avoid paying any U.S. taxes despite utilizing up to 21 different American government agencies. Furthermore, Carver lamented that many former high ranking FBI and Coast Guard officials later find employment with cruise ship companies and, thus, those agencies frequently work against efforts to hold the industry accountable for these crimes.\nWebsite(s):\n\n    oliverstone.com\n    Peter Kuznick Webpage\n    International Cruise Victims\n\nBook(s):\n\n    The Untold History of the United States\n\n","torrent":{"xt":"urn:btih:6edd855b012f7f0cb148893dce3a5114fe994faa","amp;dn":"Coast+to+Coast+AM+December+16+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6edd855b012f7f0cb148893dce3a5114fe994faa","infoHashBuffer":{"type":"Buffer","data":[110,221,133,91,1,47,127,12,177,72,137,61,206,58,81,20,254,153,79,170]},"announce":[],"urlList":[]}}