{"title":"Dungeon Hunter 5 v1.6.0g Mod APK + DATA","uid":12980599,"size":2048454949,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:6ef86716b140648599d5d512dfb9c8c4ff848e62&amp;dn=Dungeon+Hunter+5+v1.6.0g+Mod+APK+%2B+DATA&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tiropitaki","files":3,"time":1450031148,"description":"Dungeon Hunter 5 v1.6.0g (Mod)\r\n\r\nOnce again it's back with lots of new features and entertainment. This time you will find more actions and thrill in this game than before.\r\nAll the actions and moves are in super fast high speed and in real time. There are many modes included in the game.\r\nAll the modes are having unique challenges and warriors. You need to play all the mode and enjoy the game.\r\nIt provides you unlimited hours of game play with lots of fun and entertainment. There are many heroes included in the game.\r\nAll the heroes are having unique powers and skills in the game. You can use them to take enemy down very quickly.\r\nLots of weapons are included in the game. Upgrade your hero with more powerful weapons and armors and make him more powerful and skilful.\r\nGraphics of the game are created in very high quality.\r\n\r\nFeatures:\r\nHuge number of levels are there to play in the game.\r\nThis is the cooperative gameplay.\r\nYou can play the game in different play modes.\r\nYou can craft your own gear system.\r\nThere are 150 swords included in the game. Every sword is having unique kind\r\nof powers and abilities.\r\nVery easy to ply and understand but very challenging to become master in it.\r\nAnd many other interesting thing is there included in the game.\r\n\r\nWhat's new:\r\nTime to go further into the Forsaken Sands to unbury Legendary gear!\r\n- Discover the Boon Sister Temple, a new environment for the new missions!\r\n- Enter a 2-week-long event &amp; win special Christmas-branded gear &amp; minions!\r\n- Engage in a new Special Dungeon, overcome the new traps, defeat the Gatekeeper and get Ashkardian Tickets!\r\n- Equip the new Forsaken gear, and discover the new Legendary gear!\r\n- Use the Ashkardian Tickets to get a new Stronghold, and to reap 4 new minions to make it impregnable!\r\n\r\nWhat’s In The MOD: \r\nRapid Attack\r\nAnti-Ban\r\n\r\nPLEASE NOTE:\r\nIf you get a CONNECTION ERROR then uninstall memory hacking apps first like Gamekiller and freedom then try again\r\nIf you get a AMF INVALID LICENSE, you can get it from play store. Start downloading DH5 in the play store and when download starts cancel it.\r\n\r\nUninstall any previous version, Install APK,place data folder in SDcard/Android/obb/ and play.\r\nRequires Android: 4.0 and Up","torrent":{"xt":"urn:btih:6ef86716b140648599d5d512dfb9c8c4ff848e62","amp;dn":"Dungeon+Hunter+5+v1.6.0g+Mod+APK+%2B+DATA","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ef86716b140648599d5d512dfb9c8c4ff848e62","infoHashBuffer":{"type":"Buffer","data":[110,248,103,22,177,64,100,133,153,213,213,18,223,185,200,196,255,132,142,98]},"announce":[],"urlList":[]}}