{"title":"Triads, Yardies &amp; Onion Bhajees","uid":5527666,"size":587097966,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f99291d3dec37e31b5f48c249053c3d5be73ba5&amp;dn=Triads%2C+Yardies+%26+Onion+Bhajees&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LFC_SL","files":1,"time":1272827911,"description":"Triads, Yardies &amp; Onion Bhajees dvdrip 'lasty'\n\n\nSYNOPSIS\n\nThis ain't BEND IT LIKE BECKHAM... this ain't EAST IS EAST... this is SOUTHALL!\n\nWelcome to London. Home of many creeds and cultures. The modern criminal underworld reflects the diverse races that call London home.\n\nWEST LONDON is ruled by the HOLY SMOKES crime syndicate. At their head is the ruthless Chacha (Jas Vassi). His mob include the psychopathic killer Rocky (Sukie G), the drug addict Abz (Fran Labbe) and the gentleman gangster Jaz (Ashvin Joshi). To enforce his rule over his minions Chacha uses Singh (Manish Patel), his most trusted and ruthless hitman. Although the HOLY SMOKES rule all of West London, their base is Southall, the stronghold of the Asian community.\n\nNORTH LONDON is the territory of the TRIADS. These ruthless Chinese gangsters will do anything to protect their honour. Leading them is the young Billy Chan (Peter Peralta). An outsider has killed one of his men Li Fung (Alex Fung) and Billy swears vengeance! Among Billy's army of thugs is Ho Lin Wun (Ernesto Leszek) the ruthless assasin who likes to cut his enemies fingers off for pleasure and amusement.\n\nSOUTH LONDON is governed by the YARDIES, the Jamaican mafia. At the head of this notorious crew is Lloyd (Native). This gang lives purely for the day and their motto is 'Live Fast and Die Young!'. Utterly without fear Lloyd hangs with his trusted men Rufus (Richard Angol) and Errol (Charles Udemezue). However, there is a thorn in Lloyds side - His sister, Tia (Jamille Riverol), lives with a rival gangster, Jaz from the Holy Smokes.\n\nEAST LONDON is home to the FIRM. The last stronghold of the original Anglo-Saxon cockney gangsters is ruled by Mad Dave (Dave Courtney). They cannot understand how London has come to be ruled by the ethnic mobsters. They will not give up East London without a fight to the death. Mad Dave makes the HOLY SMOKES an offer they cannot refuse but one of his men Big Kev (Peter Rnic) has other ideas.\n\nSomeone is muscling on the HOLY SMOKES cocaine deals and they are not amused. Added to this deadly event is the theft of SIX MILLION DOLLARS from Heathrow Airport making an explosive cocktail! Hot on the trail of the missing money is the Metropolitan Police's most corrupt officer Detective Inspector Greaves (Jonathan Reason). It's a roller-coaster ride as THE HOLY SMOKES wage war against the TRIADS, YARDIES and THE FIRM...\n\nwho rules LONDON?","torrent":{"xt":"urn:btih:6f99291d3dec37e31b5f48c249053c3d5be73ba5","amp;dn":"Triads%2C+Yardies+%26+Onion+Bhajees","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f99291d3dec37e31b5f48c249053c3d5be73ba5","infoHashBuffer":{"type":"Buffer","data":[111,153,41,29,61,236,55,227,27,95,72,194,73,5,60,61,91,231,59,165]},"announce":[],"urlList":[]}}