{"title":"Complete Uncensored Journal News","uid":14941039,"size":17922801065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fac0c090cb019e7b0c692b7953e12f0c1ed1407&amp;dn=Complete+Uncensored+Journal+News&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MatrixSystem","files":499,"time":1466019445,"description":"Congressional Record--Appendix, pp. A34-A35\r\n\r\n\r\nCURRENT COMMUNIST GOALS\r\n\r\n\r\n1. U.S. acceptance of coexistence as the only alternative to atomic war.\r\n\r\n2. U.S. willingness to capitulate in preference to engaging in atomic war.\r\n\r\n3. Develop the illusion that total disarmament [by] the United States would be a demonstration of moral strength.\r\n\r\n4. Permit free trade between all nations regardless of Communist affiliation and regardless of whether or not items could be used for war.\r\n\r\n5. Extension of long-term loans to Russia and Soviet satellites.\r\n\r\n6. Provide American aid to all nations regardless of Communist domination.\r\n\r\n7. Grant recognition of Red China. Admission of Red China to the U.N.\r\n\r\n8. Set up East and West Germany as separate states in spite of Khrushchev's promise in 1955 to settle the German question by free elections under supervision of the U.N.\r\n\r\n9. Prolong the conferences to ban atomic tests because the United States has agreed to suspend tests as long as negotiations are in progress.\r\n\r\n10. Allow all Soviet satellites individual representation in the U.N.\r\n\r\n11. Promote the U.N. as the only hope for mankind. If its charter is rewritten, demand that it be set up as a one-world government with its own independent armed forces. (Some Communist leaders believe the world can be taken over as easily by the U.N. as by Moscow. Sometimes these two centers compete with each other as they are now doing in the Congo.)\r\n\r\n12. Resist any attempt to outlaw the Communist Party.\r\n\r\n13. Do away with all loyalty oaths.\r\n\r\n14. Continue giving Russia access to the U.S. Patent Office.\r\n\r\n15. Capture one or both of the political parties in the United States.\r\n\r\n16. Use technical decisions of the courts to weaken basic American institutions by claiming their activities violate civil rights.\r\n\r\n17. Get control of the schools. Use them as transmission belts for socialism and current Communist propaganda. Soften the curriculum. Get control of teachers' associations. Put the party line in textbooks.\r\n\r\n18. Gain control of all student newspapers.\r\n\r\n19. Use student riots to foment public protests against programs or organizations which are under Communist attack.\r\n\r\n20. Infiltrate the press. Get control of book-review assignments, editorial writing, policymaking positions.\r\n\r\n21. Gain control of key positions in radio, TV, and motion pictures.\r\n\r\n22. Continue discrediting American culture by degrading all forms of artistic expression. An American Communist cell was told to &quot;eliminate all good sculpture from parks and buildings, substitute shapeless, awkward and meaningless forms.&quot;\r\n\r\n23. Control art critics and directors of art museums. &quot;Our plan is to promote ugliness, repulsive, meaningless art.&quot;\r\n\r\n24. Eliminate all laws governing obscenity by calling them &quot;censorship&quot; and a violation of free speech and free press.\r\n\r\n25. Break down cultural standards of morality by promoting pornography and obscenity in books, magazines, motion pictures, radio, and TV.\r\n\r\n26. Present homosexuality, degeneracy and promiscuity as &quot;normal, natural, healthy.&quot;\r\n\r\n27. Infiltrate the churches and replace revealed religion with &quot;social&quot; religion. Discredit the Bible and emphasize the need for intellectual maturity which does not need a &quot;religious crutch.&quot;\r\n\r\n28. Eliminate prayer or any phase of religious expression in the schools on the ground that it violates the principle of &quot;separation of church and state.&quot;\r\n\r\n29. Discredit the American Constitution by calling it inadequate, old-fashioned, out of step with modern needs, a hindrance to cooperation between nations on a worldwide basis.\r\n\r\n30. Discredit the American Founding Fathers. Present them as selfish aristocrats who had no concern for the &quot;common man.&quot;\r\n\r\n31. Belittle all forms of American culture and discourage the teaching of American history on the ground that it was only a minor part of the &quot;big picture.&quot; Give more emphasis to Russian history since the Communists took over.\r\n\r\n32. Support any socialist movement to give centralized control over any part of the culture--education, social agencies, welfare programs, mental health clinics, etc.\r\n\r\n33. Eliminate all laws or procedures which interfere with the operation of the Communist apparatus.\r\n\r\n34. Eliminate the House Committee on Un-American Activities.\r\n\r\n35. Discredit and eventually dismantle the FBI.\r\n\r\n36. Infiltrate and gain control of more unions.\r\n\r\n37. Infiltrate and gain control of big business.\r\n\r\n38. Transfer some of the powers of arrest from the police to social agencies. Treat all behavioral problems as psychiatric disorders which no one but psychiatrists can understand [or treat].\r\n\r\n39. Dominate the psychiatric profession and use mental health laws as a means of gaining coercive control over those who oppose Communist goals.\r\n\r\n40. Discredit the family as an institution. Encourage promiscuity and easy divorce.\r\n\r\n41. Emphasize the need to raise children away from the negative influence of parents. Attribute prejudices, mental blocks and retarding of children to suppressive influence of parents.\r\n\r\n42. Create the impression that violence and insurrection are legitimate aspects of the American tradition; that students and special-interest groups should rise up and use [&quot;]united force[&quot;] to solve economic, political or social problems.\r\n\r\n43. Overthrow all colonial governments before native populations are ready for self-government.\r\n\r\n44. Internationalize the Panama Canal.\r\n\r\n45. Repeal the Connally reservation so the United States cannot prevent the World Court from seizing jurisdiction [over domestic problems. Give the World Court jurisdiction] over nations and individuals alike.\r\n\r\nDONT LET THESE DOCTRINES CONTROL YOUR LIFE. NOW IT IS TIME TO ACT","torrent":{"xt":"urn:btih:6fac0c090cb019e7b0c692b7953e12f0c1ed1407","amp;dn":"Complete+Uncensored+Journal+News","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fac0c090cb019e7b0c692b7953e12f0c1ed1407","infoHashBuffer":{"type":"Buffer","data":[111,172,12,9,12,176,25,231,176,198,146,183,149,62,18,240,193,237,20,7]},"announce":[],"urlList":[]}}