{"title":"Rubber Nanocomposites{BBS}","uid":6862447,"size":14185462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70a063344fbbf86020273df96ab2f97a52d394f6&amp;dn=Rubber+Nanocomposites%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322949344,"description":"For most of the applications, rubber must be reinforced with certain fillers such as carbon blacks, silica or clay. As compared with microfiller reinforced rubber, nanofiller reinforced rubber exhibit high degree of hardness, modulus, anti-aging and gas barrier properties. Rubber-layered silicate, nanotubes and nanosized spherical particles have therefore attracted much attention recently because of their outstanding properties. Thomas and Stephen offer a systematic introduction to and an in-depth discussion of rubber nanocomposities.\n\n    * First book dealing exclusively with rubber nanocomposites\n    * Written by a global author team working in both academia and industry\n    * Offers complete coverage of rubber nanocomposites:\n    * Preparation\n    * Characterization\n    * Morphology\n    * Properties\n    * Applications\n    * Arms readers with up-to-date technical research accomplishments\n    * Presents applications of rubber nanocomposites in various engineering fields\n\nRubber Nanocomposites: Preparation, Properties and Applications is an essential and valuable reference for researchers in the fields of Chemistry, Material Sciences and Polymer Chemistry. Engineers and rubber technologists from polymer, automobile, chemicals, and tire industry would also find this handbook useful.\nAbout the Author\nDr. Sabu Thomas is a professor of Polymer Science and Technology at Mahatma Gandi University, India where he teaches M. Sc and M. Phil level students in Poymer Science &amp; Technology. He was the lead co-author of Micro and Nanostructured Multiphase Polymer Blend Systems - Phase Morphology and Interfaces (2005, Taylor &amp; Francis) and also a chaper contributor for many books in the field including Polymer Blends (2000, Wiley). He recieved Ph.D in Polymer Science and Engineering in 1987 from Indian Institute of Technology, Kharagpur, India\n\nDr. Ranimol Stephen received his PhD in 2005 from Mahatma Gandhi University and has been working at the university as a Senior Research Fellow of School of Chemical Sciences.\nProduct Details\n\n    * Hardcover: 896 pages\n    * Publisher: Wiley; 1 edition (August 3, 2009)\n    * Language: English\n    * ISBN-10: 0470823453\n    * ISBN-13: 978-0470823453","torrent":{"xt":"urn:btih:70a063344fbbf86020273df96ab2f97a52d394f6","amp;dn":"Rubber+Nanocomposites%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70a063344fbbf86020273df96ab2f97a52d394f6","infoHashBuffer":{"type":"Buffer","data":[112,160,99,52,79,187,248,96,32,39,61,249,106,178,249,122,82,211,148,246]},"announce":[],"urlList":[]}}