{"title":"Life Sucks","uid":8653423,"size":70098196,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7102fb1f421e2e8382284cca1f7a7617b17a9282&amp;dn=Life+Sucks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1373157472,"description":"'Life Sucks'\n\nFirst Second, 2008, 193 pages\n\nWritten and Illustrated by Jessica Abel, Gabe Soria, Warren Pleece\n\nLife sucks for Dave Marshall\n\nDave is a poor vampire, working the night shift at the 24-hour convenience store run by his vampire master, Lord Radu Arisztidescu, who thinks Dave is pretty much a wuss as a bloodsucker. Truth is, Dave would rather steal his nutrition from a blood bank than kill the innocent. But this choice leaves him weak and vulnerable to more predatory types like alpha-vampire surfer dude Wes, who's making a move on Rosa, the Latina gothic babe Dave has his eye on. There's plenty of humor with Dave's friend Jerome acting as a Clerks-like foil, coming over to Dave's work at night when the black-eyeliner crowd comes by (the Running of the Goths). Life Sucks also gets a good deal of mileage out of the ironic distance between the romantic visions that Rosa and her mortal crowd have of the vampire lifestyle and the grimy reality of Dave's life as an eternal wage slave. Even if it doesn't pan out satisfactorily (the conclusion seems particularly truncated), Abel and Soria's light approach, combined with Pleece's bright, Technicolor art, gives the book an entertaining Joss Whedon gloss to its Gen-Y bloodsucking melodrama.","torrent":{"xt":"urn:btih:7102fb1f421e2e8382284cca1f7a7617b17a9282","amp;dn":"Life+Sucks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7102fb1f421e2e8382284cca1f7a7617b17a9282","infoHashBuffer":{"type":"Buffer","data":[113,2,251,31,66,30,46,131,130,40,76,202,31,122,118,23,177,122,146,130]},"announce":[],"urlList":[]}}