{"title":"The Truth About Men The Secret Side of the Opposite Sex By Ian K","uid":9297266,"size":3941685,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7148af4a82f204f45cc1340160d836ae7b981710&amp;dn=The+Truth+About+Men+The+Secret+Side+of+the+Opposite+Sex+By+Ian+K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":5,"time":1386176645,"description":"Men don't have glass heads. And there's a smart, successful mini-category of books to address this biological oversight - from The Rules to Think Like A Guy. Ian Smith's What Men Really Want is a great entry to that mini-category. It's rich with insight and information because it's written by a man to decode men for women. Smith's thoughtful, sometimes surprising principles include: The Subtle Art of Hooking Us (men really do want to be in committed relationships, even if they don't always show it); Beauty Matters (but beauty may not be exactly what you think it is); Beware of Titles (why you shouldn't label yourself his girlfriend until certain conditions are met) Sex is More Powerful than an AK-47 (but it doesn't always have to be a home run); Mean What You Say (and why sex lies are always-always-a bad idea); and Know How to Listen and What we Care About (and we don't care about home decorating). Any man who picks up What Men Really Want will nod in agreement, and any woman who puts its insights into practice will have an instantly happier mate and a stronger, longer relationship.","torrent":{"xt":"urn:btih:7148af4a82f204f45cc1340160d836ae7b981710","amp;dn":"The+Truth+About+Men+The+Secret+Side+of+the+Opposite+Sex+By+Ian+K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7148af4a82f204f45cc1340160d836ae7b981710","infoHashBuffer":{"type":"Buffer","data":[113,72,175,74,130,242,4,244,92,193,52,1,96,216,54,174,123,152,23,16]},"announce":[],"urlList":[]}}