{"title":"Alex Jones Show - 2012 Feb 15 WE [sebaygo1]","uid":7035767,"size":68379264,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7260acdaae2bfc0d442b1b741e941d4efd576e3b&amp;dn=Alex+Jones+Show+-+2012+Feb+15+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":8,"time":1329372349,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 15 February 2012\n\n\n[sebaygo1]\n\n\nFrom the Infowars web site ::\n\nAlex talks with the New York Times best-selling author, blogger, and survival retreat consultant James Wesley Rawles. His latest book, Survivors: A Novel of the Coming Collapse, is available at the Infowars Store. Rawles is the editor of SurvivalBlog.com, a popular blog on survival and preparedness topics. The blog has been described as &quot;the guiding light of the prepper movement.&quot; Rawles also authored the international bestseller How to Survive the End of the World as We Know It: Tactics, Techniques, and Technologies for Uncertain Times, a non-fiction book drawn primarily from posts featured on his blog. \n\nAlex also talks with British politician and outspoken critic of the European Union, Nigel Farage. He is the leader of the UK Independence Party and is a Member of the European Parliament. Farage also co-chairs the Europe of Freedom and Democracy group.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:7260acdaae2bfc0d442b1b741e941d4efd576e3b","amp;dn":"Alex+Jones+Show+-+2012+Feb+15+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7260acdaae2bfc0d442b1b741e941d4efd576e3b","infoHashBuffer":{"type":"Buffer","data":[114,96,172,218,174,43,252,13,68,43,27,116,30,148,29,78,253,87,110,59]},"announce":[],"urlList":[]}}