{"title":"Character Mentor - Tom Bancroft .epub","uid":9299058,"size":8033567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:726ac8584f6e8e08125b7785408f76cbaa3b100f&amp;dn=Character+Mentor+-+Tom+Bancroft+.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1386212490,"description":"You've researched your character extensively, tailored her to your audience, sketched hundreds of versions, and now you lean back content as you gaze at your final character model sheet. But now what? Whether you want to use her in an animated film, television show, video game, web comic, or children's book, you're going to have to make her perform. How a character looks and is costumed starts to tell her story, but her body language reveals even more. Character Mentor shows you how to pose your character, create emotion through facial expressions, and stage your character to create drama. Author Tom Bancroft addresses each topic with clear, concise prose, and then shows you what he really means through commenting on and redrawing artwork from a variety of student &quot;apprentices.&quot; His assignments allow you to join in and bring your drawing to the next level with concrete techniques, as well as more theoretical analysis. Character Mentor is an apprenticeship in a book.\n\nProfessional artists from a variety of media offer their experience through additional commentary. These include Marcus Hamilton (Dennis the Menace), Terry Dodson (X-Men), Bobby Rubio (Pixar), Sean &quot;Cheeks&quot; Galloway (Spiderman animated), and more. With a foreword by comicbook artist Adam Hughes, who has produced work for DC, Marvel Comics, Lucasfilm, Warner Bros. Pictures, and other companies.","torrent":{"xt":"urn:btih:726ac8584f6e8e08125b7785408f76cbaa3b100f","amp;dn":"Character+Mentor+-+Tom+Bancroft+.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"726ac8584f6e8e08125b7785408f76cbaa3b100f","infoHashBuffer":{"type":"Buffer","data":[114,106,200,88,79,110,142,8,18,91,119,133,64,143,118,203,170,59,16,15]},"announce":[],"urlList":[]}}