{"title":"Winged Migration (2001), DVDR(divx), NL Subs, DMT","uid":5972595,"size":945064219,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:728070ed2003d71fb2b227f0842be89b8cf61733&amp;dn=Winged+Migration+%282001%29%2C+DVDR%28divx%29%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MeMar","files":-1,"time":1290344902,"description":"Winged Migrations (2001), DVDR(divx), NL Subs, DMT\nOriginele titel: Le Peuple Migrateur \nDocumentaire\n85 minuten\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0301727/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0301727/&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Winged_Migration&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Winged_Migration&lt;/a&gt;\n\nGedurende het hele jaar trekken overal ter wereld miljoenen vogels door het luchtruim. \nDeze reizen markeren al sinds mensenheugenis de opeenvolging van seizoenen. Ze \ngeven ritme aan de voortschrijdende tijd en zelfs aan het leven van de mens zelf, \nbeneden op de grond. Volgen van vogels, het beter leren kennen en begrijpen van \nde wetten en regels die ten grondslag aan de duizelingwekkende trektochten van \nde vliegende wezens. Dat is de eeuwenoude droom die een groep cineasten en \nornithologen wilde realiseren. Jaren van voorbereiding en geduld, het gebruik van \nde modernste technologie, veel wilskracht en bovenal een jeugdige geest waren \nnodig voor deze unieke zoektocht naar het 'trekkersvolk'.\n\n\n\n\nDocumentary on the migratory patterns of birds, shot over the course of three years on all\n seven continents.\nStoryline\nThis documentary follows several species of migratory birds over a four year filming period. These \nirds travel several hundreds if not thousands of miles toward the equator in the autumn, and \nmakethe return journey to their higher latitude summer homes in the spring, always taking the same \nroute, using the natural compasses of the universe, the stars, to find their way. Some species, like the\n arctic tern, even fly from pole to pole. These long and often torturous treks are a matter of survival, \n to live in a hospitable climate and find sources of food. With the exception of migratory penguins, \ntravel over oceans is especially difficult as the birds have little refuge unless there is something \nfloating on the water, such as a ship, on which to land. Otherwise they must continue flying until they \nreach land. Some will not survive the migration due to predators, including man, illness or injury... \n\n","torrent":{"xt":"urn:btih:728070ed2003d71fb2b227f0842be89b8cf61733","amp;dn":"Winged+Migration+%282001%29%2C+DVDR%28divx%29%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"728070ed2003d71fb2b227f0842be89b8cf61733","infoHashBuffer":{"type":"Buffer","data":[114,128,112,237,32,3,215,31,178,178,39,240,132,43,232,155,140,246,23,51]},"announce":[],"urlList":[]}}