{"title":"Amos &amp; Andy Disk 1.rar","uid":4702063,"size":2255522880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:734818f33f7368942966605a2ee8bf6c0454766a&amp;dn=Amos+%26+Andy+Disk+1.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Malinkaz","files":-1,"time":1233707478,"description":"Amos 'n Andy, was first broadcast on CBS television in June 1951, and lasted some two years before the program was canceled in the midst of growing protest by the black community in 1953. It was the first television series with an all-black cast (the only one of its kind to appear on prime-time, network television for nearly another twenty years).\n\nThe adventures of Amos 'n Andy presented the antics of Amos Jones, an Uncle Tom-like, conservative; Andy Brown, his zany business associate; Kingfish Stevens, a scheming smoothie; Lawyer Calhoun, an underhanded crook that no one trusted; Lightnin,' a slow-moving janitor; Sapphire Stevens, a nosey, loud-mouth; Mama, a domineering mother-in-law, and the infamous Madame Queen. The basis for these characters was derived largely from the stereotypic caricatures of African-Americans that had been communicated through several decades of popular American culture, most notably, motion pictures.\n\nThe program's portrayal of black life and culture was deemed by the black community of the period as an insulting return to the days of blackface and minstrelsy. Eventually, the controversy surrounding the television version of Amos 'n Andy would almost equal that of the popularity of the radio version.\n\nContemporary television viewers might find it difficult to understand what all the clamor was about. Why did the Amos 'n Andy show go on to become one of the most protested of television programs? \n\nNow you can judge for yourself.....\n\n\nSeason 1              \n\nMissing 1. Sapphire's Sister\nThe Kingfish tries to get rid of Sapphire's sister by arranging a marriage between her and Andy, then learns she has $10,000 of savings in the bank.\n\n2. Seeing Is Believing\nSapphire thinks the Kingfish is secretly dating another woman, so she decides to make him jealous by having dinner alone with Andy.\n\n3. Leroy's Suits\nThe Kingfish stages a clothing sale at the Lodge using a lieutenant's entire wardrobe.\n\n4. Counterfeiters Rent Basement\nAndy is a hero when he overpowers a gang of counterfeiters and collects a fat reward.\n\n5. Kingfish has a Baby\nThe Kingfish decides to reform because he thinks he is about to become a father.\n\n6. Kingfish's Secretary\nThe Kingfish mistakenly signs a letter requesting a mail order bride with a letter requesting a wash woman for the building.\n\n7. Kingfish Gets Drafted\nWhen the Kingfish gets drafted, his wife and his lodge brothers applaud but soon change their tune when his outfit is to go overseas.\n\n8. The Ballet Tickets\nThe Kingfish gives Sapphire some stolen ballet tickets which land her in jail. She ends up in jail a second time when the Kingfish gives her a phony five dollar bill.\n\n9. The Boarder\nSapphire maintains that her boarder, a singer with a large appetite, is a cultural asset, but to the Kingfish he is a gorging freeloader.\n\n10. Arabia\nThe Kingfish sets up a phony raffle that forces him to wind up in Arabia drilling for oil, trying to earn enough money to get home.\n\nMissing 11. The Race Horse\nThe Kingfish gets conned when Andy sells him a broken down race horse.\n\nMissing 12. Andy Gets Married\nDouble trouble for Andy, he has gotten engaged to two women.\n\n13. The Piggy Bank\nThe Kingfish has been stealing money from Sapphire's piggy bank and wins a quiz show jackpot just in time for his and Sapphire's 25th anniversary.\n\n14. Superfine Brush\nThe Kingfish pushed by Sapphire to get a job, becomes a door-to-door salesman, persuading Andy to take over at no salary.\n\n15. The Kingfish Teaches Andy to Fly\nThe Kingfish teaches Andy to fly, so that he can win back his girl from a motor boat enthusiast.\n\n16. The Kingfish Becomes a Press Agent\nThe Kingfish takes a job as a press agent in order to make money to pay Andy off and get his mother-in-law's diamond pin back, but things don't work out.\n\n17. Hospitalization\nAndy buys hospitalization insurance from the Kingfish and then relaxes in the hospital, turning the Kingfish frantic with bills he can't pay.\n\n**** 18. Sapphire's Mysterious Admirer\nThe Kingfish believes that Sapphire is in love with another man and that she and her beau are planning to get rid of him.\n\n19. The Adoption\nThe Kingfish falls in love with a baby which is up for adoption, but instead is stuck with Horrible Horace, Sapphire's pesty nephew.\n\n20. The Broken Clock\nAndy and the Kingfish accidentally become involved with a top military secret and the FBI when they mistakenly take a new secret altimeter clock for a replacement for their broken one.\n\n21. Mr. Jackson Comes to Town\nThe Kingfish goes on a self-improvement course because Sapphire goes overboard over an ex-boyfriend and former Mr. America .\n\n22. Cousin Effie's Will\nThe Kingfish adopts Andy so that he will become eligible for a $2000 bequest under the terms of Cousin Effie's will.\n\nMissing 23. Restitution\nWhile trying to do a good deed and repay a jeweler for the use of his electricity, the Kingfish becomes a fugitive from justice when he accidentally trips the store's burglar alarm.\n\n24. Andy Falls in Love with an Actress\nAndy, jealous over his girlfriend's amorous scenes in a play, decides to become an actor.\n\n25. Kingfish at the Ballgame\nThe Kingfish sells Andy a ring he finds in his crackerjack box before he finds out how valuable the ring really is.\n\n26. Story of the Invisible Glass\nThe Kingfish gets into the stock market and sells everyone short, including himself.\n\n27. The Kingfish Buys a Chair\nThe Kingfish buys an old chair stuffed with money and then, not knowing the money is in the chair, he gives it away.\n\n28.Rare Coin (pilot)\nThe Kingfish swindles Andy out of a rare coin and Andy swindles it right back by use of a clever trick in a phone booth coin slot.\n\nMissing 29. Andy Goes into Business\nAndy goes into business and the Kingfish decides he wants to get in on the deal.\n\n30. New Neighbors\nWhile trying to get rid of neighbors who borrow everything, the Kingfish uses the crying of a baby and a sound effects record, but the plan backfires as the Kingfish is about to be evicted.\n\n31.The Lodge Brothers Complain\nThe Kingfish tries to snatch a bride away from her wedding because he thinks she is his wife.\n\n32. Viva La France\nAndy, Calhoun, and the Kingfish all become engaged to a French girl named Colette Duval who doesn't understand English.\n\n33. Income Tax Show\nAndy and the Kingfish are frightened when they have to appear before the Internal Revenue Service. It turns out all they have to do is fill out new forms.\n\n34. Vacation Show\nThe Kingfish tries to swindle Andy by taking him on a trip through Central Park and pretending it is the entire USA .\n\n35.The Light Blue Car\nThe Kingfish finds himself accused of robbery when his car is used unknowingly in a holdup.\n\n36. The Classified Ad\nAndy puts a wife-seeking ad in the newspaper and gets a good response, but all the applicants need dental work.\n\n37. The Society Party\nThe Kingfish and Andy try to get their ladies to wear the same fur coat at the same time, to the same party.\n\n38. The Convention\nIn Chicago, the Kingfish gets a sample of the con game from his wife Sapphire who gets them to turn over their money to her, using a disguise, leaving the boys no money to get home.\n\n39. Kingfish's Last Friend\nThe Kingfish has swindled too many people and is losing all of his friends so he goes on a reform kick.\nSeason 2\n\n40. The Kingfish Finds His Future\nThe Kingfish takes an aptitude test and finds he should become a painter, not of pictures but of buildings and walls.\n\n41.The Antique Shop\nThe Kingfish outfoxes himself when he sends all his lodge brothers into an antique shop to convince his cousin Leo to buy it, but with all those customers the store owner won't sell.\n\n42. Kingfish Sells a Lot\nThe Kingfish decides to dispose of a worthless piece of property to Andy, but it's Andy who gets the last laugh.\n\n43. Birthday Card\nSapphire gives the Kingfish the third degree and wants to know why he received a birthday card signed Sweetheart.\n\n44. Father by Proxy\nDriving a pregnant woman to the hospital, Andy is mistaken for the father when a pushy nurse forces him to fill out forms and to sit in the waiting room.\n\n45. The Engagement Ring\nThe Kingfish plays matchmaker and arranges a match between Andy and an older woman, in the hope of collecting a services rendered fee.\n\n46. The Eyeglass\nThe Kingfish devises a plot to make Andy fail his road test so that he can buy his car cheaply.\n\n47. The Uranium Mine\nAndy shells out money for swampland and invests in the Kingfish's uranium mine scheme.\n\n48. Madame Queen's Voice\nMadame Queen re-enters Andy's life because the Kingfish sees her money-making possibilities as a singer.\n\n49. Andy, the Godfather\nThe love of a 12-year-old for Andy's godchild is too much for him to handle.\n\n50.The Insurance Policy\nA heaven-sent opportunity is given the Kingfish, Sapphire thinks he has only three weeks to live, which gives him three weeks to freeload.\n\n51. The Kingfish Gets Amnesia\nThe Kingfish gets amnesia when all of his friends come over asking him to repay old debts.\n\n52. The Girl at the Station\nAt a party, the Kingfish is in good with the ladies and Sapphire doesn't like it at all.\n\n53. The Meal Ticket\nSapphire wants intellectuals to break in her new dinning room furniture, but the Kingfish wants to sneak paying guests in instead.\n\n54. Second Honeymoon\nPlans for a second honeymoon almost fall apart when the Kingfish and Sapphire argue over how they first met.\n\n55. The Gun\nThe Kingfish, trying to pawn a gun, is mistaken for a robber.\n\n56. Young Girl's Mother\nAndy wants to marry a very young girl until he meets her mother, a formidable woman he jilted many years ago.\n\n*** 57. Fur Coat\nSapphire is so delighted with her surprise from the Kingfish, a fur coat, that he hasn't the heart to tell her that the coat is not for her.\n\n58. Sapphire Disappears\nThe Kingfish thinks Sapphire has been murdered when she leaves him in a huff and he can find no trace of her.\n\n59. Jewelry Store Robbery\nAndy and the Kingfish find that a snapshot they took is worth $1000 because it shows a man robbing a store.\n\n60. The Winslow Woman\nThe Kingfish wants Andy to marry wealthy Mrs. Winslow, even when the not-so-wealthy woman actually show up.\n\n61. Call Lehigh 4-9900\nThe Kingfish accidentally answers a newspaper ad for a lonely hearts club, and when a girl shows up at his office, Andy poses as the Kingfish.\n\n62. Leroy Lends a Hand\nThe Kingfish and Andy go into the parking lot business and wind up in the used car business.\n\n63. Amos Helps Out\nAfter a domestic fight, the Kingfish writes a fake letter form the license bureau stating that he and Sapphire were never legally married.\n\n64. Andy Buys a House\nThe Kingfish takes a job as a real estate agent and must prove himself by selling a house on condemned land-- he does, to Andy.\n\n65. The Girl Upstairs\nThe Kingfish is convinced that his marriage is headed for disaster when he finds a diary in Sapphire's closet which mentions a rival.\n\n66. Kingfish Goes to Work\nThe Kingfish has Andy take over his job as handyman at a university and pays him with a college home study.\n\n67. Andy Gets a Telegram\nThe Kingfish winds up on a cattle boat bound for South America when Sapphire plots to separate him from his worthless friends.\n\n68. The Christmas Story\nAndy is working very hard to earn enough money to buy a doll for his godchild.\n\n69. The Diner gs : Dick Elliott (Loan Officer, C. Bromley)\nThe Kingfish and Andy buy a diner, which was doing a good business, and run it out of business.\n\n70. Getting Mama Married (1)\nGS:Amanda Randolph, The Kingfish's mother-in-law elopes with a conman and a fleecer of widows.\n\n71. Getting Mama Married (2)\nThe Kingfish's mother-in-law is so set on marrying a man that even when his wife shows up she still says he is hers.\n\n72. The Happy Stevenses\nThe Kingfish and Sapphire imitate participants in a radio show about a happy marriage, in order to change the pattern of their stormy marriage.\n\n73.Ready Made Family\nWhen the Kingfish's Uncle Clarence is coming to visit, the Kingfish must put together a phony family quickly, to protect his uncle's gift of $500, he gave the Kingfish by telling him he has a child.\n\n74. Relatives\nClamming that his mother-in-law disturbs his home, the Kingfish takes his problems to family court. Meanwhile, more relatives show up.\n\n75. Traffic Violation\nThe Kingfish and Andy, co-owners of a car, compete with each other in the collection of traffic tickets.\n\n76. The Turkey Dinner\nThe Kingfish is conned into buying stolen turkeys from a country bumpkin.\n\n77. Quo Vadis\nThe Kingfish goes to a lavish dinner party at which he finds, uncomfortably, that Sapphire is a waitress.\n\n78. The Chinchilla Business\nThe Kingfish sells a couple of rabbits to Andy for $50 by telling him they are chinchillas. ","torrent":{"xt":"urn:btih:734818f33f7368942966605a2ee8bf6c0454766a","amp;dn":"Amos+%26+Andy+Disk+1.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"734818f33f7368942966605a2ee8bf6c0454766a","infoHashBuffer":{"type":"Buffer","data":[115,72,24,243,63,115,104,148,41,102,96,90,46,232,191,108,4,84,118,106]},"announce":[],"urlList":[]}}