{"title":"Hold Me to This - O'Riley.rar","uid":3994222,"size":84074413,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7501992e609102559392a8b0a3da74d9117d4dbf&amp;dn=Hold+Me+to+This+-+O%5C%27Riley.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tbonepat11","files":1,"time":1201219170,"description":"Tribute albums are always suspect; classical interpretations of rock even more so--and follow-ups to the same are fraught with mediocrity. Just witness the inexplicable glut of String Quartet Tribute discs to Tool, Bruce Springsteen, and many other top-selling and cult artists. On Hold Me to This, his second run at the music of art-rock group Radiohead, classical pianist Christopher O&amp;#039;Riley avoids all these pitfalls. These aren&amp;#039;t easy-listening piano renditions of Radiohead tunes, but deeply inspired, often challenging and dissonant re-imaginings. O&amp;#039;Riley succeeds by taking the music on its own terms. He doesn&amp;#039;t try to make it &quot;classical&quot; but lets the classical nature of the music ring out. From the storming chordal overtone clusters of &quot;There There&quot; to the Chopinesque refrain of &quot;The Spinning Plates,&quot; O&amp;#039;Riley makes you forget these songs were originally played by a raging rock band. Instead, they seem born on the keys of his piano. His &quot;Paranoid Android&quot; is like Conlon Nancarrow going boogie-woogie one moment and painfully, sweetly rhapsodic the next. I&amp;#039;m not sure how Radiohead fans will respond to this, but piano and classical listeners should rejoice. --John Diliberto","torrent":{"xt":"urn:btih:7501992e609102559392a8b0a3da74d9117d4dbf","amp;dn":"Hold+Me+to+This+-+O%5C%27Riley.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7501992e609102559392a8b0a3da74d9117d4dbf","infoHashBuffer":{"type":"Buffer","data":[117,1,153,46,96,145,2,85,147,146,168,176,163,218,116,217,17,125,77,191]},"announce":[],"urlList":[]}}