{"title":"Foundations of Large-Scale Multimedia Information{BBS}","uid":6739574,"size":7194650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7634902633d0d16eff5ab93357ef4742ea57a82e&amp;dn=Foundations+of+Large-Scale+Multimedia+Information%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1318444335,"description":"Foundations of Large-Scale Multimedia Information Management and Retrieval: Mathematics of Perception&quot; covers knowledge representation and semantic analysis of multimedia data and scalability in signal extraction, data mining, and indexing. The book is divided into two parts: Part I - Knowledge Representation and Semantic Analysis focuses on the key components of mathematics of perception as it applies to data management and retrieval. These include feature selection/reduction, knowledge representation, semantic analysis, distance function formulation for measuring similarity, and multimodal fusion. Part II - Scalability Issues presents indexing and distributed methods for scaling up these components for high-dimensional data and Web-scale datasets. The book presents some real-world applications and remarks on future research and development directions.  The book is designed for researchers, graduate students, and practitioners in the fields of Computer Vision, Machine Learning, Large-scale Data Mining, Database, and Multimedia Information Retrieval. Dr. Edward Y. Chang was a professor at the Department of Electrical &amp; Computer Engineering, University of California at Santa Barbara, before he joined Google as a research director in 2006. Dr. Chang received his M.S. degree in Computer Science and Ph.D degree in Electrical Engineering, both from Stanford University.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 309 pages\n    * Publisher: Springer; 1st Edition. edition (September 23, 2011)\n    * Language: English\n    * ISBN-10: 3642204287\n    * ISBN-13: 978-3642204289","torrent":{"xt":"urn:btih:7634902633d0d16eff5ab93357ef4742ea57a82e","amp;dn":"Foundations+of+Large-Scale+Multimedia+Information%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7634902633d0d16eff5ab93357ef4742ea57a82e","infoHashBuffer":{"type":"Buffer","data":[118,52,144,38,51,208,209,110,255,90,185,51,87,239,71,66,234,87,168,46]},"announce":[],"urlList":[]}}