{"title":"Michael Jackson - Heartbreak Hotel","uid":4985201,"size":154148868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:76d5e55a24c399752cdfb96e8d786d92ec3105a5&amp;dn=Michael+Jackson+-+Heartbreak+Hotel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1246581602,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nOriginally named &quot;Heartbreak Hotel&quot;, &quot;This Place Hotel&quot; was a hit recording by The Jacksons when it was released in 1980.\n\nWritten by Michael, the song would precede Jackson's own hit, &quot;Billie Jean&quot;, in its insecurity-plagued tale of confusion. While his brothers did not sing background vocals, they were credited with playing percussion on the album while brother Tito contributed a guitar solo.\n\nThe song reached number twenty-two on the Billboard pop singles chart and number two on the R&amp;B singles chart when it was released and became the group's second biggest single off their Triumph album, behind &quot;Can You Feel It.&quot; The song, in turn, became a popular concert performance for the group's next two tours right into Michael's own Bad tour.\n\nThe song, like the aforementioned &quot;Can You Feel It,&quot; has become one of the oft-sampled songs in hip-hop.\n\nThe song's title was changed because of the 1956 Elvis Presley hit, &quot;Heartbreak Hotel&quot;. In his autobiography, Michael Jackson reveals that he was not a fan of Presley, and it did not enter his mind.\n\nThe song was performed on the Jacksons' Triumph Tour (thus appears on the Jacksons' subsequent live album) and was subsequently used on the Jacksons' Victory Tour. When Michael Jackson first toured as a solo act, &quot;This Place Hotel&quot; was the only Jacksons song to be used in both legs of the Bad World Tour whereas the other songs by the group (with the exception of a medley of early Jackson 5 hits) were retired during the second leg. A spoken word recording preceded the song on the first leg of the Bad tour, but for the second leg of the tour and the subsequent Dangerous World Tour the recording was used as an intro to Jackson's hit &quot;Smooth Criminal.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:76d5e55a24c399752cdfb96e8d786d92ec3105a5","amp;dn":"Michael+Jackson+-+Heartbreak+Hotel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76d5e55a24c399752cdfb96e8d786d92ec3105a5","infoHashBuffer":{"type":"Buffer","data":[118,213,229,90,36,195,153,117,44,223,185,110,141,120,109,146,236,49,5,165]},"announce":[],"urlList":[]}}