{"title":"Pro Evolution Soccer 2010 - PES SMoKE Patch 2.6","uid":5815925,"size":862803239,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:773a8de584dbac74eddefa4bee1ce5b97ad28e6c&amp;dn=Pro+Evolution+Soccer+2010+-+PES+SMoKE+Patch+2.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dido_SMK","files":12,"time":1283822387,"description":"Pro Evolution Soccer 2010 - PES SMoKE Patch 2.6\n\n----------------------------------------------------------------------------------\n\nSome of the features:\n\n- A lot of new clubs and national teams with correct kits.\n- Promoted teams added to all leagues for the new season 2010-2011.\n- World cup teams are all updated.\n- Correct Champions league teams.\n- New HD emblems and flags.\n- Championship addon included.\n- Added Bundesliga (all Eredivisie teams still in the game).\n- 236 overall Clubs, 102 overall national teams. (338)\n- New faces, balls, boots, stadiums, replay, scoreboard...\n- SMoKE special Chants for most teams.\n- GDB correct kits for all teams.\n- Most teams formation and starting lineups are up to date.\n- Most national teams are updated according latest national matches.\n- Hundreds of new players.\n- Revised player stats (SMoKE special rating system).\n- No duplicated players or names including ML hidden players.\n- Correct names for everything.\n- And much much more...\n\n\n* English language is required for full compatability and for the use of new stuff like call names. (highly recommended)\n* Starting a new saves is recommended.\n\n\n----------------------------------------------------------------------------------\n\n- National Teams in Game (100): \n\nAlbania, Austria, Belarus, Belgium, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, England, Finland, France, Georgia, Germany, Greece, Hungary, Ireland, Israel, Italy, Latvia, Lithuania, Macedonia, Malta, Montenegro, Netherlands, Northern Ireland, Norway, Poland, Portugal, Romania, Russia, Scotland, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey, Ukraine, Wales /// Algeria, Angola, Cameroon, Cote d'Ivoire, Egypt, Ghana, Guinea, Mali, Morocco, Nigeria, Senegal, South Africa, Togo, Tunisia /// Canada, Costa Rica, Honduras, Mexico, Trinidad and Tobago, USA /// Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay, Venezuela /// Australia, Bahrain, China, India, Iran, Iraq, Japan, Kuwait, North Korea, Oman, New Zealand, Palestine, Saudi Arabia, Qatar, Korea Republic, Syria, Thailand, UAE, Uzbekistan /// Classic Italy, Classic France, Classic England, Classic Brazil, Classic Argentina, Classic Netherlands\n\n\n- Clubs in Game (236): \n\nArsenal, Aston Villa, Blackburn Rovers, Bolton Wanderers, Chelsea, Everton, Fulham, Hull City, Liverpool, Manchester City, Manchester United, Birmingham City, Burnley, Portsmouth, Stoke City, Sunderland, Tottenham Hotspur, Wolverhampton, West Ham United, Wigan Athletic /// Auxerre, Girondins de Bordeaux, Boulogne, Grenoble Foot, RC Lens, LE Mans, Losc Lille, FC Lorient, Olympique Lyonnais, Olympique Marseille, AS Monaco, Nancy Lorraine, Montpellier, OGC Nice, Paris Saint-Germain, Stade Rennais, Saint-Etienne, Sochaux, Toulouse, Valenciennes /// Atalanta, Bari, Bologna, Cagliari Calcio, Calcio Catania, Chievo Verona, Fiorentina, Genoa, Inter Milan, Juventus, Lazio, Livorno, AC Milan, Napoli, Palermo, Parma, Roma, Sampdoria, Siena, Udinese /// Ado Den Haag, Ajax, AZ Alkmaar, Feyenoord, Groningen, Heerenveen, Heracles Almelo, NAC Breda, NEC Nijmegen, PSV Eindhoven, Roda JC, Sparta Rotterdam, FC Twente, FC Utrecht, Vitesse Arnheim, VVV Venlo, RKC Waalwijk, Willem II /// Mainz 05, Bayer Leverkusen, Bayern MÃƒÆ’Ã‚Â¼nchen, Bochum, Freiburg, Borussia Dortmund, Eintracht Frankfurt, Hamburger, Hannover, Hertha Berlin, 1899 Hoffenheim, NÃƒÆ’Ã‚Â¼rnberg, Koln, Borussia M'Gladbach, Schalke 04, Stuttgart, Werder Bremen, Wolfsburg /// Almeria, Athletic Bilbao, Barcelona, Deportivo LA CoruÃƒÆ’Ã‚Â±a, Espanyol, Getafe, Sporting Gijon, Atletico Madrid, Real Madrid, Malaga, Mallorca, Osasuna, Racing Santander, Sevilla, Tenerife, Valencia, Real Valladolid, Villarreal, Xerez, Real Zaragosa /// Austria Wien, SK Sturm Graz, Red Bull Salzburg, Rapid Wien, BATE Borisov, Anderlecht, Club Brugge, Standard de Liege, KAA Gent, Litex Lovech, CSKA Sofia, Levski Sofia, Dinamo Zagreb, Hajduk Split, Slavia Praha, Sparta Praha, Banik Ostrava, Apoel FC, Anorthosis, Brondby IF, Copenhagen, HJK Helsinki, AEK Athens, Olympiacos, Panathinaikos, PAOK Thessaloniki, Debreceni VSC, Fehervar, Hapoel Tel Aviv, Maccabi Haifa, Ventspils, Sheriff Tiraspol, Rosenborg Ballklub, Wisla Krakow, Legia Warszawa, Lech Poznan, Benfica, S.C. Braga, Porto, Sporting, Nacional Madeira, Dinamo Bucuresti, CFR Cluj, Steaua Bucuresti, Unirea Urziceni, Timisoara, CSKA Moscow, Lokomotiv Moscow, Spartak Moscow, Zenit, Rubin Kazan, Aberdeen, Celtic, Hearts, Rangers, Crvena Zvezda, Partizan, AIK, IFK Goteborg, Hammarby Fotboll, Kalmar FF, Basel 1893, Zurich, Besiktas, Fenerbahce, Galatasaray, Sivasspor, Trabzonspor, Shakhtar Donetsk, Metalist Kharkiv, Dynamo Kyiv, Boca Juniors, River Plate, Banfield, Independiente, San Lorenzo, Internacional, Corinthians, Gremio, Sao Paulo FC, Palmeiras, Cruzeiro, Flamengo, Colo Colo, Universidad, Liga de Quito, Club Nacional de Football, Penarol, Galaxy, Seattle Sounders, Club Africain, Esperance Sportive, Etoile du Sahel, Al Ahly, Zamalek, Al Ismaily, Al Ittihad Jeddah, Al Hilal Riyadh, Wydad Casablanca, Raja Casablanca, Persepolis, Esteghlal, Estudiantes /// Barnsley, Blackpool, Bristol City, Cardiff City, Coventry City, Crystal Palace, Leicester City, Middlesbrough, Newcastle, Nottingham, Queens Park, Reading, Sheffield United, Swansea, Watford, West Bromwich Albion, Preston North End, Sheffield Wednesday.\n\n\n----------------------------------------------------------------------------------\n\nInstallation (ON A NEW COPY OF PES):\n**all steps are required**\n\n\n1. Decompress the file (extract only one part, all parts will be be extracted in the same place)\n\n2. Copy (PES2010_EDIT01.bin) from the save folder in the patch to the SAVE folder of the game, should be (C:Documents and SettingsUSERMy DocumentsKONAMIPro Evolution Soccer 2010save), replace old file if it asks.\n\n3. Backup then Replace (pes2010.exe) and (settings.exe) with the ones from the patch.\n\n4. Copy the kitserver folder in the Pro Evolution Soccer 2010 installation folder, should be: (C:Program FilesKONAMIPro Evolution Soccer 2010), then open the kitserver folder and run manager.exe then click attach, then close.\n\n\n\nP.S.: Directories are the ones by default installation, if you have changed the defaults use your directories.\n\nP.S.: Do not update the game after installing the patch.\n\nP.S.: if you are using a previous version of SMoKE patch no need for fresh copy, but its necessary to delete old kitserver folder before copying the new folder.\n\n\n----------------------------------------------------------------------------------\n\nChange log:\n\n\nPES SMoKE Patch 2.6 (full and update):\n\n- Reconstructed the patch system files to solve a lot of problerms.\n- Fixed the In-game editor, all teams are fully editable.\n- Fixed bug causing game crash when registering a player to some teams.\n- Updated transfers/added a lot of players.\n- Fixed some players.\n- Updated more kits.\n- Updated more teams.\n- Added new Faces.\n- Revised Stats, price and age for many players.\n- Fixed other important issues.\n\n\nPES SMoKE Patch 2.5.2 (update):\n\n- Updated transfers/added a lot of players.\n- Fixed some players hair.\n- Added/fixed call names.\n- Added new chants (Ajax, argentine, catania, PSV, england, fiorentina, genoa, germany, italy, lazio, italy, napoli, netherlands, roma, sampdoria, spain, udinese, barcelona, real madrid, chelsea, aston villa, everton, Man city).\n- Updated some emblems.\n- Updated more kits.\n- Fixed red bulls Salzburg kits.\n- Updated more teams.\n- Added new Faces.\n- Better quality national flags.\n- New Boots Installed.\n- Fixed bug with players changing to GK in ML mode (requirers starting a new ML, BAL)\n- Revised Stats, price and age for many players.\n- Fixed scoreboard mixup in other languages.\n- Added ability to edit emblems and names for all teams and clubs.\n- Added extra files to give option of playing ML with other championship teams (read the readme file included in -ML extra- folder)\n- Small tweeks and fixes.\n\n\nPES SMoKE Patch 2.5.1 (update):\n\n- Fixed Alvaro Pereira, made uruguay/porto crash.\n- Replaced 2 europian players from super classic america team.\n- Fixed bug with Tevez and sagna hair (other players had same problem are fixed too).\n- Fixed 2 players faces in borussia dortmund.\n- Fixed Lecce flag (was showing atlanta).\n- Fixed/Added some faces.\n- Blackpool replaces Burnley in EPL.\n- Updated more kits.\n- Updated more teams.\n- Added more call names.\n\n\nPES SMoKE Patch 2.5 (full):\n\n- added 2 teams: Super Classic America and Super Classic Europe\n- added a lot of new players\n- fixed commentary hang-ups and up-normality\n- promoted teams replaces relegated in all leagues\n- updated kits\n- updated formations and startup 11\n- higher quality surround SMoKE chants for 18 teams\n- updated boots\n- white numbers in scoreboard\n- added a lot of missing call names (pato, bojan, fabregas, cannavaro, assulin, and many more)\n- revised stats for some players\n- updated world cup national teams starting 11 and formations with correct player numbers\n- crash free version (not one crash so far)\n- updated players personal data, age, wight, ...\n- updated some players price value\n- updated transfers\n- new Nike T90 Ascente balls\n- updated kits\n\n\nPES 2010 SMoKE Patch 2.4.1 (update):\n\n- Updated some kits\n- Updated some teams\n\n\nPES 2010 SMoKE Patch 2.4 (full):\n\n- Fixed/updated kits\n- Corrected some players numbers\n- Fixed some players\n- Fixed some wrong player call names\n- Fixed some crashes\n- Updated player stats\n- Updated some transfers\n- Other small fixes\n\n\nPES SMoKE Patch 2.3 (full):\n\n- Updated/corrected transfers\n- Updated/corrected some faces\n- Updated/corrected some kits\n- Created missing kits for: Lovech, Fehervar\n- New teams can be used in ML mode\n- Removed double shakhar team from menu\n- Fixed crashes when choosing some teams\n- Fixed championship teams kits\n- Fixed/added players call names\n- Fixed (no string) Menus for French and spanish users\n- Added special SMoKE chants for: Arsenal, Astonvilla, Everton, Fulham, Stock city, Portsmouth\n- Added 3 National Teams: Macedonia, Palestine, Latvia\n- Added 2 championship teams: Preston North End, Sheffield Wednesday\n- Fixed wrong sleeve badge on kits\n- New Special Scoreboard\n- Some small fixes\n- Optimized chants for better loading on low end PCs.\n\n\nPES SMoKE Patch 2.2 (full):\n\n- Added New faces (all slots are used)\n- Fixed the (no string) problem in menus\n- Fixed some portuguese teams not shown inside the game\n- Updated winter transfers\n- Fixed some crashes when selecting some teams in exhibition mode\n\n\nPES SMoKE Patch 2.1 (full):\n\n- 16 Championship teams included by default\n- Added Estudiantes de la plata\n- Added Malta national team\n- Fixed some teams having austria name and flag\n- Fixed Master league Crash when loading\n- Completed winter transfers\n- Updated some national teams squads\n- Updated some kits\n- Added more faces\n\n\nPES SMoKE Patch 2.0 (full):\n\n- first release\n\n----------------------------------------------------------------------------------\n\n\nNews and polls at main website, pes-smoke-patch. blog spot. com\t","torrent":{"xt":"urn:btih:773a8de584dbac74eddefa4bee1ce5b97ad28e6c","amp;dn":"Pro+Evolution+Soccer+2010+-+PES+SMoKE+Patch+2.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773a8de584dbac74eddefa4bee1ce5b97ad28e6c","infoHashBuffer":{"type":"Buffer","data":[119,58,141,229,132,219,172,116,237,222,250,75,238,28,229,185,122,210,142,108]},"announce":[],"urlList":[]}}