{"title":"Yugoslavia: The Avoidable War","uid":4911472,"size":1845695108,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:77b5d8fa18e7f2cb37e00b4486487e3a487e183e&amp;dn=Yugoslavia%3A+The+Avoidable+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Yugobay","files":1,"time":1243187029,"description":"Genere: Documentary\nDirected by: Geroge Bogdanich\nRealease date: March 15, 2002\nRunning time: 165 minutes\nOrigin: USA\n\nYugoslavia: The Avoidable War is a documentary film that reveals in facts and interviews with key people how the actions of Germany and other Western and Middle European countries such as Hungary lead to the unnecessary civil wars of Yugoslavia in late 1991 and early 1992, ultimately culminating in the devastating NATO air bombing campaign against Serbia in March of 1999 which lasted for two and a half months.\n\nThe documentary reveal how the governments of Franjo Tudjman and Alija Izetbegovic already at an early stage of the crisis used public relation firms based in the United States to lobby symphathy for their cause by commuting the Serbs as aggressors and opressors, when in fact things were far more complex than was presented as in Wester mass medias to ordinary people as a result of this non-stop bobmardment of lies and half truths directed at them and the medias themselves.\n\nIn addition, compelling evidence is put forward by vitnesses and experts suggesting that the &quot;massacres&quot; at Makrale and in Racak were more or less staged once, booth of which had a strong effect on later developments which came into advantage for the Serb counterparts by making a case for American and NATO intervention. Also, figures reagrding casualties in Bosnia and Kosovo are not only significally reduced but we will se how domestic and foreign governments inflated them intentionally and viciously for the same reason as the sacrafacing of once own people in specatacles all over Yugoslavia.\n\nKey mediators and chois makers of the war, including Peter Carrington, Lewis MacKenzie, David Owen and former Canadian Ambassador to Yugoslavia James Bisett, are also interviewed by the makers of this documentary in order to expose the true nature of Western interference and manipulations in the Balkans in the 1990's.\n\n(It can also be notet right away that an exception in the case of being unbiased is is of cource when regarding Srebrenica. Since the documentary was made several mass graves have indeed been discovered that is to suggest that the figure of deaths was no less than 7000. Though, this does no change the fact that there still remains a lot of questionmarkds surounding the issue.\n\nRegarding the total figuer of deaths in the Bosnian war, the most extensive research on this issue so far has come up with 100.000 deaths, half of which were civilian casualities and 30.000 accuanted for civlian Muslims killed by booth Serbs and Croats. This is not the 60.000 cited in the documentary as a more realistic alternative to the 300.000 used till not so ling ago, but it's close.)","torrent":{"xt":"urn:btih:77b5d8fa18e7f2cb37e00b4486487e3a487e183e","amp;dn":"Yugoslavia%3A+The+Avoidable+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b5d8fa18e7f2cb37e00b4486487e3a487e183e","infoHashBuffer":{"type":"Buffer","data":[119,181,216,250,24,231,242,203,55,224,11,68,134,72,126,58,72,126,24,62]},"announce":[],"urlList":[]}}