{"title":"USB Safely Remove v5.2.1.1195 Incl Crack [TorDigger]","uid":8255860,"size":6036042,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:77cf9a738cdc624709f275a5996445f476242fc6&amp;dn=USB+Safely+Remove+v5.2.1.1195+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":11,"time":1363221929,"description":"USB Safely Remove\n\nUSB Safely Remove is a utility for effortless and speedy disconnection of any removable devices. Not only does it save time, but it ensures that all data remains on a device when it is unplugged. Safely Remove is a system utility designed for quick and safely stopping USB Flash Drives connected to your computer. With this utility you can safely stop and remove USB Flash Drives much faster then using &quot;Safely remove hardware&quot;&quot; icon in the system tray.\n\nFEATURES:\n\n*Unlimited number of processes to launch\nYou may specify to launch any number of processes for specified event. For example you may setup launching a backup of the drive before stopping and following disomounting of a TrueCrypt volume\n*Optional command line parameters\nYou may pass such device parameters as drive letter, drive label, device PNP name into the process command line via parameter templates (e.g. this command line will browse a drive in Explorer on device connection: explorer.exe %DriveLetter%)\n*New events to launch programs\nNow programs can be launched after device plugging, before device stopping, after device stopping and after device removing\n*Global autorun\nYou can setup a program to be launched not only for certain device, but for all hotplug devices in the system\n\nOne click templates!\nDislike reading boring documentation, but interested in one of the following things?\n* Browsing a drive with Explorer or Total Commander on device connection\n* Scanning a device for viruses on its connection\n* Making automatic backup of a flash-drive folder\n* Automatic mounting and dismounting a TrueCrypt volume stored on a device\n\nQuote:\n\nVersion 5.2 (Released on Mar 12th, 2013)\nOption to fix several drives to the same drive letter added\nWindows 8 support &amp; Metro UI skin\nA special sign is displayed for fixed drive letter in the menu\nFolder mount points are now displayed in full size (not truncated as earlier)\nVerbose logging was enabled by default\nCard reader drives are displayed even when the option &quot;Display storage device volumes&quot; is disabled\nSkin scheme file now has usual web format of the colors\n&quot;Extend license&quot; menu item could display &quot;Order&quot; page rather than &quot;Extend&quot;\nAutorun programs called before changing drive letters (e.g. for fixed drive letters). This caused double calling of the autorun programs.\nThe device menu might be displayed when user launched TaskManager (Win 8) or Customize tray icons dialog (Win 7, 8)\nThe SATA system drive was displayed in the list by default. Now it's displayed only when you enable the option &quot;Display all storage devices&quot;\nNow the program doesn't add itself to the Windows startup on each launch, it does this when it's needed.\n\nSupported OS: \n\nWin XP/2003/Vista/7/8, (32/64 bit)\n\nHomepage: http://www.safelyremove.com/\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:77cf9a738cdc624709f275a5996445f476242fc6","amp;dn":"USB+Safely+Remove+v5.2.1.1195+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77cf9a738cdc624709f275a5996445f476242fc6","infoHashBuffer":{"type":"Buffer","data":[119,207,154,115,140,220,98,71,9,242,117,165,153,100,69,244,118,36,47,198]},"announce":[],"urlList":[]}}