{"title":"Java I/O, 2nd Edition","uid":4726902,"size":2902992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78adc4640cd717daff99c13aed49238fac34a498&amp;dn=Java+I%2FO%2C+2nd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1234804033,"description":"All of Java's Input/Output (I/O) facilities are based on streams, which provide simple ways to read and write data of different types. Java provides many different kinds of streams, each with its own application. The universe of streams is divided into four large categories: input streams and output streams, for reading and writing binary data; and readers and writers, for reading and writing textual (character) data. You're almost certainly familiar with the basic kinds of streams--but did you know that there's a CipherInputStream for reading encrypted data? And a ZipOutputStream for automatically compressing data? Do you know how to use buffered streams effectively to make your I/O operations more efficient? Java I/O, 2nd Edition has been updated for Java 5.0 APIs and tells you all you ever need to know about streams--and probably more.\n\nA discussion of I/O wouldn't be complete without treatment of character sets and formatting. Java supports the Unicode standard, which provides definitions for the character sets of most written languages. Consequently, Java is the first programming language that lets you do I/O in virtually any language. Java also provides a sophisticated model for formatting textual and numeric data. Java I/O, 2nd Edition shows you how to control number formatting, use characters aside from the standard (but outdated) ASCII character set, and get a head start on writing truly multilingual software.\n\nJava I/O, 2nd Edition includes:\n\n* Coverage of all I/O classes and related classes\n* In-depth coverage of Java's number formatting facilities and its support for international character sets","torrent":{"xt":"urn:btih:78adc4640cd717daff99c13aed49238fac34a498","amp;dn":"Java+I%2FO%2C+2nd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78adc4640cd717daff99c13aed49238fac34a498","infoHashBuffer":{"type":"Buffer","data":[120,173,196,100,12,215,23,218,255,153,193,58,237,73,35,143,172,52,164,152]},"announce":[],"urlList":[]}}