{"title":"Entremeses Aperitivos Y Ensaladas - Marquesa De Parabere","uid":6093677,"size":22361199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:792dd000b19b2307250a3f3341ca3047d6c34f43&amp;dn=Entremeses+Aperitivos+Y+Ensaladas+-+Marquesa+De+Parabere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chusca","files":3,"time":1294672576,"description":"Aunque todas las obras de esta autora, aparecen firmadas por &quot;La Marquesa de Parabere&quot;, ÃƒÂ©ste no deja de ser un seudÃƒÂ³nimo, ya que su nombre de casada fue: MarÃƒÂ­a Mestayer de EchagÃƒÂ¼e. Esta autora no tuvo ningÃƒÂºn tÃƒÂ­tulo nobiliario pero a ella le gustÃƒÂ³ jugar a hacerlo creer y muy pocas veces aclaraba la situaciÃƒÂ³n y confusiÃƒÂ³n.  NaciÃƒÂ³ en Bilbao en 1878. Era hija del CÃƒÂ³nsul FrancÃƒÂ©s en el paÃƒÂ­s. A lo largo de su vida tuvo dos grandes pasiones, como ella nos confiesa en el preÃƒÂ¡mbulo de uno de sus libros: la GastronomÃƒÂ­a y la Historia. En la primera es destacable su labor.  SegÃƒÂºn autores, muere a los 74 aÃƒÂ±os. dejando un amplio legado culinario en forma de libros, publicaciones, colaboraciÃƒÂ³n en periÃƒÂ³dicos, etc ... TambiÃƒÂ©n merece destacar que inaugura dos restaurantes en la capital: Madrid, ambos con el nombre &quot;Parabere&quot;. Por lo datos que he obtenido, desaparecieron debido a los avatares histÃƒÂ³ricos como la guerra civil, la fuerte crisis de los aÃƒÂ±os 40, etc... \nEn 1936 publica en ediciones Hymsa dos libros: &quot;Entremeses, aperitivos y ensaladas&quot; y &quot;Conservas caseras&quot;, en ninguna de las cuales he observado su nombre, sino solo su seudÃƒÂ³nimo: La Marquesa de Parabere.","torrent":{"xt":"urn:btih:792dd000b19b2307250a3f3341ca3047d6c34f43","amp;dn":"Entremeses+Aperitivos+Y+Ensaladas+-+Marquesa+De+Parabere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"792dd000b19b2307250a3f3341ca3047d6c34f43","infoHashBuffer":{"type":"Buffer","data":[121,45,208,0,177,155,35,7,37,10,63,51,65,202,48,71,214,195,79,67]},"announce":[],"urlList":[]}}