{"title":"Aczel - Descartes's Secret Notebook","uid":4881522,"size":20576989,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a282cccab5017030c67198027048463211cc404&amp;dn=Aczel+-+Descartes%5C%27s+Secret+Notebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gorra09","files":1,"time":1241406276,"description":"Descartes's Secret Notebook: A True Tale of Mathematics, Mysticism, and the Quest to Understand the Universe\n\nby Amir D. Aczel \n\nRenÃƒÂ© Descartes (1596-1650) is one of the towering and central figures in Western philosophy and mathematics. His apothegm &quot;Cogito, ergo sum&quot; marked the birth of the mind-body problem, while his creation of so-called Cartesian coordinates have made our physical and intellectual conquest of physical space possible.\n\nBut Descartes had a mysterious and mystical side, as well. Almost certainly a member of the occult brotherhood of the Rosicrucians, he kept a secret notebook, now lost, most of which was written in code. After Descartes's death, Gottfried Leibniz, inventor of calculus and one of the greatest mathematicians in history, moved to Paris in search of this notebook--and eventually found it in the possession of Claude Clerselier, a friend of Descartes. Leibniz called on Clerselier and was allowed to copy only a couple of pages--which, though written in code, he amazingly deciphered there on the spot. Leibniz's hastily scribbled notes are all we have today of Descartes's notebook, which has disappeared.\n\nWhy did Descartes keep a secret notebook, and what were its contents? The answers to these questions lead Amir Aczel and the reader on an exciting, swashbuckling journey, and offer a fascinating look at one of the great figures of Western culture.","torrent":{"xt":"urn:btih:7a282cccab5017030c67198027048463211cc404","amp;dn":"Aczel+-+Descartes%5C%27s+Secret+Notebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a282cccab5017030c67198027048463211cc404","infoHashBuffer":{"type":"Buffer","data":[122,40,44,204,171,80,23,3,12,103,25,128,39,4,132,99,33,28,196,4]},"announce":[],"urlList":[]}}