{"title":"Sevendust-Next-(Retail)-2005-RNS [Hard Rock]","uid":3394673,"size":73233310,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7a6d3958298271188bd12e8521e18cc8a5b68d06&amp;dn=Sevendust-Next-%28Retail%29-2005-RNS+%5BHard+Rock%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"armis","files":15,"time":1128964956,"description":"ARTIST: Sevendust\nTITLE: Next\nLABEL: Winedark\nGENRE: Hard Rock\nBITRATE: 224kbps avg\nPLAYTIME: 0h 43min total\nRELEASE DATE: 2005-10-11\nRIP DATE: 2005-10-10\n\nTrack List\n----------\n01. Hero                            3:47\n02. Ugly                            4:09\n03. Pieces                          3:04\n04. Silence                         3:59\n05. This Life                       4:34\n06. Failure                         3:46\n07. See And Believe                 4:11\n08. The Last Song                   3:51\n09. Desertion                       3:19\n10. Never                           4:04\n11. Shadows In Red                  4:26\n\nRelease Notes:\n\nThe advance was *REAL* however there was a glitch on &quot;Silence&quot; at 0:18\nand the disc was not a final master. Higher quality on the retail, so\nhere it is.\n\nYou?ve got to hand it to Sevendust. They have continued on now for\nnearly a decade, and throughout that time, they have to be considered\none of the most consistently excellent bands out there. From the onset\nto now, they?ve had their share of critical praise, have always\ndelivered in the live setting, and have always sold a good amount of\nrecords each time out.\n\nNEXT is as advertised - the next Sevendust record. It?s a little\nheavier than their last output, SEASONS, but it?s definitely an\nappealing Sevendust Record, as always. If you liked them before, you\nare bound to like them now. Vocalist Lajon Witherspoon has weathered a\nlot of personal adversity over the years, but never has let it\ninfluence his mixture of clean and screaming vocals. On songs like\n&quot;Ugly&quot;, he showcases his crooning voice and mixes it well with the\nrage of a soul drenched in pain. More than any other vocalist out\nthere, Witherspoon has used the &quot;crooning-to-raging&quot; style to build\nmomentum in songs effectively. As with Witherspoon, drummer Morgan\nRose provides another exceptional performance as well. His playing\nstyle is somewhat traditional, although he mixes in a modern flair and\nan interesting peppering of cymbal play into odd parts of songs. On\n&quot;Pieces&quot;, the song is taken over by Rose and new guitarist Sonny Mayo.\n\nThere is a new element to Sevendust is the previously mentioned Sonny\nMayo. Replacing Clint Lowery in the band, the ex-Snot, Hed (PE) and\nAmen guitarist brings a crunchier sound to the mix than Lowery did. He\nstill plays what would be considered to be &quot;traditional&quot; Sevendust\nriffs (as on &quot;Silence&quot;; a song that could have appeared on any\nSevendust album), but he?s heavied the band up a bit, which is a very\ngood addition to the sound.\n\nThey may never sell as many copies of records as some of the flashes\nin the pan that come and go, but they are proving that consistent\nexcellence leads to longevity in a career. NEXT is exactly that - the\nnext Sevendust record. Like it?s predecessors, all of the songs are\nsolid, the presentation is excellent, and you leave it thinking,\n&quot;damn, those guys are good&quot;. The fact is, they are.\n\n","torrent":{"xt":"urn:btih:7a6d3958298271188bd12e8521e18cc8a5b68d06","amp;dn":"Sevendust-Next-%28Retail%29-2005-RNS+%5BHard+Rock%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a6d3958298271188bd12e8521e18cc8a5b68d06","infoHashBuffer":{"type":"Buffer","data":[122,109,57,88,41,130,113,24,139,209,46,133,33,225,140,200,165,182,141,6]},"announce":[],"urlList":[]}}