{"title":"Transformers 2007(Subs 6) 2Lions-Team","uid":5212019,"size":4632187889,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7aa79030a742a582e680ef4d6e00d65356cfa91c&amp;dn=Transformers+2007%28Subs+6%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1260637530,"description":"Transformers 2007     \n\n \nVerenigde Staten\nActie / Science-Fiction\n143 minuten\n\ngeregisseerd door Michael Bay\nmet Shia LaBeouf, Megan Fox en Josh Duhamel\n\nHeel lang geleden was er een oorlog op de planeet Cybertron, tussen de Autobots en de Decepticons. Vele jaren later, op de planeet Aarde, koopt de jonge Sam Witwicky zijn eerste auto en komt tot de ontdekking dat het de Autobot Bumblebee is. Deze is er om Sam te beschermen, aangezien Bumblebee niet de enige Transformer is die op Aarde is gekomen. Ook de Decepticons zijn op Aarde en beginnen het Amerikaanse leger aan te vallen. Als Sam en zijn vriendin Mikaela dan ontdekken dat het leger van plan is zowel de vijandige Decepticons als de vredelievende Autobots te vernietigen, proberen ze een nieuw plan te bedenken om de Decepticons te stoppen.\n\nEnglish\n\nA long time ago, far away on the planet of Cybertron, a war was being waged between the noble Autobots (led by the wise Optimus Prime) and the devious Decepticons (commanded by the dreaded Megatron) for control over the Allspark, a mystical talisman that would grant unlimited power to whoever possessed it. The Autobots managed to smuggle the Allspark off the planet, but Megatron blasted off in search of it. He eventually tracked it to the planet of Earth (circa 1850), but his reckless desire for power sent him right into the Arctic Ocean, and the sheer cold forced him into a paralyzed state. His body was later found by Captain Archibald Witwicky, and before going into a comatose state Megatron used the last of his energy to engrave a map, showing the location of the Allspark, into the Captain's glasses, and send a transmission to Cybertron. He is then carted away by the Captain's ship. A century later, Sam Witwicky, nicknamed Spike by his friends, buys his first car. To his shock, he discovers it to be Bumblebee, an Autobot in disguise who is to protect Spike, as he bears the Captain's glasses and the map carved on them. But Bumblebee is not the only Transformer to have arrived on Earth - in the desert of Qatar, the Decepticons Blackout and Scorponok attack a U.S. military base, causing the Pentagon to send their special Sector Seven agents to capture all &quot;specimens of this alien race,&quot; and Spike and his girlfriend Mikaela find themselves in the middle of a grand battle between the Autobots and the Decepticons, stretching from Hoover Dam all the way to Los Angeles. Meanwhile, within the depths of Hoover Dam, the cryogenically stored form of Megatron awakens\n\n \n\nAudio : English Dolby Digital 5.1\nSubs: Danish, English, Dutch, Norwegian, Finnish, Swedish\nMenu : Yes\nFormaat : DVD5 \nBron : Retail Pal\n\n \nGenre : Fantasiefilm\n\nweblink : http://www.moviemeter.nl/film/37432\nWeblink : http://www.imdb.com/title/tt0418279\n \n*****************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan.!!\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*****************************************\n\nBrought to you by \n\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n        &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:7aa79030a742a582e680ef4d6e00d65356cfa91c","amp;dn":"Transformers+2007%28Subs+6%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa79030a742a582e680ef4d6e00d65356cfa91c","infoHashBuffer":{"type":"Buffer","data":[122,167,144,48,167,66,165,130,230,128,239,77,110,0,214,83,86,207,169,28]},"announce":[],"urlList":[]}}