{"title":"Nadia Newton: A Novel by Sunil P. Bhatia (2014) (Kindle)","uid":11631726,"size":1483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ae4ae7c11e0b6a2e45c495b4fae73bd2841e837&amp;dn=Nadia+Newton%3A+A+Novel+by+Sunil+P.+Bhatia+%282014%29+%28Kindle%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1417683374,"description":"How far would you go to get revenge on your abusive husband?\n\nIf you're Nadia Newton, a London maid barely getting by, you'll go as far as humanly possible if this means freedom and a better life. Nadia's husband is a convicted thief and he's released from prison temporarily on condition that he'll steal again. Yes, steal. He is asked to break into the large home of a famous paparazzo and steal a ring that belonged to Princess Diana. This is the rumored ring purchased by her lover a day before her tragic death in a Paris Tunnel. If he obtains Diana's ring and delivers it promptly, he'll earn his freedom and three million dollars. No questions asked.\n\nThe job requires a second person and he promises Nadia in on the action. But after another vicious beating, Nadia has had enough. She wants a better life, but not at the expense of his violent ways. A hatred for her husband stirs inside her and she wants revenge. The kind of revenge where he'll suffer and rot in prison for the rest of his life. So she conceives of an elaborate plan to get a new identity, steal the ring, and frame her husband in the process.\n\nOn the run, Nadia swaps a passport with a wealthy American woman and enters the States. But complications ensue when she discovers the American woman's past is somehow tied to the ring. Another paparazzo is dead and Nadia's elaborate plan starts to unravel. She fights for her innocence and dodges attempts at her life, seemingly pushed into the mystery of Diana's death. At a dangerous price, answers come to Nadia in such a way that it forces her to reexamine her own values and desperate need for revenge.\n\nShe wonders too if she's become an unwilling pawn to preserve a legacy she never intended to tarnish. All the while, greater danger looms in the form of her husband, who refuses to go away. He will stop at nothing to get the ring and make millions, even if that means killing his own wife.\n\nNadia Newton is an intricate gritty mystery with page turning suspense and high speed thrills. A combination of James Patterson's lightening fast pace with moments of Elmore Leonard's crazy sick dialogue. It's also a finely-crafted revenge story that comes of age with enough plot turns to get the reader's head spinning and wanting more.\n\nProduct Details\nPaperback: 324 pages\nPublished: (July 16, 2014)\nLanguage: English\nISBN-10: 1500543276\nISBN-13: 978-1500543273\nProduct Dimensions: 8 x 5 x 0.7 inches\nShipping Weight: 15 ounces (View shipping rates and policies)\nAverage Customer Review: 4.8 out of 5 stars  See all reviews (5 customer reviews)","torrent":{"xt":"urn:btih:7ae4ae7c11e0b6a2e45c495b4fae73bd2841e837","amp;dn":"Nadia+Newton%3A+A+Novel+by+Sunil+P.+Bhatia+%282014%29+%28Kindle%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ae4ae7c11e0b6a2e45c495b4fae73bd2841e837","infoHashBuffer":{"type":"Buffer","data":[122,228,174,124,17,224,182,162,228,92,73,91,79,174,115,189,40,65,232,55]},"announce":[],"urlList":[]}}