{"title":"BlacksOnBlondes - Aria Austin [WMV]","uid":7818613,"size":334673317,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7b4ffcd3e33801dfbc654890c9f658169dc7c5b4&amp;dn=BlacksOnBlondes+-+Aria+Austin+%5BWMV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R0thschild","files":1,"time":1352740708,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=958852&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=958852&lt;/a&gt;\n\nAria Austin is used to hitchhiking in the south- it's where she's from, after all. Aria has found herself looking to get a ride\nwith dreams of becoming an actress dancing around her head. Aria stumbles up Charlie Mac and Mark Anthony, as they're debating how to fuck white\ngirls, and they quickly lend her their help. Aria's always depended on the kindness of strangers and Charlie and Mark are about to be kind....to\nher ass and pussy. Aria Austin drops to her knees and her eyes quickly meet with two feet of big, black cock. The tease from Texas takes turns\ngiving each guy a blowjob courtesy of a whore from the Bible Belt. Aria's ass and pussy are both up for grabs as both black guys treat her ass\nand pussy to some interracial goodness. Aria's screams are muffled out by a huge black cock and her asshole's getting demolished every second.\nThere's no amount of acting classes that could get Aria prepared for this role of &quot;Black cock slut&quot; and both brothas continue to fuck all her\nholes. Aria's ass soon enough becomes a haven for all of Mark Anthony's black jizz, and he overflows her ass like The Mississippi River during\nflood season. Charlie Mac steps up and coats Aria's face with his own brand of southern sauce. The aftermath leaves Aria Austin with no choice\nbut to continue hitchhiking; especially since sitting on her ass isn't an option after this interracial slam fest.","torrent":{"xt":"urn:btih:7b4ffcd3e33801dfbc654890c9f658169dc7c5b4","amp;dn":"BlacksOnBlondes+-+Aria+Austin+%5BWMV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b4ffcd3e33801dfbc654890c9f658169dc7c5b4","infoHashBuffer":{"type":"Buffer","data":[123,79,252,211,227,56,1,223,188,101,72,144,201,246,88,22,157,199,197,180]},"announce":[],"urlList":[]}}