{"title":"Head of State(2003)DVDRip.AC3(ENG)-DROCK","uid":6390898,"size":733619277,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7be6f772be091eb8d11cc5dc4d68b073c9e8ef7c&amp;dn=Head+of+State%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1305358932,"description":"Can a high-attitude African-American politician who says what he thinks stand a chance in a presidential campaign? Mays Gilliam (Chris Rock) is a straight-talking alderman representing a inner-city neighborhood in Washington, D.C. In the midst of a hard-fought race for the White House, the Democratic presidential and vice-presidential candidates are killed in an airline crash, and with little time to prepare a new campaign, the Republican candidate, Vice President Brian Lewis (Nick Searcy), seems all but guaranteed to win. With practically nothing to loose, party head Martin Geller (Dylan Baker) approaches Gilliam and asks him to stand as the Democrat's presidential candidate. While Gilliam is dubious at first, before long his streetwise style and willingness to face the issues head-on earns him surprising figures in the polls, especially after he persuades his short-fused older brother, Mitch Gilliam (Bernie Mac), to join the ticket as vice presidential candidate -- a big jump for a bail bondsman. Gilliam's love life also becomes more complicated as his ex-girlfriend Kim (Robin Givens) decides she wants him back now that he has a shot at the White House, even though Gilliam only has eyes for Lisa (Tamala Jones). Head of State marked the directorial debut for comic and actor Chris Rock, who also co-wrote and co-produced the film.\n\nRipped with Handbrake.\n\nLength: 1 Hour 35 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:7be6f772be091eb8d11cc5dc4d68b073c9e8ef7c","amp;dn":"Head+of+State%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7be6f772be091eb8d11cc5dc4d68b073c9e8ef7c","infoHashBuffer":{"type":"Buffer","data":[123,230,247,114,190,9,30,184,209,28,197,220,77,104,176,115,201,232,239,124]},"announce":[],"urlList":[]}}