{"title":"How I Escaped My Certain Fate by Stewart Lee","uid":9343089,"size":2505106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7cd9be758976f10e93baa675a1a61ca5c7cdebb9&amp;dn=How+I+Escaped+My+Certain+Fate+by+Stewart+Lee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1386971510,"description":"Experience how it feels to be the subject of a blasphemy prosecution! Find out why 'wool' is a funny word! See how jokes work, their inner mechanisms revealed, before your astonished face! \nIn 2001, after over a decade in the business, Stewart Lee quit stand-up, disillusioned and drained, and went off to direct a loss-making opera about Jerry Springer. How I Escaped My Certain Fate details his return to live performance, and the journey that took him from an early retirement to his position as the most critically acclaimed stand-up in Britain. \nHere is Stewart Lee's own account of his remarkable comeback, told through transcripts of the three legendary full-length shows that sealed his reputation. Astonishingly frank and detailed in-depth notes reveal the inspiration and inner workings of his act. With unprecedented access to a leading comedian's creative process, this book tell us just what it was like to write these shows, develop the performance and take them on tour. How I Escaped My Certain Fate is everything we have come to expect from Stewart Lee: fiercely intelligent, unsparingly honest and very funny.","torrent":{"xt":"urn:btih:7cd9be758976f10e93baa675a1a61ca5c7cdebb9","amp;dn":"How+I+Escaped+My+Certain+Fate+by+Stewart+Lee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd9be758976f10e93baa675a1a61ca5c7cdebb9","infoHashBuffer":{"type":"Buffer","data":[124,217,190,117,137,118,241,14,147,186,166,117,161,166,28,165,199,205,235,185]},"announce":[],"urlList":[]}}