{"title":"Turning Points - A.P.J. Abdul Kalam","uid":12174960,"size":2273290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d6ef40bc10ac65ddb7b99f4e1e0ea4c09a504cb&amp;dn=Turning+Points+-+A.P.J.+Abdul+Kalam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1438294282,"description":"Turning Points, available in paperback, is the sequel to Wings of Fire, which is an autobiography of Dr. A.P.J. Abdul Kalam. But this book talks more about the dreams and visions that Kalam had for the development of India as a country and very less about the person himself. This book takes off from the point in Kalam's life when he became the President of India. From being sworn in as the President and serving his term in the office at the capital, to the endeavors he took up to make his term fruitful, this book describes it all in detail. The book, Turning Points, describes how Kalam faced all the challenges he encountered during his term which began in 2002 and lasted till 2007. This span of time has been portrayed as an eventful golden time for India. Kalam's perseverant efforts to use the office to its optimum has been beautifully described. He made the people and the government concentrate on major issues that were important for the progress and welfare of India. Turning Points: A Journey Through Challenges was published on 1st June, 2012. It talks about the various programs initiated by Kalam like PURA. It made attempts in making the rural areas a part of the growth seen in the general economic sector. Kalam tried to see technological growth in the villages, as he dreamed about the vision he had in mind for India for the new millennium","torrent":{"xt":"urn:btih:7d6ef40bc10ac65ddb7b99f4e1e0ea4c09a504cb","amp;dn":"Turning+Points+-+A.P.J.+Abdul+Kalam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d6ef40bc10ac65ddb7b99f4e1e0ea4c09a504cb","infoHashBuffer":{"type":"Buffer","data":[125,110,244,11,193,10,198,93,219,123,153,244,225,224,234,76,9,165,4,203]},"announce":[],"urlList":[]}}