{"title":"Columbo - Seasons 3 and 4","uid":14553966,"size":10544534095,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7de4f82da8218efae23c95b4b9816e0ef139629f&amp;dn=Columbo+-+Seasons+3+and+4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":20,"time":1462672654,"description":"Description\r\nColumbo - Seasons 3 and 4\r\n\r\nimage\r\nSeason 3, Episode 1\r\nSeptember 23, 1973\r\nLovely but Lethal\r\nA cosmetic manufacturer murders an employee who stole the formula for a beauty cream. Columbo: Peter Falk. Lang: Vincent Price. Lessing: Martin Sheen. Secretary: Sian Barbara Allen.\r\n\r\nSeason 3, Episode 2\r\nOctober 7, 1973\r\nAny Old Port in a Storm\r\nA wine maker murders his brother, who is threatening to sell the family vineyard. Carsini: Donald Pleasence. Columbo: Peter Falk. Karen: Julie Harris. Ric: Gary Conway. Joan: Joyce Jillson.\r\n\r\nSeason 3, Episode 3\r\nNovember 4, 1973\r\nCandidate for Crime\r\nA senatorial candidate murders his campaign manager, passing it off as an attempt on his own life. Hayward: Jackie Cooper. Columbo: Peter Falk. Victoria: Joanne Linville. Linda: Tisha Sterling. Stone: Harry Swofford.\r\n\r\nSeason 3, Episode 4\r\nDecember 16, 1973\r\nDouble Exposure\r\nA research specialist uses subconscious stimuli to lure a victim to his death. Dr. Kepple: Robert Culp. Columbo: Peter Falk. White: Chuck McCann. Mrs. Norris: Louise Latham. Norris: Robert Middleton. Tanya: Arlene Martel.\r\n\r\nSeason 3, Episode 5\r\nJanuary 18, 1974\r\nPublish or Perish\r\nFaced with the defection of his most valuable author, a publisher murders the writer to collect a huge insurance benefit. Greenleaf: Jack Cassidy. Kane: John Chandler. Columbo: Peter Falk. Eileen: Mariette Hartley. Mallory: Mickey Spillane.\r\n\r\nSeason 3, Episode 6\r\nFebruary 10, 1974\r\nMind Over Mayhem\r\nA scientist has a son who plagiarized a discovery, and a colleague who threatens to reveal the fact. The solution: murder the would-be informer. Cahill: Jose Ferrer. Columbo: Peter Falk. Margaret Nicholson: Jessica Walter. Neill Cahill: Robert Walker. Steve: Lee H. Montgomery.\r\n\r\nSeason 3, Episode 7\r\nMarch 3, 1974\r\nSwan Song\r\nA singer murders his wife, an evangelist who exploits his talents to raise money for religious crusades. Tommy: Johnny Cash. Columbo: Peter Falk. Edna: Ida Lupino. Maryann: Bonnie Van Dyke. Luke: William McKinney.\r\n\r\nSeason 3, Episode 8\r\nMay 5, 1974\r\nA Friend in Deed\r\nA police commissioner murders his wife and pins the crime on a burglar. Columbo: Peter Falk. Halperin: Richard Kiley. Jessup: Val Avery. Dreyer: John Finnegan. Caldwell: Michael McGuire.\r\n\r\n\r\n\r\n\r\nSeason 4, Episode 1\r\nSeptember 15, 1974\r\nAn Exercise in Fatality\r\nA fitness expert murders a business associate. Milo Janus: Robert Conrad. Columbo: Peter Falk. Ruth Stafford: Collin Wilcox. Jessica: Gretchen Corbett. Buddy: Pat Harrington.\r\n\r\nSeason 4, Episode 2\r\nOctober 6, 1974\r\nNegative Reaction\r\nDick Van Dyke portrays a photographer who murders his wife and pins the crime on an ex-convict. Columbo: Peter Falk. Alvin Deschler: Don Gordon. Lorna McGrath: Joanna Cameron. Serge San Martin: David Sheiner.\r\n\r\nSeason 4, Episode 3\r\nOctober 27, 1974\r\nBy Dawn's Early Light\r\nThe director of a military academy murders the man who threatens to turn the school into a coed college. Rumford: Patrick McGoohan. Columbo: Peter Falk. Springer: Mark Wheeler.\r\n\r\nSeason 4, Episode 4\r\nFebruary 9, 1975\r\nTroubled Waters\r\nOn a cruise, Columbo probes the murder of the singer who performed with the ship's band. Filmed aboard an actual cruise. Danzinger: Robert Vaughn. Harrington: Dean Stockwell.\r\n\r\nSeason 4, Episode 5\r\nMarch 2, 1975\r\nPlayback\r\nAn electronics expert murders his mother-in-law and invents an ingenious scheme to cover his tracks. Van Wyck: Oskar Werner. Elizabeth: Gena Rowlands. Columbo: Peter Falk. Margaret: Martha Scott.\r\n\r\nSeason 4, Episode 6\r\nApril 27, 1975\r\nA Deadly State of Mind\r\nA psychiatrist has an affair with a patient and then kills her husband. Columbo: Peter Falk. Collier: George Hamilton. Nadia: Lesley Warren. Karl Donner: Stephen Elliott. Kramer: Bruce Kirby. Anita Borden: Karen Machon","torrent":{"xt":"urn:btih:7de4f82da8218efae23c95b4b9816e0ef139629f","amp;dn":"Columbo+-+Seasons+3+and+4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7de4f82da8218efae23c95b4b9816e0ef139629f","infoHashBuffer":{"type":"Buffer","data":[125,228,248,45,168,33,142,250,226,60,149,180,185,129,110,14,241,57,98,159]},"announce":[],"urlList":[]}}