{"title":"Salamina Soldiers-LG-Pt-En-Es","uid":4372850,"size":696716607,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7def9221ab2b71f210c48aab333fbba6c335323f&amp;dn=Salamina+Soldiers-LG-Pt-En-Es&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CarlosPit","files":4,"time":1220250684,"description":"When the professor and writer Lola SÃƒÂ¡nchez (Ariadna Gil) is assigned to write a column in the newspaper about the Spanish Civil War, she researches and finds for the first time about the shooting of Rafael SÃƒÂ¡nchez Mazas (Ramon FontserÃƒÂ¨). Lola has lost her passion for writing, and she becomes intrigued about Rafael, who was a writer and journalist that returned to Spain from the Italy of Mussolini and founded the fascist party Spanish Falange, becoming advisor of the leader Jose Antonio Primo de Rivera. When the lefts won the election in 1936, the Falange became illegal, and later there was a military coup d&amp;#039;stat. Rafael miraculously escaped from the shooting and was spared by an unknown soldier. Lola decides to write a book about the historic event and to disclose the identity of the unknown soldier. But her acquaintance Conchi (MarÃƒÂ­a Botto) advises that her work is affected by her lack of passion. When Lola reads a work of a student about the heroic former soldier Miralles (Joan Dalmau), Lola becomes obsessed to find him and see of he is connected to the event","torrent":{"xt":"urn:btih:7def9221ab2b71f210c48aab333fbba6c335323f","amp;dn":"Salamina+Soldiers-LG-Pt-En-Es","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7def9221ab2b71f210c48aab333fbba6c335323f","infoHashBuffer":{"type":"Buffer","data":[125,239,146,33,171,43,113,242,16,196,138,171,51,63,187,166,195,53,50,63]},"announce":[],"urlList":[]}}