{"title":"Real Boxing 2 Creed v1.0 [Mod+Unmod]","uid":12817269,"size":663670018,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:817b02112a20f9e68720fc2de07ed24c29652220&amp;dn=Real+Boxing+2+Creed+v1.0+%5BMod%2BUnmod%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":6,"time":1448245784,"description":"Take the fight to the next level in Real Boxing 2 CREED™ – the official mobile game of the movie CREED™! Train with the legendary Rocky Balboa and become the World Champion in the sequel to the award winning Real Boxing™. Ready for Round 2?\r\n\r\nFEATURES\r\n\r\nBECOME CREED AND CLAIM YOUR LEGACY\r\nEnter the ring as Adonis Johnson, the son of Rocky Balboaâ™s legendary rival Apollo Creed. Challenge the boxing elite, unlock unique CREED™ themed items, and fight to prove your legacy is more than a name in the official game of the movie CREED – coming to cinemas this November!\r\n\r\nJOIN AN ENDLESS FIGHTING EXPERIENCE\r\nChallenge an elite of boxing champions and players from around the world in single and multiplayer gameplay across hundreds of exciting events, story fights, and tournaments in a never-ending Career Mode.\r\n\r\nENGAGE IN FAST PACED ON-THE-RING ACTION\r\nMaster jabs, hooks, uppercuts, body punches and combine them with devastating Special Moves and Focus abilities creating the ultimate combo to crush your opponent.\r\n\r\nCHOOSE YOUR STYLE OF BOXING\r\nDevelop your boxerâ™s Strength, Stamina, Speed, and Endurance, level up your abilities, and equip powerful boosts to create your own unique fighting playstyle.\r\n\r\nUNLOCK HUNDREDS OF POWERFUL ITEMS\r\nProgress and gain access to a huge number of unique, upgradable and customizable gear, enhancing stats and abilities of your boxer.\r\n\r\nCREATE THE ULTIMATE FIGHTER\r\nUse a robust set of options to create your own boxer – from body mass, muscle sculpture, and attitude, to details as small as eye color and nose shape.\r\n\r\nCONNECT WITH FRIENDS\r\nInvite a friend and duke it out in real-time to find out whoâ™s the best boxer right here and now. Fight for best scores across a variety of leaderboards. Never stop competing!\r\n\r\nPLAY EXCITING MINIGAMES\r\nTrain your boxer in exciting minigames and try your luck in the Daily Lottery for a chance to win awesome rewards.\r\n\r\nFEEL THE POWER OF UNREAL ENGINE 4\r\nWitness jaw-dropping graphics fully utilizing the power of Unreal Engine 4 technology to create the most dynamic and visually stunning fighting game experience","torrent":{"xt":"urn:btih:817b02112a20f9e68720fc2de07ed24c29652220","amp;dn":"Real+Boxing+2+Creed+v1.0+%5BMod%2BUnmod%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"817b02112a20f9e68720fc2de07ed24c29652220","infoHashBuffer":{"type":"Buffer","data":[129,123,2,17,42,32,249,230,135,32,252,45,224,126,210,76,41,101,34,32]},"announce":[],"urlList":[]}}