{"title":"Eusing Software Maze Lock v3.5 Build 20160608","uid":15169390,"size":1320072,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:82282c674c1ccc103e4dcbf881a0c84522d0f243&amp;dn=Eusing+Software+Maze+Lock+v3.5+Build+20160608&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":1,"time":1467380795,"description":"Eusing Software Maze Lock v3.5 Build 20160608\r\n\r\nLocking your screen prevents other people from accessing your computer while you are away from it. There are several applications able to help you lock your computer. However, few of these applications are comparable to Eusing Maze Lock.\r\n\r\nEusing Maze Lock uses a new technique to help your computer. This technique is pattern based. You need first to set your own unlock pattern by connecting some of the nine dots together (There is a default unlock pattern has been pre-set). When you try to unlock your computer, you need to draw the same pattern exactly as you set. It is a cool software which lets you to lock your pc with your customize maze.\r\n\r\nEusing Maze Lock is a powerful tool designed to help you lock your computer with a single click on the tray icon. While it provides a different locking system than the one bundled into Windows, Eusing Maze Lock places an icon in the system tray that allows you to either lock the machine instantly or using a custom hotkey. Then Eusing Maze Lock will display a lock screen and protected your computer.\r\n\r\nOverall, Eusing Maze Lock is a useful application that serves its purpose and provides some interesting configuration options that can be easily set up by both beginners and more experienced users. You can specify the lock screen background image, change the pattern to 4 x 4 or 5 x 5. Eusing Maze Lock can auto-lock the computer when windows startup and computer inactivity. \r\n\r\nWith this unique application installed on your computer you will get a truly impressive security application.\r\n \nhttp://www.eusing.com/mazelock/pclock.htm","torrent":{"xt":"urn:btih:82282c674c1ccc103e4dcbf881a0c84522d0f243","amp;dn":"Eusing+Software+Maze+Lock+v3.5+Build+20160608","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82282c674c1ccc103e4dcbf881a0c84522d0f243","infoHashBuffer":{"type":"Buffer","data":[130,40,44,103,76,28,204,16,62,77,203,248,129,160,200,69,34,208,242,67]},"announce":[],"urlList":[]}}