{"title":"D H Lawrence - Women in Love (BBC Drama)","uid":4622197,"size":219183641,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:829c7ec5154cd8170b7231ad6e045184d3d04aa6&amp;dn=D+H+Lawrence+-+Women+in+Love+%28BBC+Drama%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheila6","files":10,"time":1231081225,"description":"Ursula and Gudrun Brangwen are two sisters living in the Midlands of England in the 1910s. Ursula is a teacher, Gudrun an artist. They meet two men who live nearby, Rupert Birkin and Gerald Crich. The four become friends. Ursula and Birkin become involved and Gudrun eventually begins a love affair with Gerald.\n\nAll four are deeply concerned with questions of society, politics, and the relationship between men and women. At a party at Gerald's manor house, Gerald's sister, Diana, drowns. Gudrun becomes the teacher and mentor of his youngest sister. Soon Gerald's coal-mine-owning father passes away as well after a drawn-out illness.\n\nBirkin asks Ursula to marry him, and she agrees. Gerald and Gudrun's relationship, however, becomes stormy. The four vacation in the Alps. Gudrun begins an intense friendship with Loerke, a physically puny but emotionally commanding artist. Gerald, enraged by Loerke, by Gudrun's abuse and by his own destructive nature, tries to murder Gudrun. In failing, he retreats back over the mountains and falls to his death in the snow.\n\n","torrent":{"xt":"urn:btih:829c7ec5154cd8170b7231ad6e045184d3d04aa6","amp;dn":"D+H+Lawrence+-+Women+in+Love+%28BBC+Drama%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"829c7ec5154cd8170b7231ad6e045184d3d04aa6","infoHashBuffer":{"type":"Buffer","data":[130,156,126,197,21,76,216,23,11,114,49,173,110,4,81,132,211,208,74,166]},"announce":[],"urlList":[]}}