{"title":"EnigmaT Set Rips { Cuts } - May 23rd, 2013","uid":8501367,"size":1038067732,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82fb298a09f54d1e48b0da143e87d79e2f05d262&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+23rd%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":110,"time":1369307362,"description":"Active Limbic System &amp; Chris Voro - Hallucinosis (Cut From Bluehawk Set)-enTc.mp3\nAddictive &amp; Glance vs Trian - Alliance (Holbrook &amp; SkyKeeper Remix) (Cut From Mazza Set)-enTc.mp3\nAivem vs. Vilmo - Xuri (Thomas G Remix) (Cut From El Jay Set)-enTc.mp3\nAlex Boboc - Between Worlds (Cut From Rank 1 Set)-enTc.mp3\nAllen Ardour - Standing Close (Cut From Rank 1 Set)-enTc.mp3\nAllen Watts - Out Of Reach (Thomas Hayes Remix) (Cut From Ronde Set)-enTc.mp3\nAly &amp; Fila Feat. Giuseppe Ottaviani - Brilliant People (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nAmp Kat - Airbus (Original Mix) (Cut From Shiver Set)-enTc.mp3\nAnalog Trip - Declaration Of Silence (Ilias Katelanos Remix) (Cut From Aris Set)-enTc.mp3\nAr-2 - Evergreen (Mind Skull Remix) (Cut From El Jay Set)-enTc.mp3\nAraya &amp; Mark Dreamer - Tension (Gary Afterlife Remix) (Cut From First Effect Set)-enTc.mp3\nArnej - Moment Of Truth (Cut From Abstract Set)-enTc.mp3\nAscania - Fundamental Questions (Kaimo K Remix) (Cut From Angel Ace Set)-enTc.mp3\nAshley Nutton - Hardrest (Dave Cold Remix) (Cut From Cold Set)-enTc.mp3\nAWD - In Time (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nB-Fairy - Reveille (Cut From Abstract Set)-enTc.mp3\nBeatsole - Afterglow (Blugazer Remix) (Cut From Solarstone Set)-enTc.mp3\nBolotbek Rysbekov - IK Moonlight (Erick Strong Remix) (Cut From Abstract Set)-enTc.mp3\nBryan Kearney pres. Karney - Bakbreaker (Colin James &amp; Indecent Noise Remix) (Cut From Xabi Set)-enTc.mp3\nCarlo Calabro - Hamstad Paradise (Cut From Rank 1 Set)-enTc.mp3\nChris Voro - Dioxide (Sulfer Mix) (Cut From Bluehawk Set)-enTc.mp3\nCiro Visone - Relight (Original Mix) (Cut From El Jay Set)-enTc.mp3\nCurtis &amp; Craig - Kinnari (TranceRadio.fm Anthem) (Original Mix) (Cut From Summerville Set)-enTc.mp3\nDamian Wasse &amp; Manuel Le Saux - Around Heaven (UDM Remix) (Cut From Summerville Set)-enTc.mp3\nDamian Wasse - London Gate (Original Mix) (Cut From Feel Set)-enTc.mp3\nDamian Wasse - Night Of Love (Cut From Lange Set)-enTc.mp3\nDaniel Kandi &amp; Jack Rowan - Arigatou (Cut From Tritonal Set)-enTc.mp3\nDarren Porter &amp; Simon Dixon - Sledgehammer (Cut From Tayle Set)-enTc.mp3\nDiego Morrill pres. TDM - Matriz D (Original Mix) (Cut From El Jay Set)-enTc.mp3\nDJ ARTAK - Fly in the Sky (Original Mix) (Cut From Summerville Set)-enTc.mp3\nDJ Feel, Vadim Spark &amp; Phil Shabin - So Lonely (Album Mix) (-OvErSpAmMeD- Cut From Feel Set)-enTc.mp3\nDreamy - Tyr (TrancEye Remix) (Cut From El Jay Set)-enTc.mp3\nE.T Project - Far Away (Original Mix) (Cut From Uplift Set)-enTc.mp3\nEmanuele Congeddu - Souls Of Moai (Original Mix) (Cut From Summerville Set)-enTc.mp3\nEmpire Of The Sun - Alive (Mat Zo Remix) (Cut From Shiver Set)-enTc.mp3\nErick Strong - UNTITLED -May 2013- (Cut From Feel Set)-enTc.mp3\nEssonita feat. Irina Makosh - Deeper And Deeper (Original Mix) (Cut From MORPH Set)-enTc.mp3\nEssonita feat. Irina Makosh - Don't Try To Love Me (Dreamy Vocal Mix) (Cut From Summerville Set)-enTc.mp3\nFacade - Fast Lane (Original Mix) (Cut From First Effect Set)-enTc.mp3\nFerrin &amp; Morris - Renegade (Cut From Bond Set)-enTc.mp3\nGiuseppe Ottaviani - Feel The Music (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nGiuseppe Ottaviani With Ferry Corsten - Magenta (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nHooya - The Better Side (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nHypaethrame - Fake World (Zutt Muziker Remix) (Cut From El Jay Set)-enTc.mp3\nHyperbits - Karekare (Cut From Bobina Set)-enTc.mp3\nInfite - True Love (Original Mix) (Cut From a'ndY Set)-enTc.mp3\nJames Dymond - Millenium (Cut From Xabi Set)-enTc.mp3\nJames Williams - The District (Original Mix) (Cut From Summerville Set)-enTc.mp3\nJames Woods - Bliss (Blood Groove &amp; Kikis Remix) (Cut From Ronde Set)-enTc.mp3\nJames Woods - Bliss (Jon Medina Remix) (Cut From Shiver Set)-enTc.mp3\nJesse Voorn - Prime (Cut From Ferry Set)-enTc.mp3\nJochem Loedeman - Dalliance (Original Mix) (Cut From Luke Terry Set)-enTc.mp3\nJohn Newell - Trancelate (Original Mix) (Cut From Kandi Set)-enTc.mp3\nKarybde &amp; Scylla - Kontact (Cut From Tayle Set)-enTc.mp3\nKoko B. feat. Anthya - Unconditional Love (Laker &amp; Mihailov Dub Mix) (Cut From Cold Set)-enTc.mp3\nLessov - Nakali (Cut From Poshout Set)-enTc.mp3\nLucas Moor &amp; Adam Rockney - Esther (Original Mix) (Cut From Romel Set)-enTc.mp3\nMagnetic Brothers - City On The Clouds (Original Mix) (Cut From Aris Set)-enTc.mp3\nMaRLo Feat. Sarah Swagger - Always Be Around (Original Mix) (Cut From MORPH Set)-enTc.mp3\nMatson - Second Rule (Original Mix) (Cut From Kandi Set)-enTc.mp3\nMatt Chowski - She Was My Everything (Original Mix) (Cut From Uplift Set)-enTc.mp3\nMatty Graham - Days Wasted (Cut From Ronde Set)-enTc.mp3\nMatty Graham - Days Wasted (Original Mix) (Cut From Luke Terry Set)-enTc.mp3","torrent":{"xt":"urn:btih:82fb298a09f54d1e48b0da143e87d79e2f05d262","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+23rd%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82fb298a09f54d1e48b0da143e87d79e2f05d262","infoHashBuffer":{"type":"Buffer","data":[130,251,41,138,9,245,77,30,72,176,218,20,62,135,215,158,47,5,210,98]},"announce":[],"urlList":[]}}