{"title":"Time Team, UK - Season 02 - 5 Episodes","uid":8607345,"size":1559488390,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8301fef5f75c0633989762decb050c9bf116083f&amp;dn=Time+Team%2C+UK+-+Season+02+-+5+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Django_3801","files":5,"time":1372048469,"description":"Season TWO of the UK Channel 4 series, Time Team\n\nEpisode Guide:\n\n1 - Lords of the Isles (Finlaggan Islay, Western Isles) - 640x480 - H.264/MP3\n\n    The Time Team have just three days to investigate a site in the remote Western Isles of Scotland. On Islay, home to some or the finest malt whiskies, the team join a dig that is running out of time.\n\n    Battling against the elements they try to crack the mysteries of the Lord of the Isles - where were these 13th Century Kings crowned and how did they live?\n\n2 - The Saxon Graves (Winterbourne Gunner, Wiltshire) - 640x480 - H.264/MP3\n\n    This episode takes an in-depth look at archaeology as it happens in a derelict medieval castle stranded in the middle of a Sunderland housing estate.\n\n    Local residents want to renovate Hilton Castle and design a new park in the surrounding grounds. Archaeologist Mick Aston and Tony Robinson team up lo provide the archaeological information that will enable them to achieve this in keeping with the castle's illustrious past.\n\n3 - The Lost Villa (Tockenham, Wiltshire) - 640x480 - H.264/MP3\n\n    The Time Team visit the picturesque village of Tockenham, deep in the heart of the ancient Wiltshire countryside. Despite the fact that there are no Roman remains in Tockenham, the village's 15th century church, St Giles, has a small pagan Roman statue embedded in one of its outer walls.\n\n    The Time Team have just three days to solve this riddle. If there is no evidence of Roman settlement, where did the Roman statue come from? Is the church on an earlier Roman site and does it have ancient ceremonial significance?\n\n4 - The Archbishop's Back Garden (Lambeth Palace, London) - 640x480 - H.264/MP3\n\n    Historically it was believed that the original Roman road into London veered east and crossed the river at Tower Bridge, placing the original site for the Roman capital of Londinium in the financial centre of the modern day city. But 60 years ago an amateur archaeologist, Bernard Davis, upset the status quo when he excavated what he believed to be the remains of the first Roman road into London - in the gardens at Lambeth Palace. Yet the existence of the road has never been verified and the site left unexplored.\n\n    The Time Team have just three days to try and relocate Bernard Davis' Roman road and solve some of the fascinating questions its discovery poses. Did the first road the Romans built into London really cross the river at Lambeth rather than Tower Bridge and if so, does this mean that Lambeth, and not the City, was the site of the original Roman settlement?\n\n5 - Medieval Dining Hall (Hylton Castle, Sunderland) - 640x480 - H.264/MP3\n\n    A building site in the village of Winterboume Gunner, near Salisbury, stands abandoned. Previous developments on the surrounding land unearthed evidence of a Saxon burial ground and the council placed a protection order on the area halting all further building.\n\n    The Time Team, aim to establish the full extent of the burial ground and in the process reveal the history of Saxon settlement in this small Wiltshire village.\n","torrent":{"xt":"urn:btih:8301fef5f75c0633989762decb050c9bf116083f","amp;dn":"Time+Team%2C+UK+-+Season+02+-+5+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8301fef5f75c0633989762decb050c9bf116083f","infoHashBuffer":{"type":"Buffer","data":[131,1,254,245,247,92,6,51,152,151,98,222,203,5,12,155,241,22,8,63]},"announce":[],"urlList":[]}}