{"title":"The Measure of Civilization (2013) epub","uid":9503607,"size":5273844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83b31148c25411de4fd75b6b5d44a49125226a71&amp;dn=The+Measure+of+Civilization+%282013%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1390272954,"description":"The Measure of Civilization: How Social Development Decides the Fate of Nations\n\n\nIn the last thirty years, there have been fierce debates over how civilizations develop and why the West became so powerful. The Measure of Civilization presents a brand-new way of investigating these questions and provides new tools for assessing the long-term growth of societies. Using a groundbreaking numerical index of social development that compares societies in different times and places, award-winning author Ian Morris sets forth a sweeping examination of Eastern and Western development across 15,000 years since the end of the last ice age. He offers surprising conclusions about when and why the West came to dominate the world and fresh perspectives for thinking about the twenty-first century. \n\n Adapting the United Nations' approach for measuring human development, Morris's index breaks social development into four traits--energy capture per capita, organization, information technology, and war-making capacity--and he uses archaeological, historical, and current government data to quantify patterns. Morris reveals that for 90 percent of the time since the last ice age, the world's most advanced region has been at the western end of Eurasia, but contrary to what many historians once believed, there were roughly 1,200 years--from about 550 to 1750 CE--when an East Asian region was more advanced. Only in the late eighteenth century CE, when northwest Europeans tapped into the energy trapped in fossil fuels, did the West leap ahead. \n\n Resolving some of the biggest debates in global history, The Measure of Civilization puts forth innovative tools for determining past, present, and future economic and social trends.","torrent":{"xt":"urn:btih:83b31148c25411de4fd75b6b5d44a49125226a71","amp;dn":"The+Measure+of+Civilization+%282013%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83b31148c25411de4fd75b6b5d44a49125226a71","infoHashBuffer":{"type":"Buffer","data":[131,179,17,72,194,84,17,222,79,215,91,107,93,68,164,145,37,34,106,113]},"announce":[],"urlList":[]}}