{"title":"All The Way - Australia v America in Vietnam","uid":11844974,"size":273807469,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:83ba77d4a35813d55602cfd76ded00236ce6ec48&amp;dn=All+The+Way+-+Australia+v+America+in+Vietnam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FromMe2U","files":1,"time":1429932559,"description":"'All the Way with LBJ' was a slogan that came to haunt the Australian Government after it hitched its wagon to America during the Vietnam War.\n\nTaking its name from a part of this catchcry, this frank and poignant documentary shows the war, which became the most hated conflict in Australian history, not only tested Australian soldiers, it stretched Australia's friendship with America to breaking point.\n\nBased on Paul Ham's book Vietnam; The Australian War, and presented by the author, the film claims America's indifference to Australia during the war revealed the truism that governments have no true friends, only interests. It shows why Australia really went to war in Vietnam, why we stayed and the price we paid.\n\nThe film includes contemporary footage of Ham in key locations of the Vietnam War, with excusive never-before-seen archival footage and stills from personal and institutional archives in Australia, America and Vietnam. And it reveals for the first time a brutal Australian expert in guerrilla warfare who trained local Vietnamese to murder thousands of their fellow civilians in his own personal crusade to stop the spread of atheistic Communism.\n\nIt wasn't only on the battlefield that Australia's difference with America emerged. And it was in the realms of politics and economics that the differences turned cold. America allegedly kept Australia in the dark on major policy shifts and decisions","torrent":{"xt":"urn:btih:83ba77d4a35813d55602cfd76ded00236ce6ec48","amp;dn":"All+The+Way+-+Australia+v+America+in+Vietnam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83ba77d4a35813d55602cfd76ded00236ce6ec48","infoHashBuffer":{"type":"Buffer","data":[131,186,119,212,163,88,19,213,86,2,207,215,109,237,0,35,108,230,236,72]},"announce":[],"urlList":[]}}