{"title":"FIVE Scream - The True Story xvid ac3","uid":9114231,"size":367235916,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:84ced3eb6bd84ce5feb0010e75c154a41d3f020b&amp;dn=FIVE+Scream+-+The+True+Story+xvid+ac3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"catflap","files":-1,"time":1382999129,"description":"Scream - The True Story\nFirst broadcast 27 Oct 2013\nFIVE\n\nSlasher movie Scream spawned one of the most commercially\nsuccessful horror franchises in movie history, raking in more\nthan 400 million dollars in the US alone. Its iconic villain,\nknown as Ghostface, is a sadistic serial killer who has\nentertained and terrified audiences in equal measure since his\nfirst on-screen outing in 1996.\n\nDirected by horror supremo Wes Craven, the man behind the Nightmare\non Elm Street series, the first Scream movie is credited with\nrevitalising the horror genre. A blend of murder mystery and\nslasher violence, it turned the classic horror movie on its head\nby playing on the genre's stereotypes and rules.\n\nSet in the small, fictional town of Woodboro, Scream follows high\nschool student Sydney Prescott (Neve Campbell) as she becomes the\nnext target of a sadistic masked murderer who first torments his\nvictims through phone calls.\n\nAlthough the plotline may seem pure Hollywood fiction, the movie,\npenned by screenwriter Kevin Williamson, was partly inspired by\nhorrific true events and a real masked murderer who terrified a\nsmall town.\n\nOver a week in the summer of 1990, 36-year-old Danny Harold Rolling\nstalked, tortured and murdered five young students in Gainesville,\nFlorida. The serial killings sparked mass panic, a student exodus\nand the largest manhunt in Florida's history.\n\nThe crime scenes were so horrific that the newspapers dubbed the\nkiller the Gainesville Ripper. Scream: The True Story explores the\nimpact Rolling's brutal killing spree had on the university town of\nGainesville, from the media frenzy to the terror and paranoia that\nswept across the small community once dubbed by Money Magazine as\nAmerica's best.\n\nThe film follows the trials and tribulations of the year-long police\ninvestigation to track down Rolling, the rumours, the missed evidence\nand the wrongful arrest of a scarred schizophrenic. It tells the story\nof how the forensic team finally pieced together the killer's methodology\nand the key piece of evidence that finally led to the capture of one of\nAmerica's most brutal and frightening killers, revealing that reality\ncan sometimes be even more terrifying than Hollywood fiction.\n\nSize: Size: 367,230,976 bytes (350.219 MB)\nPlay duration: 00:45:17\nXviD\nac3\nDigital cable tv\n\n**********\n**********\n\nTHIS IS MY OWN DIGITAL CABLE TV RECORDING AND ENCODE.\n\nIF YOU WANT THE INFERIOR X264 VERSION, GO SOMEWHERE ELSE.\n\nDON'T COMPLAIN. DON'T WHINGE OR WHINE. IT'S FREE.\n\nAND I'M NOT INTERESTED.","torrent":{"xt":"urn:btih:84ced3eb6bd84ce5feb0010e75c154a41d3f020b","amp;dn":"FIVE+Scream+-+The+True+Story+xvid+ac3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84ced3eb6bd84ce5feb0010e75c154a41d3f020b","infoHashBuffer":{"type":"Buffer","data":[132,206,211,235,107,216,76,229,254,176,1,14,117,193,84,164,29,63,2,11]},"announce":[],"urlList":[]}}