{"title":"[1990] - Peter Jefferies - The Last Great Challenge In A Dull Wo","uid":8550006,"size":87928951,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:850700ffba9abc0adf6c1b603fc0f5b2334b0409&amp;dn=%5B1990%5D+-+Peter+Jefferies+-+The+Last+Great+Challenge+In+A+Dull+Wo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pigwiggle","files":14,"time":1370622968,"description":"Jefferies' full solo debut features his return to vocals. It also presents one of the most amazing collections of New Zealand musicians around to assist him; the guest list practically reads like a combination of the Flying Nun and Xpressway rosters, with Bruce Russell, Alastair Galbraith, Kathy Bull, Robbie Yeats, and Michael Morley being just some of the participants. This is still Jefferies' album all the way, though. The fantastic job he does with it is a wonder, working his unique blend of indirect fierceness and restrained passion, lyrically and musically, to newer heights. His piano playing and drumming understandably take pride of place here, as does his unusual speak-singing baritone (though sometimes this crops up in different contexts than before). &quot;Domesticia,&quot; for instance, features him singing an a cappella rumination as various kitchen and household noises rattle and clash around him. Perhaps his most moving composition ever (and one of the few on the album he does entirely by himself), &quot;On an Unknown Beach,&quot; features just him and his piano, revisiting the darker impulses of his This Kind of Punishment days, but here with a strong, new emotionalism and a finely honed sense of moody beauty. His penchant for tape manipulation and inventive production remains strong throughout; &quot;The House of Weariness&quot; is particularly striking on this point, as heavily flanged vocals from Jefferies play over a calm piano line while other odd noises and vocals appear and disappear almost randomly. The Ajax reissue adds the contemporaneous &quot;Fate of the Human Carbine&quot; single that Jefferies recorded with Robbie Muir as a bonus; its gentle, brooding tension and the almost-rollicking guitar crunch &quot;Catapult&quot; on the flipside further add to the appeal of this excellent album. ","torrent":{"xt":"urn:btih:850700ffba9abc0adf6c1b603fc0f5b2334b0409","amp;dn":"%5B1990%5D+-+Peter+Jefferies+-+The+Last+Great+Challenge+In+A+Dull+Wo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"850700ffba9abc0adf6c1b603fc0f5b2334b0409","infoHashBuffer":{"type":"Buffer","data":[133,7,0,255,186,154,188,10,223,108,27,96,63,192,245,178,51,75,4,9]},"announce":[],"urlList":[]}}