{"title":"Fleetwood Mac - Mystery To Me (1973)Mp3[CR-Bt)","uid":4635250,"size":79933708,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:85fb3232172ae1f3f55228ff8fa657e64194c9cc&amp;dn=Fleetwood+Mac+-+Mystery+To+Me+%281973%29Mp3%5BCR-Bt%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tathiana","files":12,"time":1231529102,"description":"\nI Fleetwood Mac, una delle formazioni storiche del blues revival inglese, si formarono nel 1967 sulle ceneri della formazione di Hard Road, l'album di John Mayall. Alla chitarra c'era un altro enfant prodige scoperto da Mayall, Peter &quot;Green&quot; Greenbaum. John McVie al basso, Mick Fleetwood alla batteria (entrambi nei Bluesbreakers con Green), e Jeremy Spencer alla chitarra bottleneck completavano il quartetto. Green e Fleetwood erano gia` stati compagni nel 1965 nei Peter B's Looners (con Peter Bardens, futuro Camel) e nel 1967 nei Shotgun Express (con Rod Stewart, futuro Faces).\nPeter Green, il principale compositore, pennellava brani eccentrici e accattivanti (tutti usciti su singolo): il primitivismo voodoo di Ramblin Pony (1967), il suo brano piu` sinistro, il tribalismo esoterico di Black Magic Woman (1968), il suo tema piu` celebre, lo strumentale hawaiano Albatross (1968), la sua prima confessione mistica, la serenata dilatata di Man Of The World (1969), la sua canzone piu` lisergica, e l'inno trascendente The Green Mahalishi (1970), tutti contrassegnati dal poetico accompagnamento della chitarra e da un sound volutamente arcaico e dimesso.\nLa maggior parte del loro repertorio era comunque costituito da riproduzioni fedelissime, per quanto elettriche, dei classici blues. Se i Savoy Brown erano i piu` trascinanti esponenti del boogie, i Fleetwood erano i piu` raffinati cultori del &quot;lento&quot;. Vintage Years (Sire, 1977) e` un'antologia di questi primi anni.\n\nVittime di crisi religiose, sia Green sia Spencer (convertitosi a una setta religiosa di Los Angeles) lasciarono il complesso, ma subentro` invece Christine Perfect (gia` nei Chicken Shack, ma adesso sposa di McVie) al canto e alle tastiere.\n\nIl nuovo chitarrista Bob Welch domina gli album del periodo peggiore: Future Games (1971), forte di una title-track di otto minuti, Bare Trees (1972), l'ultimo con Kirwan (che pennella Bare Trees, Dust, e Sunny Side Of Heaven) e quello con Sentimental Lady, Penguin (1973), Mystery To Me (1973), Heroes Are Hard To Find (1974). Il sound era diventato un pop senza grandi pretese artistiche.","torrent":{"xt":"urn:btih:85fb3232172ae1f3f55228ff8fa657e64194c9cc","amp;dn":"Fleetwood+Mac+-+Mystery+To+Me+%281973%29Mp3%5BCR-Bt%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85fb3232172ae1f3f55228ff8fa657e64194c9cc","infoHashBuffer":{"type":"Buffer","data":[133,251,50,50,23,42,225,243,245,82,40,255,143,166,87,230,65,148,201,204]},"announce":[],"urlList":[]}}