{"title":"OFFICE 2016 PROPLUS X86/X64 FRENCH MSDN","uid":15196276,"size":2428917760,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:86e86ed69633ef5d1f5b1e4c11afd0a93283a6f4&amp;dn=OFFICE+2016+PROPLUS+X86%2FX64+FRENCH+MSDN&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"annuaireweb","files":1,"time":1467574969,"description":"OFFICE 2016 PROPLUS X86/X64 FRENCH MSDN\r\n\r\nOffice 2016 est enfin là. La plus célèbre suite de bureautique du monde se modernise pour s'adapter aux besoins des utilisateurs d'aujourd'hui grâce à une intégration totale au cloud et la possibilité de créer des documents sur n'importe quel support: ordinateur, mobile ou tablette.\r\n\r\nUn produit star peaufiné\r\nAvec Office 2016, Microsoft ne prétend pas révolutionner son produit phare, mais plutôt d'améliorer les éléments déjà introduits dans la version Office 2013. Ces améliorations visent surtout le travail collaboratif, quelle que soit la plateforme utilisée, et l'adaptation aux besoins d'aujourd'hui.\r\nAu rang des grandes nouveautés introduites dans le millésime 2016, on comptera tout de même l'intégration totale et naturelle des logiciels à OneDrive, qui n'était encore qu'ébauchée dans la version précédente, et la possibilité de travailler à plusieurs et à distance dans l'édition de documents en temps réel. L'utilisateur peut désormais visualiser les modifications introduites par ses collaborateurs depuis leurs propres ordinateurs.\r\nSi vous souhaitez amplifier les fonctionnalités d'Office 2016, vous pouvez toujours recourir à la boutique d'applis où vous trouverez toutes sortes de compléments et modèles nouveaux (dont quelques-uns sont téléchargeables pour Office 2013). S'y ajoutent également la batterie des extensions disponibles. Quant aux changements ajoutés à Office 2016, s'ils se font discrets, ils apportent tout de même une amélioration notable à l'accessibilité et aux performances de la suite logicielle.\r\nOn notera curieusement le retour de Clippy, quoique sous une autre forme, puisque l'outil assume désormais des fonctions semblables à celles de Cortana (introduit d'ailleurs, sous Windows 10, à Office 2016). Clippy fonctionne donc comme un moteur de recherche: si vous introduisez le mot &quot;commentaire&quot;, l'outil va vous suggérer la fonction &quot;Insérer un commentaire&quot;, mais au lieu de vous expliquez comment, il va tout bonnement le faire à votre place. \r\n\r\nLa nouvelle puissance de la suite logicielle\r\nWord 2016 n'apporte pas de grandes nouveautés à part celles concernant le travail collaboratif et l'accès direct à OneDrive. Mais c'est déjà beaucoup, tant la collaboration en temps réel s'avère utile pour Word 2016 comme pour PowerPoint 2016.\r\nExcel 2016, un des programmes les plus prisés de la suite, affiche un nouveau menu simplifié, même si l'interface reste à peu près inchangée par rapport à la version 2013. Mais attention: les changements ont beau ne pas sauter aux yeux, ceux qui manipulent de gros volumes de données remarqueront avec satisfaction que Microsoft a renforcé les capacités de son Business Intelligence par le biais d'utilitaires qui, jusqu'à présent, n'étaient disponibles que séparément. Ces add-ons incluent Power Query et PowerView, qui servent à chercher des données en profondeur et à générer des rapports.\r\nOutlook 2016 surprend en revanche par sa focalisation sur les aspects réellement essentiels du courrier électronique. Par exemple, Microsoft a ajouté des fonctionnalités visant à obtenir cette fameuse &quot;boite de courrier entrant vide&quot;. En ce sens, Outlook filtre intelligemment vos mails et réexpédie les moins importants vers des dossiers secondaires.\r\nDans la version Windows, le ruban de fonctions d'Outlook 2016 fonctionne différemment: plutôt que d'afficher en permanence les options disponibles, celles-ci restent cachées jusqu'à ce que vous cliquiez sur l'onglet correspondant. Toute une série de nouveaux graphiques et tableaux sont désormais à portée de clic, parmi lesquels TreeMap, Sunburst, Waterfall, Box &amp; Whisker, y Histogram &amp; Pareto.\r\nLe grand changement se situe en fait dans le remplacement de Lync par Skype for Business qui offre aux utilisateurs professionnels un nouveau système de messagerie automatique, plus épuré en apparence, et intégré aux autres outils de la suite logicielle. Par exemple, vous pouvez partager vos documents lors d'une visioconférence ou commenter directement avec vos correspondants le travail réalisé en temps réel sur votre Bureau.\r\nEn fait, si bon nombre des améliorations apportées ne sont pas directement visibles, c'est pour éviter que les données ne soient directement accessibles au cas où les documents d'Office tomberaient entre de mauvaises mains. C'est le cas notamment des améliorations apportées à l'accessibilité et aux performances.\r\n\r\nLe meilleur est encore à venir\r\nPris dans leur ensemble, les changement apportés par Office 2016 sont mineurs et, mis à part l'assistant Dites-nous ce que vous voulez faire, ils ne sont pas vraiment visibles aux yeux des utilisateurs normaux. La plupart des nouveautés, comme les améliorations de la BI pour Excel, s'adressent plutôt à un public d'experts, même si on comprend mal les carences d'Outlook 2016 par rapport à sa version Mac. Espérons que Microsoft nous en dise en peu plus long avant la sortie officielle d'Office","torrent":{"xt":"urn:btih:86e86ed69633ef5d1f5b1e4c11afd0a93283a6f4","amp;dn":"OFFICE+2016+PROPLUS+X86%2FX64+FRENCH+MSDN","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86e86ed69633ef5d1f5b1e4c11afd0a93283a6f4","infoHashBuffer":{"type":"Buffer","data":[134,232,110,214,150,51,239,93,31,91,30,76,17,175,208,169,50,131,166,244]},"announce":[],"urlList":[]}}