{"title":"Masters_of_Russian_Animation_Vol_1_MKO","uid":4670834,"size":992634712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:87f8fa7ba85613a16831f1b5dd657ee421b99721&amp;dn=Masters_of_Russian_Animation_Vol_1_MKO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rpessoa","files":19,"time":1232728383,"description":"Volume 1\n\nStory of One Crime - Director: Fyodor Khitruk (1962) http://www.imdb.com/title/tt0487622/\n1962 marked the directorial debut of Fyodor Khitruk, the distinguished animator of some of the greatest animation ever produced in Russia. One of the first animated films made by Soyuzmultfilm for adults. Story of one Crime ushered in a new era of Russian animation by taking up social themes and expounding on them with distinctive eloquence. The Film tells the story of the &quot;little man&quot; and seems quite ordinary - But it is told with a mischievous sharp wit.\n\nMan in the Frame - Director: Fyodor Khitruk (1966) http://www.imdb.com/title/tt0487563/\nMany in the Russian animation industry are still amazed that Man in the Frame was ever produced, not to mention approved and widely distributed in the USSR. Khitruk had for several years wanted to make a film which openly critiqued bureaucrats instead of disguising them as bears or beavers in children's fairy tales. Innovative visuals were created with collage and dramatized by masterful use of music.\n\nMy Green Crocodile - Director: Vadim Kurchevsky (1966) http://www.imdb.com/title/tt0480434/\nOne of the first films directed by the late Vadim Kurchevsky. An experienced artist, he began work at Soyuzmultfilm in 1957as an art director in the studio's stop motion department. By the mid-'60s Soyuzmultfilm was already known internationally for stop motion films produced for children. Kurchevsky began to use these same techniques to address adult viewers and to make films about modern-day problems. My Green Crocodile abounds in metaphors, which tell of unusual love and th courage of commitment.\n\nThere Lived Kozyavin - Director: Andrei Khrjanovsky, (1966) http://www.imdb.com/title/tt0480487/\nwho had just graduated from the Soviet State Film School (VGIK). Khrjanovsky who began his career at Soyuzmultfim working for Fyodor Khitruk, represented the new type of erudite director who emerged during this period; an intellectual connoisseur of world art, utterly irreverent of of the animation industry's previous artistic and literary constraints. There Lived Kozyavin, made the same year as Man In The Frame\n\nMountain Of Dinosaurs - Director: Rasa Stautmane (1967) http://www.imdb.com/title/tt0487605/\nWas the second feature by Rasa Strautmane, a woman director born in Latvia. The story was visually light and simple. Soviet censors did not recognize that in the little tale of a shell that protected a baby dinosaur so well that it suffocated him, audiences would find parallels with the stifling state care of the individual.\n\nPassion of Spies - Director: Yefim Gamburg (1967) http://www.imdb.com/title/tt0487763/\nThe second feature directed by Yefim Gamburg, an artist who began working at Soyuzmultfilm in 1955 and animated many of the best children's poems, fairy tales and songs. He turned his attention to adults with &quot;Passions of Spies,&quot; reviewing dozens of Soviet spy and detective films to make Soyuzmultfilm's first spoof. He selected the most stereotypical spy movie plots and characters, all well known to Soviet audiences. Soviet censors were so nervous about the film that they immediately sent it to the film club at Lubyanka (KGB Headquarters) to test the political waters. A high ranking general loved it -- and personally thanked Gamburg for &quot;destroying the established stereotype of the 'wooden' Soviet intelligence.&quot; Made during a period of Soviet world power, the film was never officially shown abroad until after perestroika.\n\nGlass Harmonica - Director: Andrei Khjanovsky (1968) http://www.imdb.com/title/tt0480465/\nThe state comes into confrontation with the artist, who gives new vision to the masses, and shows them a different horizon. &quot;Glass Harmonica&quot; was shelved by Soviet censors who -- not surprisingly -- found it ideologically disturbing. It was finally released after perestroika. &quot;Glass Harmonica&quot; was the first animated film scored by the late legendary Russian composer Alfred Schnittke, who was to collaborate with Khrjanovsky on more than half of his films. The animators Yulo-Ilmar Sooster and Yuri Nolyev-Sobolev, were among the most important artists of the Soviet underground. Before finding refuge at Soyuzmultfilm, they participated at the famous and controversial Manege (opposite the Kremlin) exhibit of underground art which was closed down by Khruschev and condemned by Soviet press.\n\nBall Of Yarn - Director: Nikolai Serebriakov (1968) http://www.imdb.com/title/tt0480418/\nA graduate of the Muhina School of Art (Leningrad), Serebriakov worked in theatre and cinema before joining Soyuzmultfilm. He bravely took the stop motion technique in new directions, using numerous textures and collages to give his films special artistic beauty. The poetic fairy tale &quot;Ball of Yarn&quot; explored deep philosophical ideas through unusual imagery.\n\nSinging Teacher - Director: Anatoly Petrov (1968)\nA mini-film which marked the directorial debut of the veteran artist and animator . Petrov used color pencil drawings to create the film's graphic look. This short film brought him great respect and recognition of Soviet audiences; they knew well about.\n\nFilm, Film, Film - Director: Fyodor Khitruk (1968) http://www.imdb.com/title/tt0212943/\nWon Wide acclaim at home and abroad and included a parody of Sergei Eisenstein's Ivan the Terible. Khirtruk was widely respected in the former USSR and used his celerity status to guide and protect tlented newcomers duringthe Soviet era - like Eisenstein, whom he once met. Filmmakers from all over the world can recognize their own problems in the 20 minute comic masterpiece.\n","torrent":{"xt":"urn:btih:87f8fa7ba85613a16831f1b5dd657ee421b99721","amp;dn":"Masters_of_Russian_Animation_Vol_1_MKO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87f8fa7ba85613a16831f1b5dd657ee421b99721","infoHashBuffer":{"type":"Buffer","data":[135,248,250,123,168,86,19,161,104,49,241,181,221,101,126,228,33,185,151,33]},"announce":[],"urlList":[]}}