{"title":"Understanding Oil and Gas Shows and Seals in the Search for Hydr","uid":14974323,"size":51998524,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b0fb4636cfe4243029c7423a3cb31cb1fe9e444&amp;dn=Understanding+Oil+and+Gas+Shows+and+Seals+in+the+Search+for+Hydr&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466223959,"description":"Understanding Oil and Gas Shows and Seals in the Search for Hydrocarbons - John Dolson (Springer, 2016).pdf\r\n\r\nISBN 978-3-319-29708-8\r\n\r\nThe book covers in detail the ways to understand how to use oil and gas show information to find hydrocarbons. It covers the basics of exploration methodologies, drilling and mud systems, cuttings and mud gas show evaluation, fundamental log analysis and pitfalls to log-calculated water saturations. A complete overview of the use of pressures to understand traps and migration, hydrodynamics, and seal and reservoir quantification using capillary pressure to underpin important fundamental concepts every petroleum geologist must know. Techniques for quickly generating pseudo-capillary pressure curves from simple porosity/permeability data, with examples of how to build the spreadsheets in Excel, provide quick and simple ways to determine where a test or sample may be in a trap based on its water saturation and rock properties. In addition, a complete treatment of fluid inclusion analysis and fluid inclusion stratigraphy to map migration pathways and recognize by-passed or near miss pay zones is covered and illustrated with numerous examples. Lastly, petroleum systems modeling and fundamental source rock geochemistry is discussed at depth, particularly in the context of unconventional source rock evaluation and screening tools for entering new plays. The promise, perils, and pitfalls of understanding and modeling migration in 3 dimensional space with modern software is examined with an eye toward how to visualize hydrocarbon shows as a means of validating or rejecting the model results.\r\nPerhaps more importantly, the book is heavily illustrated with numerous examples and case histories from the author’s 37 years of exploration experience. The topics covered in this book will give any young geoscientist a quick start on a successful career and serve as a refresher for the more experienced explorers","torrent":{"xt":"urn:btih:8b0fb4636cfe4243029c7423a3cb31cb1fe9e444","amp;dn":"Understanding+Oil+and+Gas+Shows+and+Seals+in+the+Search+for+Hydr","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b0fb4636cfe4243029c7423a3cb31cb1fe9e444","infoHashBuffer":{"type":"Buffer","data":[139,15,180,99,108,254,66,67,2,156,116,35,163,203,49,203,31,233,228,68]},"announce":[],"urlList":[]}}