{"title":"[MonkeyVision] KPT 5 plus 3","uid":4341364,"size":20948462,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8b85d603f65759c3a78716076329de16283b963c&amp;dn=%5BMonkeyVision%5D+KPT+5+plus+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"psiborg999","files":2,"time":1218620108,"description":"KPT 5 FULL   ( plus 3 )\n========================================\n\n\nKai&amp;#039;s Power Tools are a set of API plugins created by Kai Krause that were designed for use with Adobe Photoshop and Corel Photo-Paint. Kai&amp;#039;s Power Tools were sold to Corel when MetaCreations was closed.\n\nThe phrase Kai&amp;#039;s Power Tools is often abbreviated to KPT.\nThere are various versions of Kai&amp;#039;s Power Tools. KPT 3, 5, 6, and X sets are compilations of different filters. The program interface features a reward-based function in which a bonus function is revealed as the user moves towards more complex aspects of the tool.\n\n\nFilters\nThe KPT Convolver is a mathematics based filter; the level of precision and varying effects can be achieved by using numerical values of colour, tint, hue, saturation, contrast, brightness, luminosity, and posterize.\n\nThe KPT Projector takes the current image or selection and offers a number of interactive perspective warp effects. To a large extent, with its draggable distortion handles and its moving, scaling and rotating options, this simply duplicates Adobe Photoshop&amp;#039;s Free Transform capabilities. What is completely different is the ability to rotate the bitmap image in 3D space and to tile the results if desired. It can also animate the distortions by dragging keyframes from the preview window into an animation palette. KPT 6 will then preview the animation and output it to various sizes in avi or mov format. This animation capability is even more useful with the KPT Turbulence filter. This is another distortion filter, but one that treats the image as if it was completely liquid. The preview panel shows the animation in real time.\n\nThe KPT Goo filter is used to produce a single frame freeform liquid distortion. This filter is available both with KPT 6 and the standalone version. It works by effectively turning a bitmap image into a liquid that can be interactively smeared, smudged, twirled, and pinched with the range of tools on offer. The obvious use is to distort photographic portraits into caricatures.\n\nKPT Materializer can create advanced surface textures based on bump maps that define troughs and peaks. It can use any external image for the basis of the bump map or alternatively the user can pick out the hue, saturation, luminance or red, green, or blue channel of the current image. It can then offset, scale and rotate the texture map, control its lighting, and even blend in a reflection map. The filter can be used for anything from providing an oil-painting feel to an entire image, to giving the illusion of depth to a selection.\n\nAlso producing the impression of depth is the KPT Gel filter which uses various paint tools to synthesize photo-realistic 3D materials such as metals, liquids, or plastics. Gel painting is very different from traditional 2D painting as the brush strokes pool together when they touch and refract the underlying image. It can also manipulate 3D paint?once it has been added?by twirling, pinching, and carving it.\n\nThe opposite is true of the Equalizer filter, which is used for applying variations on sharpening effects. The filter has three modes. The first mode, Equalizer, looks and works rather like the graphic equalizer on a stereo system, enabling adjustment of the level of pixel contrast within nine bands of different visual frequencies. The second mode, Contrast Sharpen, allows for increasing the contrast between light and dark areas in an image. The third mode, Bounded Sharpen, can sharpen an image without causing oversharpening, which can lead to halo effects. This feature is particularly useful when pulling out the detail in an image softened by resizing.\n\nKPT SceneBuilder is used for producing photorealistic 3D scenes by importing and rendering 3DS files. The main image window offers three tabs for editing in 2D and 3D mode and for setting up the object&amp;#039;s final texture. Many users regard this filter as being the most impressive because it acts as a standalone 3D Rendering Tool and provides control over everything from transparency, reflection, refraction, bump mapping through to multiple light sources, and so on but without the ability to create or edit objects.\n\nThe final filter, KPT SkyEffects, also has its roots in Metacreations&amp;#039; experience with 3D programs such as Bryce and RayDream. This filter is designed to simulate the interaction between the light from the sun or moon with no less than six atmospheric layers of haze, fog and cloud. The filter is typical of the KPT 6 collection as a whole: at times the interface is inspired and offers the ability to create beautiful reddening sunsets simply by interactively dragging the sun toward the horizon, producing realistic sunsets and moonscapes.\n\nOther effects\nKai&amp;#039;s Power Tools 6 features a Lens Flare effect for precisely managing the type of glow, halo, streaks, and reflection. The large number of options in KPT 6 can make it overly complex to generate the desired effect. The addition of a library of preset effects helps to overcome this by allowing the user to choose a standard effect and then interactively position the flare in the image preview.\nKPT 6 provides a new engine in the form of The KPT Reaction, which takes a reaction seed and turns it into a seamlessly tiling pattern based on a reaction diffusion process. It offers random noise, regular dots or reticulated voronoi patterns or a bitmap image itself as the seed.\n\n\nCOOLNESS:  While installing, choose the &quot;CUSTOM&quot; option....  \n\n           you&amp;#039;ll get KPT 3 for FREE too!!\n\n\n\n\nDON&amp;#039;T BE SLOW, READ THE NFO!!!\n\n\n\nCollect &amp;#039;em all!!!\n\n-UncleMonkey777\n\n\n","torrent":{"xt":"urn:btih:8b85d603f65759c3a78716076329de16283b963c","amp;dn":"%5BMonkeyVision%5D+KPT+5+plus+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b85d603f65759c3a78716076329de16283b963c","infoHashBuffer":{"type":"Buffer","data":[139,133,214,3,246,87,89,195,167,135,22,7,99,41,222,22,40,59,150,60]},"announce":[],"urlList":[]}}