{"title":"George Michael - Songs from the Last Century - (1999)[EAC-MP3@32","uid":4214134,"size":105221288,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8c281a5cee0131a489bbeb8ee647e1ccca079f79&amp;dn=George+Michael+-+Songs+from+the+Last+Century+-+%281999%29%5BEAC-MP3%4032&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seanprince","files":20,"time":1212240064,"description":"George Michael - Songs from the Last Century - (1999)[EAC-MP3@320KBPS]\n\nTrack list\n\nGeorge Michael - Songs from the Last Century\n\n01.\tBrother Can You Spare a Dime\t\t04:22\n02.\tRoxanne\t\t\t\t\t04:11\n03.\tYou&amp;#039;ve Changed\t\t\t\t04:25\n04.\tMy Baby Just Cares for Me\t\t01:45\n05.\tThe First Time Ever I Saw Your Face\t05:19\n06.\tMiss Sarajevo\t\t\t\t05:11\n07.\tI Remember You\t\t\t\t04:12\n08.\tSecret Love\t\t\t\t02:39\n09.\tWild Is the Wind\t\t\t04:02\n10.\tWhere or When/It&amp;#039;s Alright with Me\t07:00\n\nFrom Wikipedia, \n\nSongs from the Last Century\n\nCover album by George Michael\nReleased \tDecember 13, 1999\nRecorded \t1999\nGenre \tJazz\nLength \t43:06\nLabel \tVirgin Records\nProducer George Michael Phil Ramone \n\n\n\nReview.\n\nSongs from the Last Century is an album of cover versions by singer George Michael and acclaimed producer Phil Ramone, released in December 1999). It consists mainly of old standards, plus new interpretations of more recent popular songs, such as &quot;Roxanne&quot; (originally by The Police) and &quot;Miss Sarajevo&quot; (originally by U2 with Luciano Pavarotti).\n\nHistory.\n\nThis album is the only in George Michael&amp;#039;s entire solo catalogue not to have reached #1 in the UK charts, peaking at #2 instead. Though, it was only kept out of the top spot by Shania Twain&amp;#039;s Come on Over, the best-selling album of the entire 1990s decade, with 22 million copies sold (the second best-selling album following along a 3-million difference, with 19,1 million copies sold, just to understand the business range of Twain&amp;#039;s album). Something similar had already happened when the artist was part of Wham!, in late 1984: then, Wham! and George, coming from three consecutive Number One hit singles, were stopped at Number 2 with their double-A-side single &quot;Last Christmas/Everything She Wants&quot;, which was only kept out of the top spot by Band Aid&amp;#039;s charity smash &quot;Do They Know It&amp;#039;s Christmas?&quot;, almost featuring the whole UK musical industry there, which made the young duo&amp;#039;s missed Christmas Number One seem less heavy to bear and easir to explain.\nThe cover album had a hit in Police&amp;#039;s &quot;Roxanne&quot;, for which George realized a live video, shot in Amsterdam, in the so-called Red District, using ordinary people, not actors, who really live their lives on the street. The main character, a prostitute (that&amp;#039;s what the song lyrics are all about), is said to have recently given up prostitution, so the song and the video wish to say a positive word about the possibility for people to change and move on with their lives. The cue of the song actually reads: &amp;#039;Roxanne, you don&amp;#039;t have to put on the red light&amp;#039;, highlighting the potential non-necessity for such a grievous and heavy situation - though it might seem quite simplistic to explain it over this way, and it probably is in fact, this girl actually made it.\nAnother version exists of the record opener, &quot;Brother Can You Spare a Dime?&quot;, sung by George with popular Italian tenor Luciano Pavarotti at one of his famous &quot;Pavarotti and Friends&quot; live shows, and then included on the 2006 single for &quot;An Easier Affair&quot;, the first song to be taken from Michael&amp;#039;s triple edition of his Twenty-five Greatest Hits album of the same year, which also contains the live performance in bonus CD3, &quot;For the Loyal&quot;\n\nEnjoy.","torrent":{"xt":"urn:btih:8c281a5cee0131a489bbeb8ee647e1ccca079f79","amp;dn":"George+Michael+-+Songs+from+the+Last+Century+-+%281999%29%5BEAC-MP3%4032","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c281a5cee0131a489bbeb8ee647e1ccca079f79","infoHashBuffer":{"type":"Buffer","data":[140,40,26,92,238,1,49,164,137,187,235,142,230,71,225,204,202,7,159,121]},"announce":[],"urlList":[]}}