{"title":"Stephen Frears - The Grifters (1990)","uid":6969460,"size":1583000594,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8c61e9a2f8ba3bad79746f40937ce8a836c0a5a0&amp;dn=Stephen+Frears+-+The+Grifters+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1327037946,"description":"Stephen Frears - The Grifters (1990)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0099703&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0099703&lt;/a&gt;\n\nCon men are more appealing than run-of-the-mill villains, who want to take your money because they are stronger or more dangerous than you are. Con men want to take it because they're smarter than you are. And there is hardly ever a con man who isn't likable, because, after all, if he can't win your confidence, how can he take your money? Movies about con men are seductive because the audience is on both sides of the moral issues: We want to see justice done, of course, but at the same time we're intrigued by the audacity of this character who is trying to out-think his opposition.\n\nYou can see some of that seductiveness at work in David Mamet's &quot;House of Games&quot; (1987), where a woman psychologist grows fascinated by a con man and asks him to teach her some of the tricks of his trade. Does he ever. The con man is sweet and almost gentle as he devastates his victim. In a sense, he really does like her. In Stephen Frears' &quot;The Grifters,&quot; there aren't any outsiders to be seduced, because the three central characters are all confidence tricksters. So they seduce each other.\n\nThe movie is based on a 1950s novel, but it's set in the present day. There are a few details that don't translate very well - today's con man probably wouldn't stay in a colorful fleabag hotel, but in a downtown executive suite - but the underlying story is universal. It involves the archetypal triangle of the lover, the loved one, and the authority figure who would separate them. The lover is Roy Dillon (John Cusack), a con man in his 20s, who isn't very good and pulls mostly small-time cons. The loved one is Myra Langtry (Annette Bening), who looks young and sexy but is probably older than she looks and certainly more dangerous than Roy realizes.\n\nAnd the authority figure is Roy's mother, Lily (Anjelica Huston), who has been pulling cons since a very early age and considers everyone a potential victim. That list would certainly include her son.\n\nMyra has knocked around the country a good deal, working as a sexy decoy for big-time con operators. Lily has an arrangement with a major sports gambling operation, and travels from one racetrack to another, placing large bets at the last minute to improve the odds.\n\nRoy isn't in their league. He's still pulling nickel-and-dime stuff like walking into a bar and getting change for a $20 and then switching to a smaller bill. One day a bartender catches him at it and beats him up so badly that he almost dies.\n\nIt's in his hospital room that the two women meet, and unsheathe their claws. Roy doesn't realize it, but he's doomed right from the moment of their meeting, because for each of these women it is more important to win than to love, and poor dumb, sentimental Roy doesn't play in that league. He loves too easily, perhaps, and the movie suggests Oedipal possibilities long before the shocking final confrontation.\n\n&quot;The Grifters&quot; is the first American production by Stephen Frears, one of the best new British directors. His credit list is short but distinguished: &quot;My Beautiful Launderette,&quot; &quot;Prick Up Your Ears,&quot; &quot;Sammy and Rosie Get Laid&quot; and &quot;Dangerous Liaisons.&quot; All four films deal with labyrinths of passion, with characters deceiving others about the true nature of their loves. The story of &quot;The Grifters&quot; comes from a pulp novel by the recently rediscovered Jim Thompson, a poet of film noir whose books exist in a world of cynicism and despair, where characters put up a big front but are being gnawed inside by fear, guilt and low self-esteem. The screenplay is by another distinguished crime novelist, Donald Westlake, and for once here is a new movie that exudes the film noir spirit from its very pores, instead of just adding a few cosmetic touches to a modern chase-and-crash story.\n\nThe performances are all insidiously powerful. Cusack provides a sympathetic center for the film, as a kid with a burning ambition to be good at the con game, but with no particular talent and without the ruthlessness he will need. Anjelica Huston is Academy Award material as his mother, who had this child when she was a teenager and who has never fully accepted the fact that he is her son. And Annette Bening has some of that same combination of sexiness, danger and vulnerability you could see in Gloria Grahame in movies such as &quot;The Big Heat&quot; and &quot;In a Lonely Place.&quot; One of the strengths of &quot;The Grifters&quot; is how everything adds up, and it all points toward the conclusion of the film, when all secrets will be revealed and all debts collected. This is a movie of plot, not episode. It's not just a series of things that happen to the characters, but a web, a maze of consequences; by the end, when Roy and his mother are facing each other in their last desperate confrontation, the full horror of their lives is laid bare.\n\nWhy do confidence operators do what they do? Why do they need to win our love and trust, and then betray us? In &quot;The Grifters,&quot; it's pretty clear that they're locked into an old pattern of trust and betrayal that goes back to childhood, and that they're trying to get even. Poor Roy. He thinks he wants to be a great con man, and all he really wants is to find just one person he can safely love, one person who isn't trying to con him.\n\nBY ROGER EBERT /  January 25, 1991\n &lt;a href=&quot;\nhttp://img13.imageshack.us/img13/6537/21137908.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img13.imageshack.us/img13/6537/21137908.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img24.imageshack.us/img24/8427/65779146.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img24.imageshack.us/img24/8427/65779146.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img88.imageshack.us/img88/8349/75761400.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img88.imageshack.us/img88/8349/75761400.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img23.imageshack.us/img23/6584/57437281.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img23.imageshack.us/img23/6584/57437281.png&lt;/a&gt;\n\n-------------not my rip---------------\n\nFile Size (in bytes) ............................: 1,572,036,608 bytes\nRuntime ............................................: 1:46:19\n\nVideo Codec ...................................: XviD 1.1.2 Final\nFrame Size ......................................: 688x368 (AR: 1.870)\nFPS .................................................: 25.000\nVideo Bitrate ...................................: 1425 kb/s\nBits per Pixel ...................................: 0.225 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x2000 (Dolby AC3) AC3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 448 kb/s [6 channel(s)] CBR\nNo. of audio streams .......................: 2 [Commentary Track by Stephen Frears and cast]\n\n*************************\n\n    Freakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\n    The Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\n    If you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; https://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.org/index.php&lt;/a&gt;\n\n    \\'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE        \n","torrent":{"xt":"urn:btih:8c61e9a2f8ba3bad79746f40937ce8a836c0a5a0","amp;dn":"Stephen+Frears+-+The+Grifters+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c61e9a2f8ba3bad79746f40937ce8a836c0a5a0","infoHashBuffer":{"type":"Buffer","data":[140,97,233,162,248,186,59,173,121,116,111,64,147,124,232,168,54,192,165,160]},"announce":[],"urlList":[]}}