{"title":"PAYDAY 2 ALL UPDATES 1-16 + HOTFIXES + MP FIX V9","uid":9153136,"size":3226809254,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8d911c0b8d785f0f7f56a70355016763cd3f734d&amp;dn=PAYDAY+2+ALL+UPDATES+1-16+%2B+HOTFIXES+%2B+MP+FIX+V9+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lotus709","files":-1,"time":1383733181,"description":"THIS TORRENT INCLUDES ALL UPDATES FROM 1-16 BUT DOES NOT INCLUDE PAYDAY 2-FLT. You need to download the PAYDAY 2-FLT version (GAME FILES) separately before this torrent will be usable (You will probably need HJ Split for combining the PAYDAY 2-FLT files into a single file when you download that torrent just FYI)\n\nI have painstakingly found all the individual Payday 2 updates up to Update 16, the hotfixes, and a crash-fix (it solves some of my problems) and combined them into a RAR file. You will have to extract them individually and install them 1 by 1. The hotfixes should be installed after the main update, example: \n\n   Install Update 13, then apply Update 13 hotfix \n\n\nBEWARE: I found that when downloading the individual updates from share sites that you sometimes end up downloading something that seems like a PAYDAY 2 update, but only puts spyware and junkware on your system during installation. This torrent includes NONE of the fake updates and is 100% spyware/ junkware /virus free.\n\n\nI have also included the MP Fix V9 (latest) and some additional LUA script hacks which you can drop in the PAYDAY 2 folder and then activate when in game by pressing the INSERT key (you can find many more scripts on youtube). After pressing insert you simply complete the mission, and then the hack (money, level, weapons, etc) will be activated.\n\nYou may also need to add the contents of the CRACK folder in the last UPDATE 16 rar before applying the MP FIX V9. I don't think you need it, but I can't be positive so please leave a comment for others if you find the answer. \n\n\nCheers, and happy heisting!","torrent":{"xt":"urn:btih:8d911c0b8d785f0f7f56a70355016763cd3f734d","amp;dn":"PAYDAY+2+ALL+UPDATES+1-16+%2B+HOTFIXES+%2B+MP+FIX+V9+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d911c0b8d785f0f7f56a70355016763cd3f734d","infoHashBuffer":{"type":"Buffer","data":[141,145,28,11,141,120,95,15,127,86,167,3,85,1,103,99,205,63,115,77]},"announce":[],"urlList":[]}}