{"title":"Gateway Worship - The First 10 Years (Flac)","uid":8607342,"size":537860790,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8e1878e150ebd88c7d738eca992c4423342e1b51&amp;dn=Gateway+Worship+-+The+First+10+Years+%28Flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1372048303,"description":"In just over 10 years of existence as a Church and since launching their first international worship release in 2006, Gateway Church and its worship ministry has grown to be one of the most influential in the world. They have dozens of songs among the top Christian rankings and their song &quot;Revelation Song&quot; has become one of the most beloved worship songs in churches everywhere. With worship leaders and songwriters like Thomas Miller, Kari Jobe, Walker Beach, David Moore, Zach Neese, Klaus Keuhn and more, Gateway represents many powerful gifted voices joining together to equip the Church with songs of worship. The First 10 Years brings together the best and most popular songs from their first three releases: Living For You, Wake Up the World and God Be Praised. \n\n\nGateway Worship is one of Contemporary Worship music's most successful stories to date. As the worship team of Gateway Church in Southlake, Texas, the church had grown from a mere 200 members in the beginnings of 2000s to a current toll of 24,000 worshippers. Ranked as America's 13th largest church, one of the reasons for such exponential growth is because of the vision of worship pastor Thomas Miller. Miller is not satisfied with just being a Christian karaoke singer each Sunday. Rather, he is committed to fearlessly take the Gospel through music to the masses. Adopting a similar template as Hillsong Live, Desperation Band and Planetshakers, Thomas wanted their music to have the striking majesty of the big stadium sound yet tender enough to communicate the grace of Christ in ways that rattle and shatter hearts. Within the last 10 years, they have functionally stocked up the churches' worship resource with worship favorites such as &quot;The Lord Reigns,&quot; &quot;Revelation Song&quot; and &quot;Stay Amazed.&quot; To celebrate this first decade, Integrity Music has released &quot;The First Ten Years.&quot;\n\nThe titular &quot;The First Ten Years&quot; is misleading. Though Gateway Worship has released five live albums in the last ten years, all the songs here are only culled only from their first three live albums. Five tunes are abstracted from 2006's &quot;Living for You&quot; and 2008's &quot;Wake Up the World&quot; each. While 2010's 'God Be Praised&quot; is represented by four tracks. This means that there are no new or never released songs. And there is a dire dearth of songs from 2011's &quot;Great, Great God&quot; and 2012's &quot;Forever Yours.&quot; In short, for a magnanimous decade encompassing album title, the song list leaves a lot to be desired. With that said, the fourteen songs here showcase most of their worship staff including Kari Jobe, David Moore, Walker Beach, Rebecca Pfortmiller and Zach Neese.\n\nThroughout these years, Gateway Worship has adopted the same template of Scripturally-provocative lyrics with congregationally centred melodies. Never merely veneer deep, Gateway Worship dives in towards the deepest end of Scripture to present God in his most glorious array. Take their most well-known song &quot;Revelation Song&quot; as an example. This is not just your average praise ballad of &quot;Lord I worship you&quot; calibre. Rather, taking some of the most majestic passages of Scripture (namely, Isaiah 6 and Revelation 4 and 5), the ineffable glory of God is presented in heartfelt poetic platitudes. Not only is Gateway Worship committed to Scripturally-imbed well-crafted lyrics, but their songs are poignantly congregational. For an entire congregation to catch on to a song, the song needs to possess an indelible melody with steadfast hooks. Take a listen to the breezy pop &quot;No Sweeter Name&quot; or the tender piano ballad &quot;The More I Seek You&quot; or the propulsive &quot;The Lord Reigns&quot; or the crescendo building &quot;Stay Amazed&quot; and you will find yourself hooked to them singing to them in no time.\n\nWay before Hillsong or Chris Tomlin was trying to re-vamp the old hymns of the church by augmenting new choruses or verses to them, Gateway Worship had already been doing that. Rather than divorcing themselves from the traditional hymns, Gateway Worship has embraced them giving them new lease of life with &quot;Come Thou Fount, Come Thou King&quot; and &quot;New Doxology.&quot; And like the Gettys, they have also written new hymn-like worship tunes such as &quot;O the Blood&quot; and &quot;Alabaster Jar.&quot; With such shafts of well thought out lyrics, they have added depth to the worship of God's church. Such a holy contribution is indispensable. And we are thankful to Integrity Music for &quot;The First 10 Years&quot; which wonderfully captures some of these highlights for us. \n\nIf you like the music, buy the album:  &lt;a href=&quot;\nhttp://store.gatewaypeople.com/home.php?cat=284&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.gatewaypeople.com/home.php?cat=284&lt;/a&gt;","torrent":{"xt":"urn:btih:8e1878e150ebd88c7d738eca992c4423342e1b51","amp;dn":"Gateway+Worship+-+The+First+10+Years+%28Flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e1878e150ebd88c7d738eca992c4423342e1b51","infoHashBuffer":{"type":"Buffer","data":[142,24,120,225,80,235,216,140,125,115,142,202,153,44,68,35,52,46,27,81]},"announce":[],"urlList":[]}}