{"title":"Un Chien Andalou (1929) [DVDrip Divx] TNT Village","uid":12675185,"size":111610532,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8e3dbbf2e0a913bee2ffc672967d8b07b97148cb&amp;dn=Un+Chien+Andalou+%281929%29+%5BDVDrip+Divx%5D+TNT+Village+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":1,"time":1446498368,"description":"Un Chien Andalou (1929) [DVDrip Divx] TNT Village \r\n\r\n.: Release Originale :.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=92840\r\n\r\n.: Trama :.\r\n\r\nUn chien andalou è un cortometraggio scritto, prodotto, diretto e interpretato da Luis Buñuel e Salvador Dalí nel 1929, considerato il film più significativo del breve periodo del cinema surrealista.\r\n\r\nProdotto in Francia nel 1928, ha le sue radici nel movimento cinematografico francese dell'avant-garde dell'epoca, e si pone al contempo come critica verso lo stesso movimento.\r\n\r\nIl film ha l'obiettivo di provocare un impatto morale sullo spettatore attraverso l'aggressività delle immagini, offensive per l'epoca. Si tratta di una successione di scene apparentemente senza connessione tra di loro, è come se ci si trovasse in un lungo sogno, un delirio onirico. Il film trasgredisce gli schemi narrativi canonici e rompe la tradizione dell'avant-garde focalizzandosi sul contenuto quanto sulla forma cinematografica: inquadrature sorprendenti e trucchi da film.\r\n\r\nNella scena di apertura l'occhio di una donna viene tagliato con un rasoio, e continua con una serie di scene surreali: una donna spinge una mano amputata nella strada con un bastone; un uomo trascina due grandi pianoforti contenenti due asini morti e putrefatti, le tavole dei Dieci Comandamenti e due preti vivi (Dalí interpreta uno dei preti in questa scena); la mano di un uomo ha un buco nel palmo da cui fuoriescono formiche; i peli dell'ascella di una donna si attaccano da soli alla faccia di un uomo.\r\n\r\nLa cronologia del film è disgiunta, salta da c'era una volta fino a otto anni dopo, ecc. Gli stessi due personaggi, un uomo non identificato e una donna, appaiono dall'inizio alla fine.\r\n\r\nI critici hanno suggerto che Un chien andalou può essere compreso come un tipico pezzo Buñueliano antiborghese e anticlericale. L'uomo che trascina il piano, le scimmie e i preti è stato interpretato come un'allegoria del progresso dell'uomo verso il suo obiettivo che viene ostacolato dal peso delle convenzioni della società che è costretto a sopportare.\r\n\r\nL'immagine dell'occhio che viene tagliato da un rasoio può essere recepito come Buñuel che attacca gli spettatori del film (Buñuel stesso interpreta l'uomo che maneggia il rasoio; l'occhio in realtà è quello di un vitello morto).\r\n\r\nNel 1960, sotto la direzione di Buñuel, è stata aggiunta una colonna sonora al film. Buñuel ha usato la stessa musica che eseguì (usando registrazioni fonografiche) alla proiezione del 1929: estratti da Liebestod, Tristan und Isolde di Richard Wagner e due tango argentini.\r\n\r\nDurante il suo tour del 1976, la rock star e icona David Bowie usò questo film come atto di apertura. Viene anche abbondantemente riferito nella canzone Debaser dei Pixies.\r\n\r\nIl video musicale Heaven Sent degli Esthero prende molto dal simbolismo visuale di questo film.\r\n\r\n\r\n.: Locandina :.\r\n\r\n\r\n.: Crediti :.\r\n\r\nGenere: Short / Fantasy\r\nRegia: Luis Buñuel\r\nSceneggiatura: Salvador Dalí Luis Buñuel\r\nFotografia: Albert Duverger Jimmy Berliet\r\nProduzione: Luis Buñuel\r\nColonna Sonora: Richard Wagner\r\nMontaggio: Luis Buñuel\r\n\r\nCast: Simone Mareuil\r\nPierre Batcheff\r\nLuis Buñuel Salvador\r\nDalí Robert\r\nHommet Marval\r\nFano Messan\r\nJaime Miravilles \r\n\r\n========================================\r\n\r\n.: Dati tecnici del file :.\r\n\r\nDimensione:106 MB (or 108,994 KB or 111,610,532 bytes)\r\nDurata:00:16:00 (28,759 fr)\r\n\r\nVideo Codec:DX50/divx\r\nVideo Bitrate:859 kb/s\r\nRisoluzione:448x334 (1.34:1) [~39:29]\r\nFPS (Frames/sec):29.971\r\nQF (Frame quality):0.191 bits/pixel\r\n\r\nAudio Codec:0x0055(MP3) ID'd as MPEG-1 Layer 3\r\nAudio Bitrate:64 kb/s, monophonic CBR\r\nFreq Audio:48000 Hz","torrent":{"xt":"urn:btih:8e3dbbf2e0a913bee2ffc672967d8b07b97148cb","amp;dn":"Un+Chien+Andalou+%281929%29+%5BDVDrip+Divx%5D+TNT+Village+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e3dbbf2e0a913bee2ffc672967d8b07b97148cb","infoHashBuffer":{"type":"Buffer","data":[142,61,187,242,224,169,19,190,226,255,198,114,150,125,139,7,185,113,72,203]},"announce":[],"urlList":[]}}