{"title":"Doctor Who Confidential - 2008 - Season 04 - 13 Episodes + 1 Spe","uid":10752881,"size":5031684711,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8f2d94f62063fc49c3a280ca8a4dc5ddc97d590b&amp;dn=Doctor+Who+Confidential+-+2008+-+Season+04+-+13+Episodes+%2B+1+Spe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"bnaron","files":-1,"time":1407896050,"description":"Doctor Who Confidential - Season 04 (2008) - 13 Episodes + 1 Special\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&lt;/a&gt;\n\n\nDoctor Who Confidential is a documentary series created by the British Broadcasting Corporation (BBC) to complement the revival of the long-running British science fiction television series Doctor Who. Each episode was broadcast on BBC Three on Saturdays, immediately after the broadcast of the weekly television episode on BBC One. The running time of the first two series was 30 minutes, being extended to 45 minutes in the third.[1] BBC Three also broadcast a cut-down edition of the programme, lasting 15 minutes, shown after the repeats on Sundays and Fridays and after the weekday evening repeats of earlier seasons.\n\nDescribed as focusing on the human element of the series, Confidential features behind-the-scenes footage on the making of Doctor Who through clips and interviews with the cast, production crew and other people, including those who have participated in the television series over the years of its existence. Each episode deals with a different topic, and in most cases refers to the Doctor Who episode that preceded it.\n\nAnthony Head (who played Mr Finch/Brother Lassar in &quot;School Reunion&quot;) replaced Gatiss as narrator for season 3, while David Tennant did the entirety of the series' tenth episode himself. The episode running length was increased to 45 minutes.\n\n\nSeason 04 (2008)\n\n\nEpisode Synopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com&lt;/a&gt;\n\n\n2008-04-05 - A Noble Return (Video:H264 640x368, 990kbps, 25fps - Audio:AAC 44.1kHz, 113kbps)\n\nIn the first of a new series, Confidential features the welcome return of Catherine Tate as the unstoppable Donna Noble and gets up close and personal with the Doctor's latest companion - from her first days on set through to her battle against an army of sinister Adipose.\n\n\n2008-04-12 - The Italian Job (Video:H264 640x368, 991kbps, 25fps - Audio:AAC 44.1kHz, 114kbps)\n\nDoctor Who Confidential travels the long road to Rome to witness the making of The Doctor's latest volcanic voyage. Filming at the famous Cinecitta Studios, the production team face an Italian job of colossal proportions and Confidential is on set to feel the heat. Plus David Tennant heads up Pompeii and climbs Mount Vesuvius in this latest Doctor Who Confidential exclusive.\n\n\n2008-04-19 - Oods and Ends (Video:H264 640x368, 991kbps, 25fps - Audio:AAC 44.1kHz, 115kbps)\n\nThe Confidential crew travel to the Ood Sphere to examine the return of the mysterious Ood to Doctor Who. They discover how a quarry in South West Wales in the middle of summer gets turned into a winter wonderland, and how David Tennant gets turned into an all action hero.\n\n\n2008-04-26 - Send in the Clones (Video:H264 640x368, 991kbps, 25fps - Audio:AAC 44.1kHz, 116kbps)\n\nJoin Confidential, as we take you exclusively behind-the-scenes as Martha greets the Doctor again and meets his latest companion, Donna Noble. As confusion abounds, The Time Lord, Donna and Martha join forces in a battle to save the human race.\n\n\n2008-05-03 - Sontar-Ha! (Video:H264 640x368, 990kbps, 25fps - Audio:AAC 44.1kHz, 113kbps)\n\nFor the first time in over 20 years, the Sontarans are back as Confidential explores the return of the ultimate warrior race. We speak to David Tennant and Colin Baker and go behind the scenes to look at the explosive Sontaran Invasion against U.N.I.T. forces.\n\n\n2008-05-10 - Sins of the Fathers (Video:H264 640x368, 991kbps, 25fps - Audio:AAC 44.1kHz, 113kbps)\n\nConfidential opens a new chapter in history as the Doctor's daughter makes an appearance; plus a look at the Doctor's generation time line, and why two Doctors can be better than one. Featuring exclusive backstage footage and interviews from Doctors old and new.\nIncludes interviews with David Tennant, Peter Davison, Georgia Moffett and Russell T Davies.\n\n\n2008-05-17 - Nemesis (Video:H264 624x368, 989kbps, 25fps - Audio:AAC 44.1kHz, 117kbps)\n\nAired alongside 'The Unicorn and the Wasp'\n\nJoin Confidential, become an armchair detective and find out exactly what goes into creating a classic murder mystery. Find out what it's like behind-the-scenes with such a big ensemble cast and discover the mysterious events surrounding the real Agatha Christie.\n\n\n2008-05-31 - Shadow Play (Video:H264 640x368, 990kbps, 25fps - Audio:AAC 44.1kHz, 119kbps)\n\nVisit The Doctor and Donna on the set of the eerie Library Planet, as they confront the monsters of the Dark, the vicious Vashta Nerada. We examine the shadowy creatures that even the Doctor is terrified of, how they are created, and how a disused library in Swansea became the setting for all the universe's books, and look at the contribution of writer Steven Moffat to the new Doctor Who. Featuring interviews with David Tennant, Catherine Tate, Russell T Davies and Steven Moffat.\n\n\n2008-06-07 - River Runs Deep (Video:H264 640x368, 989kbps, 25fps - Audio:AAC 44.1kHz, 114kbps)\n\nFresh from Stateside success and back in the UK to film her part in Doctor Who, Confidential talks to Alex Kingston and discovers more about her time travelling archaeologist River Song.\n\n\n2008-06-14 - Look Who's Talking (Video:H264 640x368, 989kbps, 25fps - Audio:AAC 44.1kHz, 115kbps)\n\nDoctor Who Confidential takes you behind the scenes of one the creepiest episodes of the series yet! As well as exclusive backstage footage, the show also reveals how the sound team put together the complicated soundscape of the hit show.\n\n\n2008-06-21 - Here Come the Girls (Video:H264 640x368, 990kbps, 25fps - Audio:AAC 44.1kHz, 114kbps)\n\nBehind-the-scenes look at the making of Doctor Who. The world is in crisis and there's only one person who can save it, but it's not who you might think. Witness the world without the Doctor, travels backstage with the TARDIS, and takes a stroll down the exotic Shan Shen Alley. There is also the return of an old friend to the show in the shape of Rose Tyler. Featuring an exclusive interview with Billie Piper and contributions from Catherine Tate, David Tennant and Russell T Davies.\n\n\n2008-06-28 - Friends and Foe (Video:H264 640x368, 990kbps, 25fps - Audio:AAC 44.1kHz, 112kbps)\n\nA look at the history of TV's most popular alien monsters, the Daleks, from their creation 45 years ago to their latest incarnation. Plus, interviews with the show's biggest-ever collection of companions, and exclusive interviews with David Tennant, Russell T Davies, director Graeme Harper, art director Ed Thomas, and original Dalek designer Ray Cusick.\n\n\n2008-07-05 - The End of an Era (Video:H264 640x368, 989kbps, 25fps - Audio:AAC 44.1kHz, 114kbps)\n\nIt's the end of series four and Confidential goes behind the scenes as we see the Doctor's Arch Enemy bring the universe to the brink of extinction. Featuring interviews with David Tennant, Billie Piper, Catherine Tate, Freema Agyeman, Russell T Davies, Julie Gardner and Phil Collinson.\n\n\nSeason 4 (2008) - Specials\n\n\n2008-01-16 - Mark Lawson Talks to Russell T. Davies (Video:H264 480x270, 760kbps, 25fps - Audio:AAC 44.1kHz, 96kbps)\n\nTalk show host, Mark Lawson, interviews Russell T. Davies.\n\n\n","torrent":{"xt":"urn:btih:8f2d94f62063fc49c3a280ca8a4dc5ddc97d590b","amp;dn":"Doctor+Who+Confidential+-+2008+-+Season+04+-+13+Episodes+%2B+1+Spe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f2d94f62063fc49c3a280ca8a4dc5ddc97d590b","infoHashBuffer":{"type":"Buffer","data":[143,45,148,246,32,99,252,73,195,162,128,202,138,77,197,221,201,125,89,11]},"announce":[],"urlList":[]}}