{"title":"Sapphire Thinkers...From Within(1969)[FLAC]","uid":6831222,"size":200378712,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8f94ea51670da106a18424428da5cb7819c5923d&amp;dn=Sapphire+Thinkers...From+Within%281969%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":17,"time":1321880803,"description":"1\t Melancholy Baby\t\n2\t I Feel a Bit Strange\t\n3\t Get Along Boy\t\n4\t Blues On You\t\n5\t From Within\t\n6\t I Got To You\t\n7\t Not Another Night\t\n8\t Let Her Come In\t\n9\t Please Understand\t\n10\t Blind With a Borrowed Light\t\n11\t There's a Woman\t\n12\t Doin' Alright\n\nExcellent 1968 Californian band who with their mix of male and female vocalists and fuzz lead guitar bear comparisons with Yankee Dollar or Peanut Butter Conspiracy. If anything this band is better than those acts and their album features some excellent harmonies and nice trippy touches - in particular the Doors like keyboards and backward effects.\nOther than Vernon Joynson's entry in Fuzz, Acid and Flowers and his very similar summary of the album in &quot;Flashback&quot;, used in the sleeve notes for the CD re-issue, there is very little information on this excellent band and their work. Joynson's summary from the sleeve notes was as follows &quot;...similar to Jefferson Airplane and Peanut Butter Conspiracy...based in LA, they were probably Californian. The album contains some pleasant vocal arrangements/harmonies and nice touches of acid and fuzz guitar and is recommended&quot;. I couldn't agree more. If it's light and breezy West Coast psych inflected pop you're looking for, then this band make all the right moves. In addition to melodies and male/female vocal harmonies to rival The Mamas &amp; The Papas, and a groovieness in the vein of Ultimate Spinach, there's a few more things that really stand out on the album for me. These are the technically brilliant snappy \nkeyboard backing on most tracks, the stunning lead guitar breaks \nthat really lift several of the tracks, and the sprinkling of flute over the album. The standout tracks are the title track &quot;From Within&quot; and the amazing &quot;I Got To You&quot; which is contains the best harmony work on the album and some beautifully introspective guitar pieces. Yet another talented bunch of musicians that never received the attention they deserved.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:8f94ea51670da106a18424428da5cb7819c5923d","amp;dn":"Sapphire+Thinkers...From+Within%281969%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f94ea51670da106a18424428da5cb7819c5923d","infoHashBuffer":{"type":"Buffer","data":[143,148,234,81,103,13,161,6,161,132,36,66,141,165,203,120,25,197,146,61]},"announce":[],"urlList":[]}}