{"title":"Pro Evolution Soccer 2011 [PC-DVD][Multi3][Spanish][www.consolas","uid":5857648,"size":7168177849,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9108380650f3476eef760c5353f5a8788bf231ba&amp;dn=Pro+Evolution+Soccer+2011+%5BPC-DVD%5D%5BMulti3%5D%5BSpanish%5D%5Bwww.consolas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"consolasatope","files":5,"time":1285865348,"description":"DescripciÃƒÂ³n:\nGÃƒÂ©nero: Deportes\nIdiomas: Multi3 Italiano,Portugues y por supuesto Audio y Textos en EspaÃƒÂ±ol\n\nResumen:\nLo primero que llama la atenciÃƒÂ³n en los minutos iniciales con Pro Evolution Soccer 2011 es el completo rediseÃƒÂ±o de menÃƒÂºs e interfaz. Resultan mucho mÃƒÂ¡s sencillos e intuitivos, cargan de manera casi instantÃƒÂ¡nea y los partidos rÃƒÂ¡pidos se lanzan con apenas tres pulsaciones. AdemÃƒÂ¡s, las opciones avanzadas de tÃƒÂ¡ctica y estrategia se pueden manejar fÃƒÂ¡cilmente con el pad, gracias a un diseÃƒÂ±o excelente de los menÃƒÂºs. Interesante evoluciÃƒÂ³n respecto a su predecesor.\n\nEn cuanto el balÃƒÂ³n se pone en juego notamos los nuevos ÃƒÂ¡ngulos de cÃƒÂ¡mara, que ahora es dinÃƒÂ¡mica y mantiene siempre la mejor perspectiva en funciÃƒÂ³n de la posiciÃƒÂ³n del balÃƒÂ³n. AsÃƒÂ­, si nos internamos por la banda el ÃƒÂ¡ngulo se hace mÃƒÂ¡s abierto para que tengamos mayor visiÃƒÂ³n de campo o al entrar al ÃƒÂ¡rea un sutil zoom nos permitirÃƒÂ¡ decidir con precisiÃƒÂ³n hacia donde queremos disparar. Por supuesto se mantienen las opciones clÃƒÂ¡sicas de cÃƒÂ¡mara para los veteranos, pero merece la pena probar esta novedad por el plus de espectacularidad que aporta.\n\n\n\nEl modelado de los jugadores se ha mejorado, y las grandes figuras de los equipos mÃƒÂ¡s conocidos se pueden diferenciar con facilidad. Lo mismo podemos decir de las texturas, estadios, equipaciones (sobretodo las licenciadas) o pÃƒÂºblico. La sensaciÃƒÂ³n general es que todo estÃƒÂ¡ mÃƒÂ¡s animado que en anteriores versiones del tÃƒÂ­tulo, y aunque no dejan de ser detalles menores ayuda a que la experiencia sea lo mÃƒÂ¡s realista posible\n\nEn el apartado jugable las dos grandes novedades son un &quot;control 360Ã‚Âº&quot; mejorado y una barra de potencia para los pases y tiros. Aunque nos costarÃƒÂ¡ unos cuantos partidos acostumbrarnos el nuevo sistema premia al jugador que le dedica horas al juego, frente a aquellos que abusan del &quot;tiki-taka&quot; y las acciones individuales. Lo mismo podemos decir de los tiros, los usuarios que dediquen tiempo a practicar conseguirÃƒÂ¡n espectaculares tiros a media distancia, grandes goles de falta directa y gran efectividad en el uno contra uno, imprescindible si queremos tener ÃƒÂ©xito en el online.\n\nOtro aspecto donde las mejoras se notan al instante es en los partidos contra la mÃƒÂ¡quina. La IA rival ahora es mÃƒÂ¡s dÃƒÂ­ficil de superar con pases al hueco, presiona en casi todos los sectores del campo, se dan relevos defensivos, etc. especialmente en los niveles de dificultad mÃƒÂ¡s altos. Una lÃƒÂ¡stima que estos cambios no se noten tanto en nuestro propio equipo, donde los fallos defensivos inexplicables se producen con demasiada frecuencia.\n\nTambiÃƒÂ©n es necesario comentar el nuevo sistema de regates, que usa combinaciones de dos botones y el stick derecho (podemos personalizarlas) para realizar con sencillez movimientos espectaculares. Ã‚Â¿Lo malo? nos tememos que el abuso de estas argucias en el modo online puede hacer de los partidos una aburrida sucesiÃƒÂ³n de filigranas.\n\nRequisitos minimos:\n\nSistema Operativo: Windows XP (SP3),Vista (SP1),7\nProcesador: Intel Pentium IV 2.4GHz o procesador equivalente\nMemoria: 1 GB RAM\nT. Grafica: NVIDIA GeForce 6600 o AMD/ATI Radeon x1300\nT. Sonido: Compatible con DirectX 9.0c\nDirectX: 9.0c\n\nRecomendados:\n\nProcesador: ntel Core2 Duo 2.0GHz\nMemoria: 2 GB RAM\nT. Grafica: NVIDIA GeForce 7900, AMD/ATI Radeon HD2400 ","torrent":{"xt":"urn:btih:9108380650f3476eef760c5353f5a8788bf231ba","amp;dn":"Pro+Evolution+Soccer+2011+%5BPC-DVD%5D%5BMulti3%5D%5BSpanish%5D%5Bwww.consolas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9108380650f3476eef760c5353f5a8788bf231ba","infoHashBuffer":{"type":"Buffer","data":[145,8,56,6,80,243,71,110,239,118,12,83,83,245,168,120,139,242,49,186]},"announce":[],"urlList":[]}}