{"title":"VA albedo (ultimae records)","uid":4740467,"size":115091214,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:92b446185f84f662aa040547f75b3500600b8bd7&amp;dn=VA+albedo+%28ultimae+records%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"QueenSerene","files":12,"time":1235521880,"description":"Ultimae records\n\n[ Ambient refractions and kaleidoscopic grooves mixed by Nova ]\n\nAlbedo is a concept compilation where all tracks contribute to a single unified story. \nOn his first official mix release on Ultimae Records, Nova has selected a kaleidoscopic array of new panoramic tunes with a strong cinematic feeling and a common fil rouge that tells a story of light beams falling on Earth, reaching different corners of the planet, from natural lonely environments of forests, empty shores and arctic landscapes to more busy urban cyberspaces ending in an ethereal, tribal yet meditative sunset.Included in the compilation are established in-house artists such as Aes Dana, Solar Fields, Carbon Based Lifeforms, Hol Baumann and Sync24 alongside other well known and respected projects within the international ambient music realms : Ishq, Ochi Brothers, Ephemeral Mists and Antonio Testa. \nAlso included is a very interesting newcomer, Between Interval and a track by Nova himself with the artistic supervision of label manager and producer Vincent Villuis (Aes Dana)These new ambient refractions are mastered by Huby Sea and wrapped in a 3 parts digipack CD including a 16 pages booklet.\n\nThe Sun goes up, the Sun goes down... ","torrent":{"xt":"urn:btih:92b446185f84f662aa040547f75b3500600b8bd7","amp;dn":"VA+albedo+%28ultimae+records%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b446185f84f662aa040547f75b3500600b8bd7","infoHashBuffer":{"type":"Buffer","data":[146,180,70,24,95,132,246,98,170,4,5,71,247,91,53,0,96,11,139,215]},"announce":[],"urlList":[]}}