{"title":"Bruce Springsteen 24 Bit Vinyl Pack","uid":8705655,"size":6095466947,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:931ab6d0ed089d8074813925b93a496e2e9d4ebc&amp;dn=Bruce+Springsteen+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"politux","files":-1,"time":1374146489,"description":"\n  Bruce Springsteen 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Album Rock, Heartland Rock, Alternative Folk\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz, 192,000 Hz\n\n  Born in the USA (192,000 Hz)\n  Born to Run\n  Darkness on the Edge of Town\n  Nebraska (Columbia)\n  Tunnel of Love (192,000 Hz)\n\n  In the decades following his emergence on the national scene in 1975, Bruce Springsteen proved to be that rarity among popular musicians, an artist who maintained his status as a frontline recording and performing star, consistently selling millions of albums and selling out arenas and stadiums around the world year after year, as well as retaining widespread critical approbation, with ecstatic reviews greeting those discs and shows. Although there were a few speed bumps along the way in Springsteen's career, the wonder of his nearly unbroken string of critical and commercial success is that he achieved it while periodically challenging his listeners by going off in unexpected directions, following his muse even when that meant altering the sound of his music or the composition of his backup band, or making his lyrical message overtly political. Of course, it may have been these very sidesteps that kept his image and his music fresh, especially since he always had the fallback of returning to what his fans thought he did best, barnstorming the country with a marathon rock &amp; roll show using his longtime bandmates.\n\n  Bruce Springsteen was born September 23, 1949, in Freehold, New Jersey, the son of Douglas Springsteen, a bus driver, and Adele (Zirilli) Springsteen, a secretary. He became interested in music after seeing Elvis Presley perform on The Ed Sullivan Show in 1956 and obtained a guitar, but he didn't start playing seriously until 1963. In 1965, he joined his first band, the Beatles-influenced Castiles. They got as far as playing in New York City, but broke up in 1967 around the time Springsteen graduated from high school and began frequenting clubs in Asbury Park, New Jersey. From there, he briefly joined Earth, a hard rock band in the style of Cream. Also in the hard rock vein was his next group, Child (soon renamed Steel Mill), which featured keyboard player Danny Federici and drummer Vini Lopez. (Later on, guitarist Steve Van Zandt joined on bass.) Steel Mill played in California in 1969, drawing a rave review in San Francisco and even a contract offer from a record label. But they broke up in 1971, and Springsteen formed a big band, the short-lived Dr. Zoom &amp; the Cosmic Boom, quickly superseded by the Bruce Springsteen Band. Along with Federici, Lopez, and Van Zandt (who switched back to guitar), this group also included pianist David Sancious and bassist Garry Tallent, plus a horn section that didn't last long before being replaced by a single saxophonist, Clarence Clemons. Due to a lack of work, however, Springsteen broke up the band and began playing solo shows in New York City. It was as a solo performer that he acquired a manager, Mike Appel, who arranged an audition for legendary Columbia Records talent scout John Hammond. Hammond signed Springsteen to Columbia in 1972.\n\n  In preparing his debut LP, Greetings from Asbury Park, N.J., Springsteen immediately re-hired most of his backup band, Federici, Lopez, Sancious, Tallent, and Clemons. (Van Zandt, on tour with the Dovells, was mostly unavailable.) The album went unnoticed upon its initial release in January 1973 (although Manfred Mann's Earth Band would turn its lead-off track, &quot;Blinded by the Light,&quot; into a number one hit four years later, and the LP itself has since gone double platinum). The Wild, the Innocent &amp; the E Street Shuffle (September 1973) also failed to sell despite some rave reviews. (It too has gone double platinum.) The following year, Springsteen revised his backup group -- now dubbed the E Street Band -- as Lopez and Sancious left, and Max Weinberg (drums) and Roy Bittan (piano) joined. (In 1975, Van Zandt returned to the group.) With this unit he toured extensively while working on the LP that represented his last chance with Columbia. By the time Born to Run (August 1975) was released, the critics and a significant cult audience were with him, and the title song became a Top 40 hit while the album reached the Top Ten, going on to sell six million copies.","torrent":{"xt":"urn:btih:931ab6d0ed089d8074813925b93a496e2e9d4ebc","amp;dn":"Bruce+Springsteen+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931ab6d0ed089d8074813925b93a496e2e9d4ebc","infoHashBuffer":{"type":"Buffer","data":[147,26,182,208,237,8,157,128,116,129,57,37,185,58,73,110,46,157,78,188]},"announce":[],"urlList":[]}}