{"title":"VLC Media Player 1.1.10 final update (windows all) [Quantine]","uid":6558582,"size":21024249,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9333b2b8a5cfba0d9a0f66d354b3ef82638251dd&amp;dn=VLC+Media+Player+1.1.10+final+update+%28windows+all%29+%5BQuantine%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Quantine","files":2,"time":1311375009,"description":"VLC Media Player is a long-time open-source favorite, and the latest version \nis also the first to be out of beta development. It's not the only option for \nfree video playback, but it's one of the best, and the feature updates in \nversion 1 make it well worth the upgrade.\nUsers can now get frame-by-frame advancement, granular speed controls allowing \nfor on-the-fly slower or faster playback, and live recording of streaming video. The toolbars are fully customizable, so you can have only the buttons you need in the interface, there's AirTunes streaming, and there's better integration in Gtk environments. Along with the improvements, VLC continues to offer robust support for a wide range of video and audio formats, including OGG, MP2, MP3, MP4, DivX, HD codecs like AES3, Raw Dirac, and even support for playing back zipped files.\nThe default interface is still a stripped down player that belies VLC's \nfunctionality and features. Skinning can fix that quickly, but behavior can \nstill be a bit unpredictable depending on the quality of the skin. VLC's \nopen-source foundation and community ensures that it evolves quickly and often, \nwith new features and fixes released frequently. Overall, VLC Media Player is a \nmust-have application for its ability to open just about any type of video file \nyou throw at it.","torrent":{"xt":"urn:btih:9333b2b8a5cfba0d9a0f66d354b3ef82638251dd","amp;dn":"VLC+Media+Player+1.1.10+final+update+%28windows+all%29+%5BQuantine%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9333b2b8a5cfba0d9a0f66d354b3ef82638251dd","infoHashBuffer":{"type":"Buffer","data":[147,51,178,184,165,207,186,13,154,15,102,211,84,179,239,130,99,130,81,221]},"announce":[],"urlList":[]}}