{"title":"[PDF] [2001] Handbook of Process Algebra","uid":6446966,"size":57963231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94798356b1c2ff3e3b96e6fecfab6725ac0525f8&amp;dn=%5BPDF%5D+%5B2001%5D+Handbook+of+Process+Algebra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307299755,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nProcess Algebra is a formal description technique for complex computer systems, especially those involving communicating, concurrently executing components. It is a subject that concurrently touches many topic areas of computer science and discrete math, including system design notations, logic, concurrency theory, specification and verification, operational semantics, algorithms, complexity theory, and, of course, algebra.\n\nThis Handbook documents the fate of process algebra since its inception in the late 1970's to the present. It is intended to serve as a reference source for researchers, students, and system designers and engineers interested in either the theory of process algebra or in learning what process algebra brings to the table as a formal system description and verification technique. The Handbook is divided into six parts spanning a total of 19 self-contained Chapters. \n\nThe organization is as follows. Part 1, consisting of four chapters, covers a broad swath of the basic theory of process algebra. Part 2 contains two chapters devoted to the sub-specialization of process algebra known as finite-state processes, while the three chapters of Part 3 look at infinite-state processes, value-passing processes and mobile processes in particular. Part 4, also three chapters in length, explores several extensions to process algebra including real-time, probability and priority. The four chapters of Part 5 examine non-interleaving process algebras, while Part 6's three chapters address process-algebra tools and applications.","torrent":{"xt":"urn:btih:94798356b1c2ff3e3b96e6fecfab6725ac0525f8","amp;dn":"%5BPDF%5D+%5B2001%5D+Handbook+of+Process+Algebra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94798356b1c2ff3e3b96e6fecfab6725ac0525f8","infoHashBuffer":{"type":"Buffer","data":[148,121,131,86,177,194,255,62,59,150,230,254,207,171,103,37,172,5,37,248]},"announce":[],"urlList":[]}}