{"title":"Still 2 2013 BRRip DVDr","uid":10087024,"size":4353378304,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:94930b1b642c254b26bd40a9ce7ecb69ea0db662&amp;dn=Still+2+2013+BRRip+DVDr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"headcedon7","files":22,"time":1399122984,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt3465208/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt3465208/&lt;/a&gt;\n\nPoj Arnon has rounded up another batch of directors for yet another horror omnibus, Tai Hong Tai Hian (à¸•à¸²à¸¢à¹‚à¸«à¸‡à¸•à¸²à¸¢à¹€à¸®à¸µà¹‰à¸¢à¸™), four sleazy ghost stories inspired by pulpy true-crime cases. Each segment is themed according to numbers, 14, 16, 15 and 13, which are referenced by such things as a button worn by a brothel worker, the room number in a run-down hotel or a record spinning a lullaby to lovers.\n\nStory 1: This segment, is directed by Thammanoon Sakulbunthanom (The Intruder). A young woman is leaving the office late. A guy has been calling and texting her, while he's driving his fast red car. But then he's not there, forcing the girl to take the &quot;last van of the evening&quot;. The phone messages persist and the surroundings in the van become increasingly spooky until it finally becomes clear that karma has caught up with the young lady.\n\nStory 2:\n\nThis segment, Tha Lor Soi 9, about the brothel, provides a bit of comic relief. Fan Chan kid star Charlie Trairat is one of a trio of guys who head to the place. His buddy wants to select girl No. 16 for the night, but they run into trouble, mainly from the house's strong-armed transgender madame, hilariously portrayed by transgender actor-director Tanwarin Sukkhapisit. Charlie and another of his pals then end up handcuffed to another customer.\n\nStory 3:\n\nThis segment has Poj Arnon himself chip in with the third entry, Pee Nai Chong Ae. It has a tattooed guitar-toting rock 'n' roller checking into a fleabag hotel, but there's something wrong with the air-con. Beauty-pageant queen Charm Osathanond provides eye candy before she becomes part of the ductwork.\n\nStory 4:\n\nThis segment is by Thanadol Nualsuth (The Intruder) and is an exasperatingly confusing revenge tale. With a chronology that was put in a blender and never put back together, Gam (&quot;bad karma&quot;:wink: is very difficult to follow. From what I could piece together, &quot;Golf&quot; Pichaya Nitipaisankul had a falling out with his psycho girlfriend, played by Manatnan &quot;Donut&quot; Phanloetwongsakun, and then entered the monkhood. But she kept hounding him, so he left the monkhood, tracked her down and killed her. Or maybe he killed her and then became a monk?\n\n\n\naudio: thai dd5.1\nsub : English, chinese\n\ntrailer on utube","torrent":{"xt":"urn:btih:94930b1b642c254b26bd40a9ce7ecb69ea0db662","amp;dn":"Still+2+2013+BRRip+DVDr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94930b1b642c254b26bd40a9ce7ecb69ea0db662","infoHashBuffer":{"type":"Buffer","data":[148,147,11,27,100,44,37,75,38,189,64,169,206,126,203,105,234,13,182,98]},"announce":[],"urlList":[]}}