{"title":"The 50 Best Sights in Astronomy and how to see them ","uid":12129392,"size":7099283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:955e81ddbb234a9b4cae23ba0717be30e50f0cc8&amp;dn=The+50+Best+Sights+in+Astronomy+and+how+to+see+them+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cquark","files":1,"time":1436998507,"description":"The 50 Best Sights in Astronomy and how to see them\n\nCharm-Quark\n\n\nBook Description:\nThis remarkable book introduces you to the fifty best sights in astronomy and tells you exactly how to see them. In no time at all, you will learn how to find and appreciate the Orion group of constellations; the Summer Triangle; Venus, Jupiter, and Mars; the best meteor showers; man-made satellites; star clusters; novae; variable stars; and more.The sights are presented according to the field of view necessary to see them. Your eyes and a clear night sky are all you need to view the sights in the first part of the book, before moving on to those that can be observed through binoculars and, finally, a telescope. Concise descriptions and explanations of these spectacular visual wonders will deepen your appreciation of them and spur further exploration. You will also find the essential basic information on astronomical observation you need to get started, including observing conditions, techniques, telescopes, and astronomical measurements.Once you start gazing, you'll see that the sky really is the limit--and discovering its amazing treasures will become your lifetime passion","torrent":{"xt":"urn:btih:955e81ddbb234a9b4cae23ba0717be30e50f0cc8","amp;dn":"The+50+Best+Sights+in+Astronomy+and+how+to+see+them+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"955e81ddbb234a9b4cae23ba0717be30e50f0cc8","infoHashBuffer":{"type":"Buffer","data":[149,94,129,221,187,35,74,155,76,174,35,186,7,23,190,48,229,15,12,200]},"announce":[],"urlList":[]}}