{"title":"Im Not There HDRip Spanish Ac3 2007","uid":5593719,"size":1474383872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:95655e1ffcab4ff6acc85f302d888261bd3487c3&amp;dn=Im+Not+There+HDRip+Spanish+Ac3+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":1,"time":1274918460,"description":"Un perfil del legendario mÃƒÂºsico Bob Dylan en el que siete personajes distintos (encarnados por conocidos actores y actrices) personifican diferentes aspectos de la vida personal y profesional del mÃƒÂ­tico cantante norteamericano. Bob Dylan cambiÃƒÂ³ la mÃƒÂºsica popular en los aÃƒÂ±os 60 y, desde entonces y hasta hoy, nunca ha dejado de influenciar a mÃƒÂºsicos, escritores, poetas... en definitiva a la cultura en general. Tomando como inspiraciÃƒÂ³n su carrera en constante cambio, &quot;I''''''''''''''''m Not There&quot; es un entretejido de una serie de historias en la AmÃƒÂ©rica de los aÃƒÂ±os 60 y 70. Cada historia expresa un aspecto de la mercÃƒÂºrica carrera de Dylan, y han sido filmadas de manera diferente a travÃƒÂ©s de tambiÃƒÂ©n muy diferentes intÃƒÂ©rpretes: Woody (Marcus Carl Franklin), un niÃƒÂ±o negro de 11 aÃƒÂ±os siempre huyendo; Robbie (Heath Ledger), un artista mujeriego siempre en la carretera; Jude (Cate Blanchett), un joven andrÃƒÂ³gino estrella del rock; John / Jack (Christian Bale), un ÃƒÂ­dolo folk que se reinventa como evangelista; Billy (Richard Gere), un famoso fugitivo milagrosamente vivo pero ya haciÃƒÂ©ndose viejo. Seis diferentes actores interpretando a seis personajes &quot;dylanescos&quot;, acompaÃƒÂ±ados cÃƒÂ³mo no por la irrepetible mÃƒÂºsica del artista.     ","torrent":{"xt":"urn:btih:95655e1ffcab4ff6acc85f302d888261bd3487c3","amp;dn":"Im+Not+There+HDRip+Spanish+Ac3+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95655e1ffcab4ff6acc85f302d888261bd3487c3","infoHashBuffer":{"type":"Buffer","data":[149,101,94,31,252,171,79,246,172,200,95,48,45,136,130,97,189,52,135,195]},"announce":[],"urlList":[]}}