{"title":"Todd Hannigan - Volume 1 [2004][EAC,log,cue. FLAC]","uid":8544884,"size":203307369,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:968e2da476019f24f73ce996687ca907fc450eb0&amp;dn=Todd+Hannigan+-+Volume+1+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":14,"time":1370496887,"description":"Artist: Todd Hannigan\nRelease: Volume 1\nReleased: 2004\nLabel: Brotheryn Records\nCatalog#: \nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: americana,Folk Rock\n\nimage\n\n\n1. Rise\n2. 3'Oclock\n3. Thicker\n4. Once\n5. Blvd\n6. Passing By\n7. End fo the Road\n8. Back of Your Mind\n9. Ireland\n10. Love\n11. Heal\n12. Sweet Dreams\n\n\nTodd Hannigan is usually a behind the scenes man - having produced for Jack Johnson and Tristan Prettyman. He has also written music for many surf movies, but now Todd is stepping into the light on his own with his debut album Volume 1.\n\nLike his friends, Todd's music is quite surf/rock/pop. It's a very popular style these days, and as far as popularity goes it is a good decision. You can tell by listening that the musos are talented, but I feel that too much of the CD is the same. The thing I really dig about music is that you can have so many different sounds and vibes all on the one disc. When you make tracks the same - although I can understand that when something sells, you copy it- and take the formula to reproduce it, I dont respect that.\n\nApart from a few nice suprises I feel that this album lacks creativity. There is hope though. The music at times soars, and it shows potential. To capitalise on this Todd needs to take more risks -because sometimes they pay off. Like on 'Rise'. It is a beautiful little song, with each instrument gelling perfectly together and setting the scene. I have to say it is my favorite on the album. This is the perfect track to open with, and excites the listener for what will come.\n\nIt may just be me, but I must admit I felt a certain nod to 70's era music here. Some psychadelic riffs come into play here. A respectful nod, none the less. It suits Todd well. There seems to be one main style throughout the album, and he sticks to that. If you love the style then thats a good thing, but its also nice to mix things up a bit now and then. I do find it a bit too 'samey' after a while. &quot;walk to the left side and show them your best side&quot; says 'End of the road'. This track is a grower. I think with more plays the songs will bleed their way into your psyche. I do recommend the album as a background easy listening kinda lazy sunday thing. I'm impressed with the instrumentation, and the vibe is relaxing. And I wont hesitate to admit that it is a good thing.","torrent":{"xt":"urn:btih:968e2da476019f24f73ce996687ca907fc450eb0","amp;dn":"Todd+Hannigan+-+Volume+1+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"968e2da476019f24f73ce996687ca907fc450eb0","infoHashBuffer":{"type":"Buffer","data":[150,142,45,164,118,1,159,36,247,60,233,150,104,124,169,7,252,69,14,176]},"announce":[],"urlList":[]}}