{"title":"Game Commander 2","uid":3346801,"size":7029916,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:97b7ca8a78d27b17cee00c80117369699fc55e05&amp;dn=Game+Commander+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lesny13","files":1,"time":1119297812,"description":"Game Commander 2 is the voice command application that will take you to the next level of PC gaming. Game Commander 2 saves you from the myriad of awkward keystrokes used in today's games by assigning voice commands to them. No more delays trying to remember odd keystrokes to issue a command. You want your troops to attack? Simply say, &quot;Attack!&quot;\nAll of the keyboard and joystick controls that you're used to are left intact--Game Commander 2 simply supplements them with voice commands so you can respond to every situation in the fastest and most natural way. Use the keyboard and joystick for firing and steering. Use your voice to issue commands that would otherwise distract you or slow you down.\n\nGame Commander 2 uses speaker-independent voice recognition technology, so no voice training is required. Furthermore, it comes packaged with ready-made templates for several popular PC games, so it can be installed and used immediately to start controlling those games by voice. You can download the latest game templates from the Game Commander home page.","torrent":{"xt":"urn:btih:97b7ca8a78d27b17cee00c80117369699fc55e05","amp;dn":"Game+Commander+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97b7ca8a78d27b17cee00c80117369699fc55e05","infoHashBuffer":{"type":"Buffer","data":[151,183,202,138,120,210,123,23,206,224,12,128,17,115,105,105,159,197,94,5]},"announce":[],"urlList":[]}}