{"title":"Bud Light Presents Real Men of Genius/ American Heros &amp; Lizards","uid":4549239,"size":123070803,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:97c74825b9d8ccae7eb84a74066da367070fd9b1&amp;dn=Bud+Light+Presents+Real+Men+of+Genius%2F+American+Heros+%26+Lizards&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PrinceoftheUniverse","files":148,"time":1228243955,"description":"1. Bud Light Presents - Mr. Bass Plaque Maker (1:00)\n2. Bud Light Presents - Mr. Bowling Shoe Giver Outer (1:02)\n3. Bud Light Presents - Mr. Bumper Sticker Writer (0:59)\n4. Bud Light Presents - Mr. Ceremonial First Pitch Thower Outer (1:00)\n5. Bud Light Presents - Mr. Chinese Food Delivery Guy (1:02)\n6. Bud Light Presents - Mr. Deli Meat Slicer (1:02)\n7. Bud Light Presents - Mr. Driving Range Ball Picker Upper (1:02)\n8. Bud Light Presents - Mr. Fake Tattoo Inventor (0:59)\n9. Bud Light Presents - Mr. Foot Long Hot Dog Inventor (1:02)\n10. Bud Light Presents - Mr. Fortune Cookie Fortune Writer (0:59)\n11. Bud Light Presents - Mr. Furniture Assembly Manual Writer (1:03)\n12. Bud Light Presents - Mr. Garden Gnome Maker (1:02)\n13. Bud Light Presents - Mr. Giant Foam Finger Maker (1:02)\n14. Bud Light Presents - Mr. Golfball Washer Inventor (1:07)\n15. Bud Light Presents - Mr. Hawaiian Shirt Pattern Designer (1:00)\n16. Bud Light Presents - Mr. Inspirational Poster Writer (0:59)\n17. Bud Light Presents - Mr. Jelly Donut Filler (0:59)\n18. Bud Light Presents - Mr. Losing Locker Room Reporter (0:59)\n19. Bud Light Presents - Mr. Major League Infield Raker (0:59)\n20. Bud Light Presents - Mr. Male Football Cheerleader (1:03)\n21. Bud Light Presents - Mr. Multi-Colored Sweater Wearer (1:01)\n22. Bud Light Presents - Mr. Outside The Stadium Peanut Seller (1:04)\n23. Bud Light Presents - Mr. Over-Zealous Foulball Catcher (1:00)\n24. Bud Light Presents - Mr. Parking Attendant Flashlight Waver (1:00)\n25. Bud Light Presents - Mr. Pickled Pig's Feet Eater (1:03)\n26. Bud Light Presents - Mr. Pit Crew Water Bottle Squirter (1:02)\n27. Bud Light Presents - Mr. Pro Wrestling Wardrobe Designer (1:02)\n28. Bud Light Presents - Mr. Professional Movie Extra Guy (1:02)\n29. Bud Light Presents - Mr. Putt Putt Golf Course Designer (0:59)\n30. Bud Light Presents - Mr. Really Bad Toupee Wearer (1:00)\n31. Bud Light Presents - Mr. Deli Meat Slicer (1:02)\n32. Bud Light Presents - Mr. Underwear Inspector #12 (1:01)\n33. Bud Light Presents - Mr. Way Too Much Cologne Wearer (1:00)\n34. Bud Light Presents - Mr. Wrecking Ball Operator (1:02)\n35. Bud Light Presents - Mr. 80 SPF Sunblock Wearer (1:00)\n36. Bud Light Presents - Mr. After Halloween Costume Shop Salesman (1:00)\n37. Bud Light Presents - Mr. Airline Meal Chef (1:03)\n38. Bud Light Presents - Mr. Airport Baggage Handler (1:02)\n39. Bud Light Presents - Mr. All You Can Eat Buffet Inventor (1:01)\n40. Bud Light Presents - Mr. Athletic Groin Protector Inventor (1:00)\n41. Bud Light Presents - Mr. Backyard Bug Zapper Inventor (1:00)\n42. Bud Light Presents - Mr. Baseball Designated Hitter (1:03)\n43. Bud Light Presents - Mr. Basketball Court Sweat Wiper Upper (1:00)\n44. Bud Light Presents - Mr. Bathroom Stall Dirty Joke Writer (1:02)\n45. Bud Light Presents - Mr. Beach Metal Detector Guy (1:00)\n46. Bud Light Presents - Mr. Boneless Buffalo Wing Inventor (0:59)\n47. Bud Light Presents - Mr. Boombox Carrying Rollerskater (1:00)\n48. Bud Light Presents - Mr. Camouflage Suit Maker (1:00)\n49. Bud Light Presents - Mr. Cargo Pants Designer (1:01)\n50. Bud Light Presents - Mr. Centerfold Retoucher (1:00)\n51. Bud Light Presents - Mr. Company Computer Guy (1:02)\n52. Bud Light Presents - Mr. Cruise Ship Entertainer (1:01)\n53. Bud Light Presents - Mr. Department Store Mannequin Dresser Upper (1:00)\n54. Bud Light Presents - Mr. Discount Airline Pilot Guy (1:03)\n55. Bud Light Presents - Mr. Discount Suit Salesman (1:01)\n56. Bud Light Presents - Mr. Dishonest Cable TV Hooker Upper (1:01)\n57. Bud Light Presents - Mr. Edible Underwear Maker (0:59)\n58. Bud Light Presents - Mr. Egg Nog Inventor (1:00)\n59. Bud Light Presents - Mr. Electric Carving Knife Inventor (1:00)\n60. Bud Light Presents - Mr. Fancy Coffee Shop Coffee Pourer (1:01)\n61. Bud Light Presents - Mr. Fantasy Football Manager Guy (1:00)\n62. Bud Light Presents - Mr. Frozen Turkey Helpline Guy (0:59)\n63. Bud Light Presents - Mr. Furniture Assembly Manual Writer (1:03)\n64. Bud Light Presents - Mr. Gangsta Rapper Posse Member (1:03)\n65. Bud Light Presents - Mr. Gasoline BBQ Starter (1:00)\n66. Bud Light Presents - Mr. Giant Pink Inflatable Gorilla Maker (1:00)\n67. Bud Light Presents - Mr. Giant Pocket Knife Inventor (1:01)\n68. Bud Light Presents - Mr. Giant Pocket Knife Inventor (1:01)\n69. Bud Light Presents - Mr. Giant Taco Salad Inventor (1:00)\n70. Bud Light Presents - Mr. Grocery Store Cart Wrangler (1:00)\n71. Bud Light Presents - Mr. Hair Gel Over Geller (1:00)\n72. Bud Light Presents - Mr. Half-Time Shooting Contest Contestant (1:00)\n73. Bud Light Presents - Mr. Handlebar Mustache Wearer (1:01)\n74. Bud Light Presents - Mr. Hollywood Plastic Surgeon (1:01)\n75. Bud Light Presents - Mr. Homemade Pontoon Boat Maker (1:01)\n76. Bud Light Presents - Mr. Horse Drawn Cairrage Driver (1:00)\n77. Bud Light Presents - Mr. Hot Dog Eating Contest Contestant (1:00)\n78. Bud Light Presents - Mr. Hot Stock Tip Giver Outer (1:02)\n79. Bud Light Presents - Mr. Humongous Pumpkin Grower Guy (1:00)\n80. Bud Light Presents - Mr. In The Car Nose Picker (1:01)\n81. Bud Light Presents - Mr. Indecisive Food Orderer Guy (1:00)\n82. Bud Light Presents - Mr. Jean Shorts Inventor (1:00)\n83. Bud Light Presents - Mr. King of the Karaoke Mic (1:00)\n84. Bud Light Presents - Mr. Kiss Me I'm Irish Pin Wearer (0:59)\n85. Bud Light Presents - Mr. Mail Order Bride Orderer (1:00)\n86. Bud Light Presents - Mr. Major Highway Line Painter (1:03)\n87. Bud Light Presents - Mr. Male Fur Coat Wearer (1:00)\n88. Bud Light Presents - Mr. Miniature Train Modeler (1:03)\n89. Bud Light Presents - Mr. Moped Souper Upper (1:00)\n90. Bud Light Presents - Mr. Movie Theater Ticket Ripper Upper (1:01)\n91. Bud Light Presents - Mr. Multi-Colored Sweater Wearer (1:01)\n92. Bud Light Presents - Mr. Next Day Carpet Installer (1:01)\n93. Bud Light Presents - Mr. Nosebleed Section Ticket Holder Guy (1:00)\n94. Bud Light Presents - Mr. Nudist Colony Activity Coordinator (1:01)\n95. Bud Light Presents - Mr. Over The Top Carb Counter (0:59)\n96. Bud Light Presents - Mr. Parade Float Driver (1:01)\n97. Bud Light Presents - Mr. Paranoid of The Ocean Guy (1:00)\n98. Bud Light Presents - Mr. Pet Toy Designer (1:03)\n99. Bud Light Presents - Mr Pro Football Cord Carrier (1:03)\n100. Bud Light Presents - Mr. Pro Sports Heckler Guy (1:01)\n101. Bud Light Presents - Mr. Professional Figure Skater (0:58)\n102. Bud Light Presents - Mr. Push Up Bra Inventor (1:01)\n103. Bud Light Presents - Mr. Really Big Pet Snake Owner (1:01)\n104. Bud Light Presents - Mr. Really Loud Cell Phone Talker Guy (1:00)\n105. Bud Light Presents - Mr. Really Really Really Bad Dancer (1:01)\n106. Bud Light Presents - Mr. Really Stinky Breath Breather Outer (1:01)\n107. Bud Light Presents - Mr. Restroom Toilet Paper Refiller (1:00)\n108. Bud Light Presents - Mr. Silent Killer Gas Passer (1:00)\n109. Bud Light Presents - Mr. Souvenir Snow Globe Maker (1:00)\n110. Bud Light Presents - Mr. Sports Fan Face Painter (1:01)\n111. Bud Light Presents - Mr. Supermarket Free Sample Guy (1:01)\n112. Bud Light Presents - Mr. Supermarket Produce Putter Outer (1:00)\n113. Bud Light Presents - Mr. Tiny Dog Clothing Manufacturer (1:02)\n114. Bud Light Presents - Mr. Tiny Thong Bikini Wearer (1:00)\n115. Bud Light Presents - Mr. Tuxedo Shop Tux Renter (1:01)\n116. Bud Light Presents - Mr. Used Car Lot Auto Salesman (1:00)\n117. Bud Light Presents - Mr. Way Too Much Cologne Wearer (1:01)\n118. Bud Light Presents - Mr. Way Too Proud of Texas Guy (1:01)\n119. Bud Light Presents - Mr. Wedding Band Guitar Player (1:00)\n120. Budweiser Theme - This Bud's For You (Stereo) (1:00)\n121. Budweiser Lizards - He Can't Even Say The Name Of (0:29)\n122. Budweiser Lizards - Louis Frankie And The Ferrets (1:02)\n123. Budweiser Lizards - Louis Is Sick Of The Final EpiBudweiser Lizards (0:32)\n124. Budweiser Lizards - Louis Makes A Disclaimer AboutBudweiser Lizards (0:16)\n125. Budweiser Lizards - Louis You Are One Sick Lizard (0:15)\n126. Budweiser Lizards - Middle Frog Develops A Tic (0:33)\n127. Budweiser Lizards - Practicing 'weis' (0:56)\n128. Budweiser Lizards - Summer Branch (0:55)\n129. Budweiser Lizards - The Sign Falls And Frys Frogs (0:31)\n130. Budweiser Lizards - There Are No Small Parts, OnlyBudweiser Lizards (0:31)\n131. Budweiser Lizards - They Never Saw It Coming Poor (0:31)\n132. Budweiser Lizards - What Does He Mean Canned (0:31)\n133. Budweiser - Summer Branch (0:54)\n134. Budweiser - Wuzzup (0:48)\n135. Budweiser Lizards - Assassinate the Frogs (0:15)\n136. Budweiser Lizards - Big Game Coming Up (0:15)\n137. Budweiser Lizards - Ferret Insults (0:58)\n138. Budweiser Lizards - Frogs Fight Back (0:31)\n139. Budweiser Lizards - Interviewing Ferret (0:57)\n140. Budweiser Lizards - Pickup Lines (1:01)\n141. Budweiser Lizards - Take Me Out (Sing-Along With Ferret) (1:00)\n142. Budweiser Lizards &amp; Ferret - The Ferret's Joke (1:01)\n143. Budweiser Lizards - Beechwood (0:51)\n144. Budweiser Lizards - Beechwood Aging (1:14)\n145. Budweiser Lizards - Denial (0:53)\n146. Budweiser Lizards - Do These Frogs Really Taste Like Chicken (0:15)\n147. Budweiser Lizards - Ferret Ferret Ferret Do You ReBudweiser Lizards (0:16)\n148. Budweiser Lizards - Frogs Fight Back (0:31)\n\n\nNot all of the Real Men of Genius or American Heros, but its a good chunk.","torrent":{"xt":"urn:btih:97c74825b9d8ccae7eb84a74066da367070fd9b1","amp;dn":"Bud+Light+Presents+Real+Men+of+Genius%2F+American+Heros+%26+Lizards","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c74825b9d8ccae7eb84a74066da367070fd9b1","infoHashBuffer":{"type":"Buffer","data":[151,199,72,37,185,216,204,174,126,184,74,116,6,109,163,103,7,15,217,177]},"announce":[],"urlList":[]}}