{"title":"The Masterplan v1.0.4","uid":12056435,"size":132356529,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9831e79329bd54483e733a6e6c5fde4143321120&amp;dn=The+Masterplan+v1.0.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1435139451,"description":"About This Game\nThe Masterplan is a tactical squad-based heist game set in 1970s. The 2D top-down view gives you a great overview of what's happening at any given moment, allowing you to be a real criminal mastermind. Features hand-drawn 2D graphics and fun group control, granting you total control - at least until someone calls the cops and everything goes haywire.\n\nDuring the game you'll need to heist your way through 20 unique hand-crafted heists in a persisting career mode, manage your crew from heist to heist by hiring the right goons and by making sure they are properly equipped. A test of a true mastermind will be to execute the plan to perfection, keep the goons alive, and walk away with the maximum loot from each heist.\n\nDepending on your preference, you can hit your targets loud, or in stealth, or a mix of both. Keep the civilians under control, knock them out, or leave no witnesses. It's all up to you, just make sure you won't be there when the cops arrive - or be ready for a brutal firefight.\nKey Features\n\n    Heist your target silently or go guns blazing - your choice (and your consequences)\n    Switch the game into Slow-Motion on demand, to give you time to plan and to give your orders\n    Control civilians and guards at gunpoint with the unique threaten system\n    Employ a variety of weaponry and gear, from pistols and bombs to shotguns and tranquilizer guns\n    Carry and hide bodies to avoid detection\n    Use disguises to infiltrate forbidden areas\n    Disable electrical systems\n    Manage your crew\n    Unlock and rob 20 unique heist locations, each allowing you to choose your own approach and play in a sandbox environment\n    Discover, plan, and execute the greatest heist in the history of mankind!","torrent":{"xt":"urn:btih:9831e79329bd54483e733a6e6c5fde4143321120","amp;dn":"The+Masterplan+v1.0.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9831e79329bd54483e733a6e6c5fde4143321120","infoHashBuffer":{"type":"Buffer","data":[152,49,231,147,41,189,84,72,62,115,58,110,108,95,222,65,67,50,17,32]},"announce":[],"urlList":[]}}