{"title":"Mr. Scott's Guide To The Enterprise","uid":5239926,"size":158020190,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9947a9276035b4a6ed85ebce35d30e93ad78e21c&amp;dn=Mr.+Scott%5C%27s+Guide+To+The+Enterprise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"momamedienta","files":1,"time":1261710436,"description":"Mr. Scott's Guide to the Enterprise, written and illustrated by Shane Johnson and published by Pocket Books, is a book describing the post-refit USS Enterprise (with some information on the Enterprise-A) from the Star Trek fictional universe. It is written from the viewpoint of the ship's chief engineer, Montgomery Scott. The manual was first printed in 1987.\n\nThe Guide opens with a brief introduction by Mr. Scott and a description of the Constitution class refit. Following this, a chapter on general information, containing such data as Starfleet uniforms of the era, fonts used in computer displays and hull markings, and various graphics used aboard the ship. It goes on to describe the Enterprise deck by deck from the top downward and concludes with a description of the Enterprise-A.\n\nAlthough Star Trek staffers such as Michael Okuda and Andrew Probert served as consultants for the book, it contains statements that were later contradicted. The book indicates that the Enterprise's original five-year mission ended on April 7, 2212, while later and more authoritative print (Star Trek: The Next Generation Technical Manual, The Star Trek Encyclopedia and on-screen references (Star Trek: Voyager: &quot;Q2 (Voyager episode)&quot;) put the end of the mission around 2270.\n\nThe description of transwarp drive and other technologies are different from, if not outright incompatible with, later descriptions. Some of these contradictions stem from the book's use of some FASA Star Trek Roleplaying Game source materials, particularly the chronology, based on the earlier Spaceflight Chronology.\n\nParamount revoked FASA's license soon after the book was published and began to contradict FASA's material early in Star Trek: The Next Generation's run.\n\nHowever, Johnson also had access to set designs and production schematics that were used to create many places and devices that appear in the Star Trek films. This material largely informed the book's detailed schematics of decks, compartments, and equipment.","torrent":{"xt":"urn:btih:9947a9276035b4a6ed85ebce35d30e93ad78e21c","amp;dn":"Mr.+Scott%5C%27s+Guide+To+The+Enterprise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9947a9276035b4a6ed85ebce35d30e93ad78e21c","infoHashBuffer":{"type":"Buffer","data":[153,71,169,39,96,53,180,166,237,133,235,206,53,211,14,147,173,120,226,28]},"announce":[],"urlList":[]}}