{"title":"Stephen Hunter - Bob Lee Swagger Series 03 - Time To Hunt","uid":4852339,"size":176689311,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:99bdeac4854dd5f7bb5bc4891e1adde6db2e0e4b&amp;dn=Stephen+Hunter+-+Bob+Lee+Swagger+Series+03+-+Time+To+Hunt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Joshseane","files":-1,"time":1239919732,"description":"Amazon.com Review\nAfter a literally explosive opening where sniper fire cuts through the chest of an unnamed victim (Swagger?), readers of Time to Hunt are plunged into the final years of the Vietnam War and the struggles of Marine Donny Fenn. Stationed in Washington, D.C., after recovering from a nearly mortal wound, Fenn is asked to spy on Marines who may have ties to the peace movement. What Donny quickly learns, however, is that his Navy superiors are more interested in framing somebody than they are in finding the truth. In this first section, readers waiting to discover the outcome of the assassination and glimpse Bob &quot;The Nailer&quot; Swagger will instead be swept away by Hunter's vivid painting of the divided loyalties and torn identities that plagued soldiers and citizens in the early 1970s.\n\nBut all of this action is only a prelude to Donny's subsequent relationship with Swagger in Vietnam. Hunter fleshes out the mythology that he began to create in Point of Impact as readers watch Swagger add to his famed body count and confront his nemesis, Solaratov. Hunter moves deftly from the mind of Solaratov to Donny and back to Swagger, and in each character finds the core of the Vietnam experience--fear, coldness, sadness, horror, elation.\n\nThe last two sections cut to contemporary events and find Swagger married to Donny's former love, Julie. Slowly, the events of the first half of the book begin to merge with Swagger's present history and stories that readers will recognize from Hunter's earlier novels. Swagger uncovers a deep connection between the Vietnam demonstrations of the 1970s, the predatory work of the CIA, and the killer who is after him and his family now. Nothing is as it first seems, and readers of Point of Impact and Black Light will have to revise all their expectations. --Patrick O'Kelley --This text refers to an out of print or unavailable edition of this title.\n\nFrom Library Journal\nWhen a sniper shoots a man in the mountains of Idaho and wounds the woman who is with him, it is not an isolated incident but the deliberate culmination of events that began during the Vietnam War. Bob Lee Swagger, who was a Marine sniper in Vietnam known as &quot;Bob for the Nailer&quot; for his lethal shooting, at first believes that he was the gunman's intended target. The wounded woman is his wife and the widow of his wartime comrade, Donny Fenn. Donny had been killed by a Russian sniper assigned the task of neutralizing Bob, or so Bob had always believed. But now it seems possible that Donny might have been the main target all those years ago and that it is Donny's widow that the sniper has come to kill, not Bob. Both a gripping war novel and a complex thriller coiled around the convoluted intrigues of the supposedly concluded Cold War, this is page-turning entertainment that will delight action adventure readers.?Charles Michaud, Turner Free Lib., Randolph, MA","torrent":{"xt":"urn:btih:99bdeac4854dd5f7bb5bc4891e1adde6db2e0e4b","amp;dn":"Stephen+Hunter+-+Bob+Lee+Swagger+Series+03+-+Time+To+Hunt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99bdeac4854dd5f7bb5bc4891e1adde6db2e0e4b","infoHashBuffer":{"type":"Buffer","data":[153,189,234,196,133,77,213,247,187,91,196,137,30,26,221,230,219,46,14,75]},"announce":[],"urlList":[]}}