{"title":"The_birth_of_Venus","uid":9844078,"size":178399539,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9a152992def6eac102c5451afb486ee4b20e3ef6&amp;dn=The_birth_of_Venus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":57,"time":1396043826,"description":"from wiki:\n\nThe Birth of Venus: A Novel is a 2003 novel by Sarah Dunant, a bestselling British author. The story is set in the late 15th century in Florence, Italy. It features a young Florentine girl, Alessandra Cecchi, who is drawn to a young painter commissioned to paint the family's chapel walls. The painter is brought to her home by her father, a rich textile merchant whose business would be negatively affected by the rise of Girolamo Savonarola in Florence over the next few years. The book follows Alessandra's daily life, and is written in the first-person, as a memoir written by Alessandra late in her life. Her passion for painting and learning serve her well, but her family does not approve. Her mother tries her hardest to shape Alessandra into a woman who will be desired by a successful and powerful man. Eventually, after Alessandra has met the painter, but before her feelings for him and his talent have made themselves known to her, her hateful brother Tomaso suggests strong but quiet Cristoforo Langella as a potential husband for her. She marries him shortly afterward.\n\nMeanwhile, her attraction to the painter grows, as does her affection for her husband Langella. Alessandra's observations of the political turbulence in Florence are key to the storyline. Dunant captures the personal conflict felt by Alessandra - she feels torn between Savonarola's fiery message and her own ideas. She believes she knows what is right, but doesn't know what she will do about it.\n\nAlessandra realizes that her duty to her family and to her spouse cannot take over her life, and eventually realizes her passions for the painter. Her romance, it seems is necessary, because she is the one who can save him.\n\n\n\n\nbit rate 64kbps","torrent":{"xt":"urn:btih:9a152992def6eac102c5451afb486ee4b20e3ef6","amp;dn":"The_birth_of_Venus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a152992def6eac102c5451afb486ee4b20e3ef6","infoHashBuffer":{"type":"Buffer","data":[154,21,41,146,222,246,234,193,2,197,69,26,251,72,110,228,178,14,62,246]},"announce":[],"urlList":[]}}