{"title":"And Then She Was Gone by Rosalind Noonan","uid":9618039,"size":1230023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a7a2d26cd6aa9ddcdbd32a6763987afe02f1643&amp;dn=And+Then+She+Was+Gone+by+Rosalind+Noonan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1392445699,"description":"\nEleven-year-old Lauren O'Neil vanished one sunny afternoon as she walked home from school. Six years later, her parents Rachel and Dan still tirelessly scour their Oregon hometown and beyond, always believing Lauren will be found. Then one day, the call comes.\n\nLauren has been rescued from a secluded farm mere miles away, and her abductor has confessed. Yet her return is nothing like Rachel imagined. Though the revelations about what Lauren endured are shocking, most heartbreaking of all is to see the bright-eyed, assertive daughter she knew transformed into a wary, polite stranger.\nLauren's first instinct is to flee. \n\nFor years she's been told her parents forgot her;now she doubts the pieces of her life can ever fit together again. But Rachel refuses to lose her a second time. Little by little they must relearn what it means to be a family, trusting that their bond is strong enough to guide them back to each other.\nIntensely moving and absorbing, this is an extraordinary story told with sensitivity and grace, and filled with the depth and breadth of a mother's love.\n\nGenre: Mystery/Crime","torrent":{"xt":"urn:btih:9a7a2d26cd6aa9ddcdbd32a6763987afe02f1643","amp;dn":"And+Then+She+Was+Gone+by+Rosalind+Noonan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a7a2d26cd6aa9ddcdbd32a6763987afe02f1643","infoHashBuffer":{"type":"Buffer","data":[154,122,45,38,205,106,169,221,205,189,50,166,118,57,135,175,224,47,22,67]},"announce":[],"urlList":[]}}