{"title":"The Eagle Camulod Chronicles - Book 9 [AudioBook] - sum1_here","uid":9429359,"size":530588988,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9ae8b1d41e9236a3fad3977b8eccd2ae3c1945a1&amp;dn=The+Eagle+Camulod+Chronicles+-+Book+9+%5BAudioBook%5D+-+sum1_here&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"sum1_here","files":-1,"time":1388763419,"description":"The Eagle Camulod Chronicles - Book 9 [AudioBook] - sum1_here\n\nBeginning with The Skystone, the first in his riveting Camulod Chronicles, Jack Whyte has embarked on an ambitious and remarkable re-telling of the Arthurian cycle, giving us a fresh and compelling take on a story that has been beloved for centuries. The Eagle brings us at last to the heart of the tale, the creation of fabled Camelot and the love story that enshrined its glory. Whyte takes us into the minds and lives of Arthur, Guinevere, and Lancelot, three astonishing but fallible people who were bound together by honor, loyalty, and love. Three who created the glory that was Britain's shining dream...and, some say, caused its downfall. The Gaulish nobleman Clothar - known in our time as Lancelot - is drawn to the young High King's court by tales of honor and nobility, where he meets a man whose love of law matches his own. More, he finds in Arthur a life-long friend whose dream of uniting the people of Britain in peace Clothar embraces. And Clothar meets Arthur's queen, a wondrous beauty whose passion and ideals match those of her husband. Together they work to bring Arthur's dream to life.\n\nBut dark forces rise in opposition to Arthur's plans for creating this noble island nation and it is hard to tell friend from foe in the swirling chaos that ensues. Many tales have been told of the dream that shined and died. This one will astonish even the most jaded.\n\nÂ©2005 Jack Whyte; (P)2013\nProduct Details\nListening Length: 29 hours and 25 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nRelease Date: August 20, 2013\nLanguage: English","torrent":{"xt":"urn:btih:9ae8b1d41e9236a3fad3977b8eccd2ae3c1945a1","amp;dn":"The+Eagle+Camulod+Chronicles+-+Book+9+%5BAudioBook%5D+-+sum1_here","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae8b1d41e9236a3fad3977b8eccd2ae3c1945a1","infoHashBuffer":{"type":"Buffer","data":[154,232,177,212,30,146,54,163,250,211,151,123,142,204,210,174,60,25,69,161]},"announce":[],"urlList":[]}}