{"title":"Jah Wobble's Invaders Of The Heart - Rising Above Bedlam + Ta","uid":3962226,"size":378189255,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9bf9e95acec089080d0d7459f1363b405b8d72e8&amp;dn=Jah+Wobble%5C%27s+Invaders+Of+The+Heart+-+Rising+Above+Bedlam+%2B+Ta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":48,"time":1199523261,"description":"JAH WOBBLE\n\nBorn John Wardle, Wobble was an old friend of Sex Pistols singer Johnny Rotten. When the Pistols broke up, Rotten formed Public Image Limited, and Wobble became the bass player. After the group&amp;#039;s first few albums, Wobble had a falling out with Rotten (now Lydon) and guitarist Keith Levene and departed for a solo career, also collaborating with artists such as Can members Jaki Liebezeit and Holger Czukay and U2&amp;#039;s the Edge. Wobble&amp;#039;s solo repertoire ranges from pop to pseudo-reggae to difficult-to-listen-to experimentation. In the late &amp;#039;80s, his career took a downward direction, and he had a job sweeping train stations. He began listening to foreign music from places like North Africa, the Middle East, and Eastern Europe and formed Invaders of the Heart with guitarist Justin Adams. The single &quot;Bomba&quot; brought Wobble back to the public eye in 1990, and he collaborated with Sinead O&amp;#039;Connor and Primal Scream in addition to releasing the Invaders of the Heart album Rising Above Bedlam in 1991. Three years later, he released Take Me to God, which featured a number of guest appearences from the likes of Gavin Friday. In 1995, he released Psalms, which was followed in 1996 by The Inspiration of William Blake. In 1997 Wobble formed his own label, 30 Hertz, to release Jah Wobble Presents the Light Programme. Umbra Sumus appeared the following year. In 1999, Wobble released Deep Space, which featured appearences from Bill Laswell and Jaki Leibezeit. Full Moon over the Shopping Mall followed in the spring of 2000 and Molam Dub was issued later that fall. Passage to Hades appeared in spring 2001.\n\n\n\n1. Rising Above Bedlam\n\nThe second album by Jah Wobble&amp;#039;s Invaders of the Heart continued the bassist&amp;#039;s exploration into ethnic fusion, merging together music from different world traditions with pop production and his own dub-influenced bass guitar. Fans of Wobble&amp;#039;s earlier work with Holgar Czukay and Public Image Limited might be surprised and a bit dismayed at first by the glossy production and pop nature of some of the tracks here; one would never have guessed that Wobble would come up with something as commercial as the Latin pop of &quot;Ungodly Kingdom.&quot; However, much of the music is remarkable and on each listen seems to contain something new. Wobble is far more interested in experimentation than simply adding world sounds to pop music. The tracks with Middle Eastern influences, including the amazing &quot;Everyman&amp;#039;s an Island,&quot; are quite remarkable and most feature the fine talents of Natasha Atlas. Meanwhile, the trance-like opener, &quot;Visions of You,&quot; which guests Sin? O&amp;#039;Connor on vocals, is absolutely beautiful. On the title track, Wobble even returns to his past, with he and guitarist Justin Adams bringing the sound of early PiL forward ten years.\n\n\n01. Visions Of You                                                                                                      \n02. Relight The Flame                                                                                                   \n03. Bomba                                                                                                               \n04. Ungodly Kingdom                                                                                                     \n05. Rising Above Bedlam                                                                                                 \n06. Erzulie                                                                                                             \n07. Everyman&amp;#039;s An Island                                                                                                \n08. Soledad                                                                                                             \n09. Sweet Divinity                                                                                                      \n10. Wonderful World           \n\nLabel: Warner Music\nDate: 1991\n\n\n\n\n2. Take Me To God\n\nIt&amp;#039;s nice to see a new release from Wobble, the first actual new set since the wonderful Rising Above Bedlam. This album continues the mix of world music elements, adding rather more trance dance and techno than the previous album. Still, it&amp;#039;s a shifting collage of sound that pulls you from Algeria one moment to Jamaica the next and then manages to mix India with Ireland. There seems to be a little more balance this time, too, with far less drastic shifts. Congenial fun, good to dance to, and a terrific album to have playing all the time.\n\n\n01. God In The Beginning                                                                                                \n02. Becoming More Like God                                                                                           03. Whisky Priests                                                                                                      \n04. I&amp;#039;m An Algerian                                                                                                     \n05. Amor                                                                                                                \n06. Amor Dub                                                                                                            \n07. Take Me To God                                                                                                      \n08. The Sun Does Rise                                                                                                   \n09. When The Storm Comes                                                                                             10. I Love Everybody                                                                                                    \n11. Yoga Of The Nightclub                                                                                               \n12. I Am The Music                                                                                                      \n13. The Bonds Of Love                                                                                                   \n14. Angels                                                                                                              \n15. No Change Is Sexy                                                                                                   \n16. Raga                                                                                                                \n17. Forever\n\nLabel: Island\nDate: 1994\n\n\n\nBITRATE: 320\n\nMy cd-rips (EAC and Lame)\nCovers Included\n\n\n\n\n\n\nEnjoy,Seed and Share","torrent":{"xt":"urn:btih:9bf9e95acec089080d0d7459f1363b405b8d72e8","amp;dn":"Jah+Wobble%5C%27s+Invaders+Of+The+Heart+-+Rising+Above+Bedlam+%2B+Ta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bf9e95acec089080d0d7459f1363b405b8d72e8","infoHashBuffer":{"type":"Buffer","data":[155,249,233,90,206,192,137,8,13,13,116,89,241,54,59,64,91,141,114,232]},"announce":[],"urlList":[]}}