{"title":"ATV Offroad Fury 4 PAL MULTi5 PS2DVD5-AFRO [WwW.PlayStationPlane","uid":4110191,"size":3320453383,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:9c91b375b9a10b86dc85ee165514d67dac472fd7&amp;dn=ATV+Offroad+Fury+4+PAL+MULTi5+PS2DVD5-AFRO+%5BWwW.PlayStationPlane&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"afrogreencar","files":76,"time":1207010933,"description":"Featuring an all-new story mode, players will be able to live the life of a rookie rider and earn a path to the ranks of professional racer. Players will experience the drama and intensity of realistic offroad racing with increasingly difficult race challenges and events all tied together with engaging, story-driven Full Motion Videos (FMVs). ATV Offroad Fury 4 adds cross communication capabilities with ATV Offroad Fury Pro for the PSP system, including vehicle exchanges and upgrades, shared online communities, and the ability to share user created circuits.\n\nSupporting up to eight players online, ATV Offroad Fury 4 offers tournaments, voice and text chat, forums, player profiles, downloadable content, and the ability to exchange game data. With additional features including a track editor as well as extensive vehicle tuning and customization options, ATV Offroad Fury 4 is ready to deliver the most competitive and comprehensive offroad racing experience available.\n\n    * New Vehicles ? Adding to the selection of classic ATVs, more than 30 new vehicles are available to race including MX bikes, buggies, and trophy trucks.\n\n    * A new vehicle tuning system allows players to change tire type and gear ratios for optimum performance.\n\n    * Extensive vehicle customization provides players the chance to upgrade a vehicle?s suspension, engine, gearbox, exhaust, intake, and brakes.\n\n    * Customizable component parts for vehicle and rider. As players progress through the ranks the riders will gain new outfit color designs and logos for clothing and vehicles.\n\n    * New Story Mode ? Select a male or female rider to compete in races, challenges, and events to gain prestige and sponsorships. Throughout Story mode, Point-to-Pont Baja-style racing takes center stage as Full Motion Videos (FMVs) are used to connect the story of a rookie rider facing the past by returning to the race circuit in an attempt to progress through the professional ranks.\n\n    * New Track Editor ? Make the corners tighter and jumps higher with the ability to create and race on custom-built supercross and circuit tracks.\n\n    * New Cross-Connection Compatibility with ATV Offroad Fury Pro for PSP ? Players are now able to share customized circuits, exchange and upgrade vehicles, and access chat rooms and newsgroups with the upcoming ATV Offroad Fury Pro for PSP.\n    * New Point-to-Point Race Mode ? Race Baja-style with new free-roaming environments where players can truly race offroad and complete courses through multiple routes.\n\n    * New Comprehensive Online Tournaments ? Challenge rivals in an all-new tournament format.\n    * Online gameplay\n to support up to eight players including information on player rankings and profiles as well as the ability to exchange game data. Will include support for USB keyboard and USB headset (for PlayStation2) for voice and text chat.\n\n    * Key returning multiplayer modes include:\n\n    * Garage ? New section including unlocked data, vehicles, component parts, and rider outfits.\n\n    * Split Screen ? Challenge a friend in head-to-head racing on the same screen.\n\n    * Community ? Player access to message boards, buddy lists, and scoreboards.\n\n    * Additional single-player racing options include Training Mode, as well as eight different single event races including Supercross, Rallycross, National, Hill Climb, Head to Head, Freestyle, and Circuit.\n\n    * Five new freestyle tricks for a total of 30 high-flying moves that include combos and linkers.\n\n    * Visually stunning backgrounds with water and mud effects and fully interactive objects such as ramps, tires, cones, and trees.\n","torrent":{"xt":"urn:btih:9c91b375b9a10b86dc85ee165514d67dac472fd7","amp;dn":"ATV+Offroad+Fury+4+PAL+MULTi5+PS2DVD5-AFRO+%5BWwW.PlayStationPlane","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c91b375b9a10b86dc85ee165514d67dac472fd7","infoHashBuffer":{"type":"Buffer","data":[156,145,179,117,185,161,11,134,220,133,238,22,85,20,214,125,172,71,47,215]},"announce":[],"urlList":[]}}