{"title":"Deer hunter african safari Android","uid":6891887,"size":2958116,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9d352d1340de486004ea0a8b6a1dd11628d9a5bf&amp;dn=Deer+hunter+african+safari+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cad40","files":1,"time":1324047702,"description":"The most realistic hunting franchise returns with an all new adventure!\nThe most realistic hunting franchise returns to Android with an all new adventure: Deer Hunter: African Safari!\nTravel to South Africa, Cameroon and Tanzania to bag exotic big game animals such as Zebra, Buffalo, Kudu, Elephants, Lions and more!\nExperience breathtaking African scenery as you progress from rookie to master hunter, unlocking new hunts and purchasing new gear, weapons and skills. Participate in multi-day hunting excursions or opt for quickplay mode where you can choose from lightning and bonus rounds.\nBased on the multi-platform, best-selling hunting game from Atari, Deer Hunter: African Safari is as real as it gets!\n- Hunt in 3 different African countries including South Africa, Cameroon and Tanzania, all expertly rendered to make for the most realistic hunting sim experience available on Android.\n- All new exotic big game indigenous to Africa: Zebra, Buffalo, Kudu, Elephants, Lions and more - all with true-to-life sense and behaviors!\n- Stay alert! Certain dangerous animals like buffalo and lions will charge at you if your first shot isn't fatal, leaving you less reaction time to fire a second shot.\n- New day cycle adds realism to your hunts as daylight changes from dawn to noon to dusk\n- Toggle weapons mid-hunt - you can now choose between 2 different weapons during any given hunt.\n- Use the dynamic scope to zoom in and fire more precise shots, hitting your target's &quot;kill zone.&quot;\n- Develop your skills: accuracy, reflexes, endurance, tracking and stealth.\n- Visit the interactive trophy room and re-live your most skillful kills - view stats such as bullet trajectory, exact position of the animal when killed, and any bonus points earned for kill zone hits, vital hits, specific trophy values and distance.","torrent":{"xt":"urn:btih:9d352d1340de486004ea0a8b6a1dd11628d9a5bf","amp;dn":"Deer+hunter+african+safari+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d352d1340de486004ea0a8b6a1dd11628d9a5bf","infoHashBuffer":{"type":"Buffer","data":[157,53,45,19,64,222,72,96,4,234,10,139,106,29,209,22,40,217,165,191]},"announce":[],"urlList":[]}}