{"title":"The Curiosity","uid":8799344,"size":1192183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9de035cdca58a1960ded83f1530ae74c7e2bfdac&amp;dn=The+Curiosity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1376157122,"description":"\nFormat: ePub\n\nDRM stripped in Calibre.\n\nFor readers of Justin Cronin's The Passage, S J Watson's Before I go to Sleep and Audrey Niffenegger's The Time Traveller's Wife, The Curiosity is a haunting love story in which a man frozen for 100 years wakes up in today's America to be hounded by tabloids, condemned by religious conservatives, and hunted by a presidential candidate while he strives to come to terms with his unique second life, one in which he falls in love with a beautiful scientist from a century after him. Maverick scientific genius Erastus Carthage has developed a technique to bring frozen simple-celled animals back to life. But when his Arctic research vessel discovers a body encased in an iceberg, he seizes the chance to apply his pioneering process to a human being. The man Carthage's lad awakens from death is Jeremiah Rice, a Massachusetts judge, who was born in 1868 and fell overboard in 1906. Jeremiah is an instant celebrity - chased by paparazzi, vilified by the religious right, and overwhelmed by a society he sees as brilliant and diverse but also vulgar and violent. As his only ally biologist Kate Philo attempts to protect him from financial and political exploitation, the two fall in love. Meanwhile, Jeremiah's time on earth is slipping away. 'Poignant, luminescent, and absolutely perfect' Chris Bohjalian, bestselling author of Midwives and The Double Bind\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload.","torrent":{"xt":"urn:btih:9de035cdca58a1960ded83f1530ae74c7e2bfdac","amp;dn":"The+Curiosity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9de035cdca58a1960ded83f1530ae74c7e2bfdac","infoHashBuffer":{"type":"Buffer","data":[157,224,53,205,202,88,161,150,13,237,131,241,83,10,231,76,126,43,253,172]},"announce":[],"urlList":[]}}