{"title":"Graham Greene - The Honorary Consul","uid":4468591,"size":300485356,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9e85f7953b93734963594f98e6c0267ebcfb668f&amp;dn=Graham+Greene+-+The+Honorary+Consul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paulyearwig","files":-1,"time":1225026202,"description":"General Information\n===================\n Title:                  The Honorary Consul\n Author:                 Graham Greene\n Read By:                Tim Pigott-Smith\n Copyright:              1973\n Audiobook Copyright:    2000\n Genre:                  Mystery &amp; Thrillers\n Publisher:              Chivers Audio Books\n Abridged:               No\n\nOriginal Media Information\n==========================\n ISBN:                   0-7540-5397-0\n Media:                  CD\n Number:                 8\n Source:                 Library\n Condition:              Used\n\nFile Information\n================\n Number of MP3s:         127\n Total Duration:         10:23:44\n Total MP3 Size:         286.51\n Parity Archive:         No\n Ripped By:              A_S\n Ripped With:            Audiograbber\n Encoded With:           LAME 3.96\n Encoded At:             CBR 64 kbit/s 44100 Hz Mono\n Normalize:              MP3Gain, Radio 89dB\n Noise Reduction:        None\n ID3 Tags:               Set, v1.1, v2.3\n\nBook Description\n================\nEditorial Reviews\nReview\n&quot;The tension never relaxes and one reads hungrily from page to page, \nreading the moment it will end.&quot; - Auberon Waugh, Evening Standard\n\nBook Description\n\nSet in a provincial Argentinean town, The Honorary Consul takes place \nin that bleak country of exhausted passion, betrayal, and absurd hope \nthat Graham Greene has explored so precisely in such novels as The Power \nand the Glory and The Comedians.\n\nOn the far side of the great, muddy river that separates the two countries \nlies Paraguay, a brutal dictatorship shaken by sporadic revolutionary \nactivity; on the near side, a torpid city whose only visible cultural \ninstitution is a brothel. The foreigners of the city are refugees, each \nwashed up on the banks of the ParanÃƒÂ¡ by some inner disaster or defeat: \nDr. Eduardo Plarr, a physician, whose English father has vanished into \na Paraguayan prison, and for whom &quot;caring is the only dangerous thing&quot;; \nHumphries, a teacher of English, who has touched bottom and accepted \nit; Charley Fortnum, the Honorary Consul, who at the age of sixty-one, \nsustained by drink and his disputed status as British Consul, still \nretains enough hope and illusion to marry a twenty-year-old girl from \nSeÃƒÂ±ora Sanchez&amp;#039; brothel...\n\nWith gathering force, Graham Greene draws his characters into the political \nchaos that lies beneath the surface of South American life. Fortnum \nis kidnapped by Paraguayan revolutionaries who have mistaken him for \nthe American Ambassador. Realizing their error, they threaten to execute \nhim anyway if their demands are not met. Plarr, torn between his instinctive \nfeeling for the revolutionaries -- one of whom is an old friend -- and \nhis ambiguous relationship with Fortnum, whose wife he has taken as \na lover, becomes involved in a tragicomedy that leads inexorably to \na meaningless death.\n\nAt the center of The Honorary Consul is Plarr, a brilliant Graham Greene \ncreation, perhaps the most moving and convincing figure in his fiction. \nPlarr is a man so cut off from human feeling, so puzzled by the emotional \nneeds of men like Fortnum, that he is paradoxically vulnerable, chillingly \nexposed, and required in the end to pay with his life for the illusions \nthat other people believe in and that he himself cannot share.\n\nIn the men and women who surround Plarr -- Clara, who has moved from \nthe brothel to Charley Fortnum&amp;#039;s bedroom; Father Rivas, the revolutionary \npriest who dominates those near him, despite his unsanctified marriage \nand belief in political terror; Saavedra, the Argentinean novelist, \nwhose work lugubriously mirrors the world around him; Aquino, the poet-turned-r-\nevolutionary; Colonel Perez, the cheerfully efficient chief of police \n-- Graham Greene has created a world peculiarly his own. It is a world \nilluminated by that special passion for the complexities of love, faith, \ncompassion, and betrayal that lies at the very heart of his work.\n","torrent":{"xt":"urn:btih:9e85f7953b93734963594f98e6c0267ebcfb668f","amp;dn":"Graham+Greene+-+The+Honorary+Consul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e85f7953b93734963594f98e6c0267ebcfb668f","infoHashBuffer":{"type":"Buffer","data":[158,133,247,149,59,147,115,73,99,89,79,152,230,192,38,126,188,251,102,143]},"announce":[],"urlList":[]}}