{"title":"Jerrod Niemann - Lover, Lover (Xvid-2nafish) 1080p","uid":5640823,"size":122442584,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9eb66b6f56d8409132ea9debc312e90467898aa9&amp;dn=Jerrod+Niemann+-+Lover%2C+Lover+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1277097678,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:20\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 4571 Kbps\nQuality Factor : 0.09 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;You Don't Treat Me No Good&quot; is the title of a song recorded by the American soul group Sonia Dada. Released in 1992, the song was a Number One hit in Australia, spending four weeks at the top of the ARIA Charts. Eighteen years later, country music singer Jerrod Niemann released a cover version under the title &quot;Lover, Lover.&quot;\n\nOn March 1, 2010, country music artist Jerrod Niemann released his cover version under the title &quot;Lover, Lover.&quot; The song is Niemann's first release on the Sea Gayle label, a sister label of Arista Nashville, as well as his fourth single release overall.\n\nNiemann's recording of the song features nine vocal tracks, all of which he recorded himself and then overdubbed. He recorded eight of the vocal tracks in one day and, after &quot;medicating&quot; his vocal cords, he recorded the bass backing vocals the next day.\n\nWriting for the CMT blog, Whitney Self said that Niemann &quot;gives the tune a new feel with his contagious beats and acoustic guitar.&quot; Bobby Peacock of Roughstock called it &quot;soulful, catchy and distinctive,&quot; giving it a four-star rating out of five.\n\n&quot;Lover, Lover&quot; debuted at #52 on the Billboard Hot Country Songs charts dated for the week ending March 6, 2010. It entered the Top 40 at #37 on the chart dated for the week ending March 27.\n\nJerrod Lee Niemann (born in Harper, Kansas) is an American country music artist. Active since 2001, he has recorded two independent albums. In 2006, he signed to Category 5 Records and charted with the single &quot;I Love Women (My Momma Can't Stand).&quot; He has also co-written three singles for Garth Brooks: the Chris LeDoux tribute &quot;Good Ride Cowboy&quot;, as well as &quot;That Girl Is a Cowboy&quot; and &quot;Midnight Sun&quot;. &quot;Good Ride Cowboy&quot; also earned Niemann a Broadcast Music Incorporated award for being one of the most played country songs of 2005. Jamey Johnson, Neal McCoy, Julie Roberts, Flynnville Train and Zona Jones have also recorded Niemann's songs.\n\nIn early 2010, Niemann signed to Arista Nashville's Sea Gayle division and released the single &quot;Lover, Lover,&quot; which became his first Top 10 country hit in June 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9eb66b6f56d8409132ea9debc312e90467898aa9","amp;dn":"Jerrod+Niemann+-+Lover%2C+Lover+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eb66b6f56d8409132ea9debc312e90467898aa9","infoHashBuffer":{"type":"Buffer","data":[158,182,107,111,86,216,64,145,50,234,157,235,195,18,233,4,103,137,138,169]},"announce":[],"urlList":[]}}