{"title":"Redis Essentials (DjShay12).pdf","uid":12427637,"size":13648758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f1165b19c4c6fb7cd5c810c0070b8f4108a7e4a&amp;dn=Redis+Essentials+%28DjShay12%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djshay12","files":1,"time":1442408633,"description":"ISBN:\t978-1-78439-245-1\nYear:\t2015\nPages:\t230\nLanguage:\tEnglish\nFile size:\t13.5 MB\nFile format:\tPDF\n\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n\nRedis is the most popular in-memory key-value data store. It's very lightweight and its data types give it an edge over the other competitors. If you need an in-memory database or a high-performance cache system that is simple to use and highly scalable, Redis is what you need.\n\nRedis Essentials is a fast-paced guide that teaches the fundamentals on data types, explains how to manage data through commands, and shares experiences from big players in the industry.\n\nWe start off by explaining the basics of Redis followed by the various data types such as Strings, hashes, lists, and more. Next, Common pitfalls for various scenarios are described, followed by solutions to ensure you do not fall into common traps.\n\nAfter this, major differences between client implementations in PHP, Python, and Ruby are presented. Next, you will learn how to extend Redis with Lua, get to know security techniques such as basic authorization, firewall rules, and SSL encryption, and discover how to use Twemproxy, Redis Sentinel, and Redis Cluster to scale infrastructures horizontally. At the end of this book, you will be able to utilize all the essential features of Redis to optimize your project's performance","torrent":{"xt":"urn:btih:9f1165b19c4c6fb7cd5c810c0070b8f4108a7e4a","amp;dn":"Redis+Essentials+%28DjShay12%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f1165b19c4c6fb7cd5c810c0070b8f4108a7e4a","infoHashBuffer":{"type":"Buffer","data":[159,17,101,177,156,76,111,183,205,92,129,12,0,112,184,244,16,138,126,74]},"announce":[],"urlList":[]}}