{"title":"Radiohead Ok Computer [FLAC][AUDiNT]","uid":6537327,"size":720147153,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9f9113eaaee0158ab61f2c644f1c766b3a565792&amp;dn=Radiohead+Ok+Computer+%5BFLAC%5D%5BAUDiNT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":12,"time":1310558219,"description":"OK Computer is the third studio album by the English alternative rock band Radiohead, released on 16 June 1997 on Parlophone. Radiohead recorded the album in rural Oxfordshire and Bath, during 1996 and early 1997, with producer Nigel Godrich. OK Computer's expansive sound and wide range of influences set it apart from many of the Britpop and alternative rock bands popular at the time and laid the groundwork for Radiohead's later, more experimental work. While the members of Radiohead do not consider OK Computer to be a concept album, its lyrics and visual artwork emphasise common themes such as consumerism, social disconnection, political stagnation and modern malaise.\nOK Computer reached number-one on the UK Albums Chart and marked Radiohead's highest entry into the American market at the time, debuting at number 21 on the Billboard 200. The album expanded the band's worldwide popularity, and has been certified triple platinum in the UK and Canada, double platinum in the US and platinum in Australia. OK Computer received considerable acclaim at the time of its release, and it is frequently cited by critics as one of the greatest albums ever recorded.\n[AUDiNT]","torrent":{"xt":"urn:btih:9f9113eaaee0158ab61f2c644f1c766b3a565792","amp;dn":"Radiohead+Ok+Computer+%5BFLAC%5D%5BAUDiNT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f9113eaaee0158ab61f2c644f1c766b3a565792","infoHashBuffer":{"type":"Buffer","data":[159,145,19,234,174,224,21,138,182,31,44,100,79,28,118,107,58,86,87,146]},"announce":[],"urlList":[]}}