{"title":"Rigmar Radio Karaoke Collection 29600","uid":13225330,"size":1770472844,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9faf1e314c1a0683f45d1b54c6464503c094eea0&amp;dn=Rigmar+Radio+Karaoke+Collection+29600&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rigmar_radio","files":600,"time":1452854478,"description":"300 More CDG+MP3 Karaoke classics from the Rigmar Radio collection ready for import into the PC or MAC playout software of your choice.  The files have been re named and tagged following industry guidelines for Music files in the format:\r\n\r\nArtist Name - Song Title [Any additional Information]\r\n\r\nand this year for the very first time I have gone back to the original source discs and re ripped any additional copies so as to give your singers multiple karaoke label choice on some of the more popular songs.\r\n\r\nThis collection is a living thing and of course continues to evolve over time and that is why I put this up once a year.  I have just finished the letter L and started on the letter M.  More errors and duplications may be expected on the letters after that which also may not have multi label choice as yet as ripping Karaoke discs again is a very time consuming and rather boring task!\r\n\r\nI have re ripped a lot of the older stuff at 128 kbps audio due to the scratched condition of the source discs after years on the road.  In some cases I have not been able to recover the original material as the discs were simply too damaged for re use.\r\n\r\nLike the vast majority of users these days, I no longer use physical media at bookings and gigs.  Everything now is on hard drives, where the original manufacturer's methods of file naming make no sense what so ever.\r\n\r\nRigmar Radio - Rockin' the Free World since 1967","torrent":{"xt":"urn:btih:9faf1e314c1a0683f45d1b54c6464503c094eea0","amp;dn":"Rigmar+Radio+Karaoke+Collection+29600","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9faf1e314c1a0683f45d1b54c6464503c094eea0","infoHashBuffer":{"type":"Buffer","data":[159,175,30,49,76,26,6,131,244,93,27,84,198,70,69,3,192,148,238,160]},"announce":[],"urlList":[]}}