{"title":"[NubileFilms] Mindy (Seductive / 03.05.2015)","uid":11737457,"size":107716626,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a0c2cecc662cc7175b460200c168256f3b9507a3&amp;dn=%5BNubileFilms%5D+Mindy+%28Seductive+%2F+03.05.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1425614023,"description":"[NubileFilms] Mindy (Seductive / 03.05.2015)\n\nPetite hottie Mindy lays naked in the sauna enjoying the warmth that seeps into her skin, but when she spies Jason X cleaning up in the bathroom the raven-haired seductress decides that she wants something even hotter than the steamy room. Grabbing her towel, Mindy steps out of the sauna and proceeds with her plan to get exactly what she wants.\n\nDropping to her knees in front of her lover, Mindy pulls Jason's dick from his briefs and smiles as his cock springs free for her pleasure. She can't wait another moment to take Jason's cock in her mouth and suck him in until she is deep throating his long penis like a champ.\n\nThe couple relocates to the living room where Jason leans against a convenient Jacuzzi and then pulls Mindy back until she is fully impaled on his erection. With Mindy's back to him Jason can easily reach around to caress her full breasts while Mindy enjoys thrusting her hips in an erotic slow rhythm. Even when she turns around to latch her mouth onto Jason's, she still maintains that slow steady pace that they are both deeply enjoying.\n\nGradually Jason starts to take control of the lovemaking session. At first it's the push of his cock while Mindy is still pumping her hips, but soon he switches places with Mindy so that he can press her against the edge of the Jacuzzi and rub her tender clit while continuing the gentle lovemaking that Mindy started.\n\nBy the time Mindy ends up on her back on the edge of the Jacuzzi with Jason's cock sunk deep in her fuck hole, things are starting to get more out of control. Jason's strokes are longer and deeper, sinking balls-deep into the warmth of Mindy's snatch even as he picks up the pace for their pleasure. The rougher he gets, the louder Mindy's moans get until her whole body is thrumming with ecstasy.\n\nKnowing that her lover is getting close, Mindy gets down on her knees and pumps him with her hands while working the head of his dick with her magical mouth. Her efforts are soon rewarded by a mouth full of cum that dribbles down her chin and onto her ample boobs.\n\nThe insatiable babe finds that she's still too turned on to stop, so she pulls Jason over to the couch to get his help with one last climax. Between her fingers on her clit and Jason's wonderful pussy fingering, Mindy quickly reaches the final release that she craves so that she can end her sexual romp with a big smile.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=sjugj3fd6wo9axz05a2a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=sjugj3fd6wo9axz05a2a.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=0yb1l3t09ubacahifcgk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=0yb1l3t09ubacahifcgk.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a0c2cecc662cc7175b460200c168256f3b9507a3","amp;dn":"%5BNubileFilms%5D+Mindy+%28Seductive+%2F+03.05.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0c2cecc662cc7175b460200c168256f3b9507a3","infoHashBuffer":{"type":"Buffer","data":[160,194,206,204,102,44,199,23,91,70,2,0,193,104,37,111,59,149,7,163]},"announce":[],"urlList":[]}}