{"title":"The Lineup:  - Otto Penzler","uid":9290100,"size":377130,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1c7e7576e6bf3380d13d757191099323a4a9ec1&amp;dn=The+Lineup%3A++-+Otto+Penzler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1386030088,"description":"A great recurring character in a fictional series you love becomes an old friend. You learn about their strange quirks and their haunted pasts and root for them every time they face danger. But where do some of the most fascinating sleuths in the mystery and thriller world really come from?\n\nWhat was the real-life location that inspired Michael Connelly to make Harry Bosch a Vietnam vet tunnel rat? Why is Jack Reacher a drifter? How did a brief encounter in Botswana inspire Alexander McCall Smith to create Precious Ramotswe?\n\nIn THE LINEUP, some of the top mystery writers in the world tell about the genesis of their most beloved characters--or, in some cases, let their creations do the talking.\n\n&quot;The best book of its kind.... An exciting omnibus volume that has widespread appeal and adds up to much, much more than the sum of its parts....delivering memorable revelations about the mystery genre and its different incarnations....Candor is no small part of this collection's great value. Time and again these crime writers return to the same questions: Is your character like you? Where did the character's name come from? How did you get published? The answers are always interesting.&quot; (New York Times Janet Maslin)\n\n&quot;This book will delight any mystery lover....[and] make readers return to favorite books with a fresh eye.&quot; (Cleveland Plain Dealer Michele Ross)\n\n&quot;The natural bridge between authorial intention and reader demand. After all, who are more equipped to discourse on the origins, the motivations, the foibles, and the triumphs of their life's work than some of the best-known and most successful mystery and thriller writers on the planet?&quot; (Los Angeles Times Sarah Weinman)\n\n&quot;The ultimate How-dunit.&quot; (The New York Times Janet Maslin)\n\n&quot;Tremendous fun--clever, wide-ranging, revealing, even surprising. Bet you can't read just one.&quot; (Raleigh News and Observer)\n\n&quot;Fiery....The authors take different approaches, but all offer an opportunity to see a familiar character in a new way....It's also a great way to get a taste of some of the series you haven't read yet.&quot; (NPR.org Maureen Corrigan)\n\nAbout the Author\nOtto Penzler is the proprietor of The Mysterious Bookshop in New York City, the editor of many mystery anthologies, and co-author of The Encyclopedia of Mystery and Detection, for which he won an Edgar Award. He lives in New York.","torrent":{"xt":"urn:btih:a1c7e7576e6bf3380d13d757191099323a4a9ec1","amp;dn":"The+Lineup%3A++-+Otto+Penzler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1c7e7576e6bf3380d13d757191099323a4a9ec1","infoHashBuffer":{"type":"Buffer","data":[161,199,231,87,110,107,243,56,13,19,215,87,25,16,153,50,58,74,158,193]},"announce":[],"urlList":[]}}