{"title":"Talk Less, Say More 2009","uid":6059121,"size":12147246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1feaf6c40df200306887ae4f8d73e1d92143536&amp;dn=Talk+Less%2C+Say+More+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manhide","files":2,"time":1293039045,"description":"Talk Less, Say More: Three Habits to Influence Others and Make Things Happen\n\nWiley\n\nCONNIE DIEKEN\n\n2009\n\nISBN: 0470500867\n\n176 pages\n\nPDF\n\nEnglish\n\n11.5 MB\n\n\nTalk Less, Say More is a revolutionary guide to 21st century communication skills to help you be more influential and make things happen in our distracted, attention-deficit world. It's loaded with specific tips and takeaways to ensure that you're fully heard, clearly understood, and trigger positive responses in any business or social situation.\n\nIt's the first book to deliver a proven method to master the core leadership skill of influence. Talk Less, Say More lays out a powerful 3-step method called Connect, Convey, Convince (R) and guides you in how to use these habits to be more influential. This succinct book solves your modern communication issues in today's demanding, distracted world at a time when interaction skills are plummeting.\n\nCommunication is the single greatest challenge in business today. It takes just 3 habits to conquer it. Talk Less, Say More will help you achieve more with less. Less wordiness. Less tune-out. Less frustration. You'll gain more time. More positive outcomes. More rewarding relationships............\t\t","torrent":{"xt":"urn:btih:a1feaf6c40df200306887ae4f8d73e1d92143536","amp;dn":"Talk+Less%2C+Say+More+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1feaf6c40df200306887ae4f8d73e1d92143536","infoHashBuffer":{"type":"Buffer","data":[161,254,175,108,64,223,32,3,6,136,122,228,248,215,62,29,146,20,53,54]},"announce":[],"urlList":[]}}