{"title":"Deserts and Life 4of5 The Judean Desert PDTV x264 AAC ","uid":8886135,"size":730431503,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a286c3502b72dc94354cbce9805f30f188837e8a&amp;dn=Deserts+and+Life+4of5+The+Judean+Desert+PDTV+x264+AAC+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":-1,"time":1378466475,"description":"Deserts and Life\n\nNature, Travel Documentary hosted by Mark Strong, published by UKTV in 2013 - English narration\n\n\nInformation\n------------------------------\n\nDeserts and Life\nDeserts are the most haunting of all the Earth's landscapes. Sometimes we think of them as vast empty spaces that dwarf and test our human spirit, but that view couldn't be farther from the truth. In reality, deserts are full of colour and contrast - there are mountains and lagoons among the dunes and plains, and they often teem with life and are rich in resources. Their peoples have remarkable qualities of ingenuity and endurance, wisdom and humour; their festivals and gatherings full of colour and energy. This new and exclusive six-part series looks at how these desert realities are at odds with our perceptions, and takes a closer look at the disparate life that exists in the emptiness. By visiting places like the Atacama Desert - which spans Chile and Peru - and boasts white salt basins, emerald-coloured lagoons, lava flows and blue, red and purple mountains, Deserts And Life helps to re-inform our knowledge about these enormous diverse stretches of land.\nDue to a Thunder Storm and Power Surge i missed the 1st episode (The Thar Desert) of this series , but the good news is that it will be repeated on October 11th, so i will upload it then\n\n\n1)  Atacama Desert \nThe Atacama Desert of northern Chile is the world's second driest region (icy Antarctica is first). Although the Tropic of Capricorn passes through the region, the Atacama Desert lies in the rain shadow of Chile's Coast Range, which squeezes out the moisture from the atmosphere. The desert is completely barren and while most areas only receive moisture from an occasional fog or a shower every few decades, the rain gauge at Calama has never recorded any measurable precipitation. The Atacama is a high (most elevations are over 8000 feet) and cold desert, average temperatures range from 0Â° to 25Â° Celsius (32Â° to 75Â° F).\n\n2)  Australian Outback \nVast swathes of Australia hold sandy deserts, where aboriginal people have found ways to survive. Find out more about the Australian outback - a place where plains stretch to eternity and people can yarn forever. It's called a sunburnt country, but even in the scorched desert you'll find purple vegetation and lush green waterholes. You'll also find red hills and fiery sunsets, dinosaur footprints and Aboriginal carvings, colourful characters. Here in the wide, open spaces, a new adventure awaits you at every turn.\n\n3)  Gobi Desert \nThe Gobi Desert is the largest desert region located in Asia, spanning the north / north-western part of China and the south of Mongolia. The desert is surrounded by the Altai Mountains and the grasslands of Mongolia. It is the fifth largest desert in the world. The temperatures in the Gobi Desert fluctuate rapidly. It can go from being 25 degrees F to -30 degrees F within a few days. The temperatures can go as high as 122 degrees F and as low as -40 degrees F.\nOver 45 different species of animals and birds live in the Gobi desert, including: golden eagles, snow leopards, camels, bears and gazelles. The first dinosaur eggs to be discovered were found in the Gobi Desert.\nThe Gobi desert is growing by more than 1300 square miles every year, expanding into the southern grasslands of China. This process of desertification has worried the Chinese government and they are planting new forests to try and halt the spread of the Gobi. The forest barrier is sometimes called the Green Wall of China.\n\n4)  Judean Desert \nBecause of its lack of water and good routes, the Judean wilderness has been (mostly) uninhabited throughout history. The Judean Desert is bordered by the Mountains of Judea to the west and by the Dead Sea to the East. It is considered a relatively small desert, spanning only 1,500 square kilometers. Mountains, cliffs, and chalk hills stand alongside plateaus, riverbeds, and deep canyons. The width and breadth of the desert is crossed by several rivers that have created canyons up to 500 meters deep. The desert is known for its rugged landscape, which has provided a refuge and hiding place for rebels throughout history, as well as solitude and isolation to monks and hermits\n\n5)  Namib Desert \nThe Namib Desert is often referred to as the world's oldest desert and has been in existence for some 43 million years, remaining unchanged in its present form for the last 2 million years. The Namib is an immense expanse of relentlessly moving gravel plains and dunes of all shapes and sizes that stretch along the entire coastline. The most widespread and dominant type of desert sand dune are linear dunes, with crescent shaped dunes common along the coast and clusters of star dunes, such as the towering horseshoe of dunes at Sossusvlei, found in the eastern reaches of the sand sea. In spite of its harsh, dry landscape, this unfriendly habitat is teeming with wildlife including rhinos and elephants (which have specially adapted to life here), lions, gemsbok, hartemans zebra and black-faced impala. Around 3,500 species of plants are also found here. Although living conditions in this environment are tough, over 80,000 people made up of different ethnic groups live in the Kunene region alone. Most make a living through livestock farming (cattle, goats and sheep) and many live a nomadic lifestyle which means they travel from place to place.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img689.imageshack.us/img689/2130/w26f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img689.imageshack.us/img689/2130/w26f.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img32.imageshack.us/img32/5002/ahrv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img32.imageshack.us/img32/5002/ahrv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img27.imageshack.us/img27/595/h3j5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img27.imageshack.us/img27/595/h3j5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img809.imageshack.us/img809/7890/1fst.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img809.imageshack.us/img809/7890/1fst.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/9819/dp76.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/9819/dp76.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img818.imageshack.us/img818/3016/i0z9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img818.imageshack.us/img818/3016/i0z9.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img690.imageshack.us/img690/8281/8gnt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img690.imageshack.us/img690/8281/8gnt.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img12.imageshack.us/img12/4285/e4je.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img12.imageshack.us/img12/4285/e4je.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img541.imageshack.us/img541/5017/g8s6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img541.imageshack.us/img541/5017/g8s6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img571.imageshack.us/img571/1906/h1jo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img571.imageshack.us/img571/1906/h1jo.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img20.imageshack.us/img20/1049/tbrh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img20.imageshack.us/img20/1049/tbrh.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img826.imageshack.us/img826/4130/cfy9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img826.imageshack.us/img826/4130/cfy9.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5b13323c331b1768756b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 2142 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 45mins\n * Framerate: 25fps\n * Number of Parts: 5\n * Part Size: 689 MB\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://eden.uktv.co.uk/deserts-and-life/article/about-deserts-and-life/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://eden.uktv.co.uk/deserts-and-life/article/about-deserts-and-life/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a286c3502b72dc94354cbce9805f30f188837e8a","amp;dn":"Deserts+and+Life+4of5+The+Judean+Desert+PDTV+x264+AAC+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a286c3502b72dc94354cbce9805f30f188837e8a","infoHashBuffer":{"type":"Buffer","data":[162,134,195,80,43,114,220,148,53,76,188,233,128,95,48,241,136,131,126,138]},"announce":[],"urlList":[]}}