{"title":"Agassiz-Gists from Agassiz(intelligent design instead of evoluti","uid":4457070,"size":410905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3050634a0d3ea1348a2369bb7315b3a9a9fe694&amp;dn=Agassiz-Gists+from+Agassiz%28intelligent+design+instead+of+evoluti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1224530978,"description":"This is Louis Agassiz&amp;#039;s classic book Gists from Agassiz - Passages on the Intelligence Working in Nature - Together with Agassiz&amp;#039;s Essay on Evolution and Permanence of Type (1973) which presents the main theses of this great American naturalist who had far-reaching influence on  scientific education as a whole. One of the great scientists of his day and one of the &quot;founding fathers&quot; of the modern American scientific tradition, Louis Agassiz remains something of a historical enigma. A great systematist and paleontologist, a renowned teacher and tireless promoter of science in America, he was also a lifelong opponent of Darwin&amp;#039;s theory of evolution. Yet even his most critical attacks on evolution have provided evolutionary biologists with insights. Agassiz believed in catastrophism theory - that the Earth had been periodically wracked by global catastrophes, after each of which new species of animals and plants had appeared. The theory suggested that the so called Biblical Flood was the last catastrophe. Agassiz replaced the Flood with fast-forming glaciers, which he thought had been formed instantaneously all over the world. His works on living and fossil fish and on glaciers have remained classics. Especially the work on glaciers revolutionized geology and drove another nail in the coffin of the Biblical Flood as a serious scientific hypothesis. He left a mark on the development and the practice of American science and brought science to &quot;the man in the street&quot; as no one else had before. People from all over the world read his books, sent him specimens and asked his advice. By the time of his death, on December 14, 1873, he was publicly recognized as America&amp;#039;s leading scientist. 115 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:a3050634a0d3ea1348a2369bb7315b3a9a9fe694","amp;dn":"Agassiz-Gists+from+Agassiz%28intelligent+design+instead+of+evoluti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3050634a0d3ea1348a2369bb7315b3a9a9fe694","infoHashBuffer":{"type":"Buffer","data":[163,5,6,52,160,211,234,19,72,162,54,155,183,49,91,58,154,159,230,148]},"announce":[],"urlList":[]}}