{"title":"Bruce Barnbaum - The Art of Photography, An Approach to Personal","uid":6665840,"size":14833897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a38713be39733b4b3d9a322dc02420a377ede47e&amp;dn=Bruce+Barnbaum+-+The+Art+of+Photography%2C+An+Approach+to+Personal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"12uel","files":1,"time":1315678084,"description":"This is an updated and newly revised edition of the classic book The Art of Photography (originally published in 1994), which has often been described as the most readable, understandable, and complete textbook on photography. With well over 100 beautiful photographic illustrations in both black-and-white and color, as well as numerous charts, graphs, and tables, this book presents the world of photography to beginner, intermediate, and advanced photographers seeking to make a personal statement through the medium of photography. Without talking down to anyone, or talking over anyone's head, Barnbaum presents &quot;how to&quot; techniques for both traditional and digital approaches. Yet he goes well beyond the technical, as he delves deeply into the philosophical, expressive, and creative aspects of photography so often avoided in other books.\n\nBruce Barnbaum is recognized as one of the world's finest landscape and architectural photographers, and for decades has been considered one of the best instructors in the field of photography. This latest incarnation of his textbook, which has evolved, grown, and been refined over the past 35 years, will prove to be an ongoing, invaluable photographic reference for years to come. It is truly the resource of choice for the thinking photographer.\n\nTitle:    The Art of Photography \nBy:    Bruce Barnbaum \nPublisher:    Rocky Nook \nFormats:      Print\n              Ebook\n              Safari Books Online\n\nPrint:    November 2010 \nEbook:    July 2011","torrent":{"xt":"urn:btih:a38713be39733b4b3d9a322dc02420a377ede47e","amp;dn":"Bruce+Barnbaum+-+The+Art+of+Photography%2C+An+Approach+to+Personal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a38713be39733b4b3d9a322dc02420a377ede47e","infoHashBuffer":{"type":"Buffer","data":[163,135,19,190,57,115,59,75,61,154,50,45,192,36,32,163,119,237,228,126]},"announce":[],"urlList":[]}}