{"title":"Asian Pickles India+China Recipes for Indian &amp; Chinese Sweet","uid":9479793,"size":8918541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a577c86423f7f5fdb727ae3d4c7ce54f830986ec&amp;dn=Asian+Pickles+India%2BChina+Recipes+for+Indian+%26amp%3B+Chinese+Sweet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"KhushSidhu","files":2,"time":1389769109,"description":"\n\nAsian Pickles: India: Recipes for Indian Sweet, Sour, Salty, and Cured Pickles and Chutneys\n\nBy Karen Solomon\n\nPrint Length: 61 pages - Publisher: Ten Speed Press \n(December 17, 2013) - Language: English\nASIN: B00CQZ6F88\n\nA DIY guide to making the tangy pickles of India, featuring recipes ranging from traditional chutney and achar to new combinations using innovative ingredients and techniques.\n \nFor Asian food aficionados as well as preservers and picklers looking for new frontiers, India's diverse and sometimes spicy array of pickled products and innovative flavor pairings will wow the palate. In Asian Pickles: India, respected cookbook author and culinary project maven Karen Solomon introduces readers to the unique ingredients used in Indian pickle-making, and numerous techniques beyond the basic brine. For the novice pickler, Solomon also includes a vast array of quick pickles with easy-to-find ingredients. Featuring 15 of the most sought-after Indian pickle recipes--including Coconut-Mint Chutney, Sour Mango Pickle, Cauliflower Pickle, and more--Asian Pickles: India will help you explore a new preserving horizon with fail-proof instructions and a selection of helpful resources.\n\n-----------------------------\n\n\nAsian Pickles: China: Recipes for Chinese Sweet, Sour, Salty, Cured, and Fermented Pickles and Condiments\n\nBy Karen Solomon\n\nPrint Length: 65 pages - Publisher: Ten Speed Press \n(August 27, 2013) - Language: English\nASIN: B00B3GNRMS\n\nA DIY guide to making the salty, sweet, and pungent pickles of China, featuring 15 recipes with innovative ingredients and new techniques.\n\nCooks are looking for new pickling frontiers, and the natural standout is Asia, with its diverse array of pickled products and flavors that wow the palate. Asian Pickles: China introduces techniques for creating authentic and creative Chinese pickled foods such as Preserved Mustard Greens, Radish in Chile Oil, Sour Celery and Red Pepper, and Szechuan Cucumbers with Orange and Almond. This title also includes some essential condiments that elevate Chinese food at home, such as XO Sauce and fire-spiked Chile Oil. The Asian Pickles series targets the eager audience of DIY food enthusiasts, backyard farmers, armchair foragers, and pickle fans who have cut their teeth on putting food into jars, pantries, and freezers and who are now hungry for the next course of culinary challenges and kitchen inspiration.","torrent":{"xt":"urn:btih:a577c86423f7f5fdb727ae3d4c7ce54f830986ec","amp;dn":"Asian+Pickles+India%2BChina+Recipes+for+Indian+%26amp%3B+Chinese+Sweet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a577c86423f7f5fdb727ae3d4c7ce54f830986ec","infoHashBuffer":{"type":"Buffer","data":[165,119,200,100,35,247,245,253,183,39,174,61,76,124,229,79,131,9,134,236]},"announce":[],"urlList":[]}}