{"title":"Chiaroscuro The Private Lives of Leonardo da Vinci ","uid":7660143,"size":298449628,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a61a54f9d6c399aa452dd49eb9989745fb2f4075&amp;dn=Chiaroscuro+The+Private+Lives+of+Leonardo+da+Vinci+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1348278568,"description":"(Restored) (Vertigo)\n\nIssues 1-10 of 'Chiaroscuro - The Private Lives of Leonardo da Vinci'\n\nVertigo/DC Comics, 1995-1996\n\nWriter - Pat McGreal and David Rawson\n\nPenciller - Chaz Truog\n\nInker - Rafael Kayanan\n\nColorists - Carla Feeny and Lovern Kindziersky\n\nChiaroscuro: The Private Lives of Leonardo da Vinci is a Vertigo comic book limited series published from 1995 to 1996, which was later repackaged in 2005 as a single volume. The series was written by Pat McGreal and David Rawson and illustrated by Chaz Truog and Rafael Kayanan. The original series covers were done by Stephen John Philips and Richard Bruning.\n\nA work of historical fiction, Chiaroscuro narrates the life of Leonardo da Vinci from the point of view of Gian Giacomo Caprotti da Oreno (almost exclusively called Salai in the story), a beautiful young man Leonardo adopted as a boy. It shows the influence of their relationship on Leonardo's life and work. In characterizing Salai as scheming, ambitious and selfish, the novel posits that several events in Leonardos's life occurred at least partly because of his manipulations.\n\nThe work also speculates a possible homosexual relationship between Leonardo and Salai. Salai is clearly depicted to have had homosexual relations with Leonardo's main rival, Michelangelo and Ludovico Sforza's captain, Sanseverino, while anything occurring between him and Leonardo is simply implied. It is clear, however, that Leonardo used him as a model for his artwork. The relationship between Salai and Leonardo is often tumultuous, culminating with Salai betraying Leonardo by serving as the model for Michelangelo's David.\n\nChiaroscuro is an art term meaning the play of light and dark in a work.","torrent":{"xt":"urn:btih:a61a54f9d6c399aa452dd49eb9989745fb2f4075","amp;dn":"Chiaroscuro+The+Private+Lives+of+Leonardo+da+Vinci+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a61a54f9d6c399aa452dd49eb9989745fb2f4075","infoHashBuffer":{"type":"Buffer","data":[166,26,84,249,214,195,153,170,69,45,212,158,185,152,151,69,251,47,64,117]},"announce":[],"urlList":[]}}