{"title":"Methodik klinischer Studien","uid":6512499,"size":2173442,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a61db21d6105b21756108545bfbc73deee930838&amp;dn=Methodik+klinischer+Studien&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309691481,"description":"Martin Schumacher und Gabi Schulgen, \\&quot;Methodik klinischer Studien: Methodische Grundlagen der Planung, DurchfÃƒÂ¼hrung und Auswertung\\&quot; \n Sp ng er | Pages:436 | 2008-10-01 | ISBN: 3540851356 | PDF | 3,7 MB \n\n Dieses Buch bietet eine praxisorientierte EinfÃƒÂ¼hrung in die methodischen Grundlagen klinischer Studien in der wissenschaftlichen Forschung und der pharmazeutischen Industrie. Die grundlegenden Prinzipien der Planung und DurchfÃƒÂ¼hrung klinischer Studien sowie die wichtigsten statistischen Verfahren fÃƒÂ¼r deren Auswertung werden in verstÃƒÂ¤ndlicher Weise dargestellt und erklÃƒÂ¤rt. Neben der Methodik fÃƒÂ¼r Therapiestudien behandeln die Autoren auch die speziellen Verfahren in Diagnose- und Prognosestudien.\n\n Anhand von Beispielen konkreter Studien vorwiegend aus ihrem eigenen Arbeitsumfeld illustrieren die Autoren anschaulich die Prinzipien und Methoden und zeigen exemplarisch die in der Praxis auftretenden Probleme. DarÃƒÂ¼ber hinaus diskutieren sie historische Entwicklungen sowie die international geltenden Standards fÃƒÂ¼r die QualitÃƒÂ¤t klinischer Studien.\n\n Das Buch richtet sich an alle, die klinische Studien planen, durchfÃƒÂ¼hren und statistisch auswerten oder die Ergebnisse von klinischen Studien interpretieren und bewerten. In diese dritte, ÃƒÂ¼berarbeitete Auflage wurden aktuelle Hinweise auf neue Entwicklungen aufgenommen.","torrent":{"xt":"urn:btih:a61db21d6105b21756108545bfbc73deee930838","amp;dn":"Methodik+klinischer+Studien","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a61db21d6105b21756108545bfbc73deee930838","infoHashBuffer":{"type":"Buffer","data":[166,29,178,29,97,5,178,23,86,16,133,69,191,188,115,222,238,147,8,56]},"announce":[],"urlList":[]}}