{"title":"[Coursera] Global Warming - the Science of Climate Change","uid":9766004,"size":2715407225,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a65d7f04f57928f1873d991f1d8b689979aed344&amp;dn=%5BCoursera%5D+Global+Warming+-+the+Science+of+Climate+Change&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rndNbr","files":298,"time":1394876796,"description":"GLOBAL WARMING: THE SCIENCE OF CLIMATE CHANGE\n******************************************************\nTaught by David Archer         \nBrought to You by the University of Chicago and Coursera\nCompiled by the Free Library in March 2014\n\n######################################################\n\nThank you for downloading this educational resource. If you are satisfied with it, I only ask you to seed its torrent or pass it on in some way for someone else's use.\n\nIf you have any comments, questions, or suggestions, if you would like information on other free educational resources, or if you would like to contribute, please contact me at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;81e7f3e4e4ede8e3f3e0f3f8c1e4ece0e8edafe2eeecaf&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; \n\nIf you would like to donate, support free education by donating Bitcoin to Khan Academy:\n\n16GKQH7orq6XxxTd5JYR9ar22Amcd1eHxn - (To verify this address, visit\n\nThank you.\n\nThe Free Library\n\n######################################################\n\nThis course includes the video lectures (MP4) and English subtitles (SRT). This was one of my first Coursera batch-downloads, so there may be missing subtitles. Sorry for the mess.\n\n######################################################\n\nThis class describes the science of global warming and the forecast for human's impact on Earth's climate. Intended for an audience without much scientific background but a healthy sense of curiosity, the class brings together insights and perspectives from physics, chemistry, biology, earth and atmospheric sciences, and even some economics, all based on a foundation of simple mathematics (algebra). \n\nWe start with basic principles governing Earth's temperature. The class begins with the nature of heat and light, then builds the very simplest conceptual and algebraic model for the climate of a planet, including the greenhouse effect.\n\nOver the following weeks, we introduce complexities of the real world to this model: how greenhouse gases are selective about what light they absorb, how the temperature structure and weather in the atmosphere set the stage for the greenhouse effect, and how feedbacks amplify it. From this point on the exercises will be based on on-line interactive models for various aspects of Earthis climate and carbon cycle, exploring the topics described in the video lectures. \n\nWe then turn to the carbon cycle of the Earth, how it stabilizes Earth's climate on some time scales but destabilizes it on others. The fate of fossil fuel carbon will be determined by its integration into Earth's ongoing natural carbon cycle.\n\nThe class concludes with a look at the human impact on Earth's climate: why we believe it's changing, why we believe we're changing it, the impacts that could have, and the options we have to mitigate the situation.\n\nMore information about this course available at https://www.coursera.org/course/globalwarming","torrent":{"xt":"urn:btih:a65d7f04f57928f1873d991f1d8b689979aed344","amp;dn":"%5BCoursera%5D+Global+Warming+-+the+Science+of+Climate+Change","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65d7f04f57928f1873d991f1d8b689979aed344","infoHashBuffer":{"type":"Buffer","data":[166,93,127,4,245,121,40,241,135,61,153,31,29,139,104,153,121,174,211,68]},"announce":[],"urlList":[]}}