{"title":"Democracy Now - 21 dec 2011","uid":6903921,"size":454732107,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a765d94beafa95d05b928d1eac63caac90a651b0&amp;dn=Democracy+Now+-+21+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1324505975,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 21, 2011\n\n- Military Rests Case in Bradley Manning Hearing\n- U.S. Commander in Afghanistan Suggests Extended Occupation Beyond 2014\n- Top U.S. General Returns from Iraq\n- Syrian Opposition Demands Action as Toll Mounts\n- Egyptian Women Protest Military Attacks\n- House Republicans Reject Senate Tax Cut Deal\n- Boston Resident Convicted of Aiding Al-Qaeda for Online Postings\n- U.S. Nuclear Safety Chief Visits Fukushima Plant\n- U.N. Security Council Members Criticize U.S. on Israeli Settlements\n\n\nSpecial reports\n\n- Bradley Manning's Defense Strategy on Display as Military Prosecutors Rest Case in Pretrial Hearing\n\nThe pretrial military hearing for accused Army whistleblower Private Bradley Manning has entered its sixth day. Prosecutors have finished laying out their case, and today the defense witnesses are expected to testify. Manning has been imprisoned for the past 19 months for allegedly leaking classified videos and diplomatic U.S. cables to the website WikiLeaks. On Monday, military prosecutors claimed they had discovered what they believe is email correspondence between Manning and WikiLeaks founder, Julian Assange. If convicted, Manning could face life in prison, possibly death. We get an update from Ed Pilkington, a correspondent for The Guardian, which has been blogging about the hearing since it began last Friday. &quot;[The defense is] claiming ... that Manning has not been given the right to a fair pretrial hearing, because we think they're only likely to be able to call three witnesses. Now that's in addition to 10 witnesses they shared with the prosecution, but it's still a tiny number compared with the total of 48 that Manning's lawyer, David Coombs, asked for,&quot; Pilkington says. &quot;And if, by contrast, the defense is only allowed to call three of its own witnesses, that looks pretty unequal to me.&quot;\n\n\n- Iraq Combat Veteran Dan Choi Forcibly Ousted, Barred from Bradley Manning Hearing at Ft. Meade\n\nFormer U.S. Army Lt. Dan Choi attended the pretrial military hearing for accused Army whistleblower Private Bradley Manning this weekend but was barred from returning on Monday. Military security handcuffed Choi, pinned him to the ground and ripped off his rank. The military says Choi was heckling, but Choi maintains he never disrupted the proceedings. He is an Iraq War combat veteran, supporter of Manning, and an openly gay servicemember who was discharged in 2010 under the &quot;Don't Ask, Don't Tell&quot; policy. &quot;What Bradley Manning did, as a gay American, as a soldier, a good soldier-in fact, the only soldier in his entire chain of command who did the right thing, and suffers the consequences unjustly-there's no choice but for patriotic Americans to sit there and support Bradley Manning in the dignity and full honor of the uniform of service,&quot; Choi says.\n\n\n- In Exiting Iraq, U.S. Military Discards Trove of Found Documents on 2005 Haditha Massacre of Iraqis\n\nAs the U.S. military leaves Iraq, the New York Times has recovered hundreds of pages of documents detailing internal interrogations of U.S. Marines over the 2005 Haditha massacre of Iraqi civilians. The documents, many marked &quot;secret,&quot; were found among scores of other classified material at a junkyard outside Baghdad as an attendant used them as fuel to cook his dinner. The documents reveal testimony of Marines describing killing civilians on a regular basis. &quot;In some ways, this is one of the most grotesque episodes of the entire war in Iraq. And I'm afraid to say, this is part of our legacy,&quot; says Time magazine contributor Tim McGirk, who first broke the story of Haditha in 2006. It was November 19, 2005, when a U.S. military convoy of four vehicles driving through Haditha was hit by a roadside bomb, killing Lance Corporal Miguel Terrazas. The next night, Marines burst into several homes in the neighborhood, killing 24 Iraqis, including a 76-year-old man and women and children who were still in their night clothes when they died. &quot;Nobody is behind bars for this,&quot; McGirk notes. Charges from the episode were dropped against six of the accused Marines, one was acquitted, and the final case is set to go to trial next year.\n\n\n- With Pre-Caucus Focus on GOP Race, Occupy Movement Steps Up Activism in Iowa\n\nThe Occupy movement is making its presence felt in Iowa ahead of the Iowa caucus, the nation's first nominating contest for the 2012 presidential elections. Demonstrators have targeted the Iowa Democratic Party headquarters and the &quot;Obama for America&quot; office in recent days, protesting measures being considered in Washington dealing with defense spending, a planned oil pipeline and jobless benefits. Next they plan to focus on Republicans who will be crisscrossing the state in the next two weeks seeking voters' support. &quot;We think that we have a right to-a constitutional right to state our purpose and to call for and to address grievances that we have with the government and the corporate control over the government,&quot; says Hugh Espey, the executive director of Iowa Citizens for Community Improvement, a 36-year-old grassroots organization with some 4,000 members. &quot;These sorts of protest are going to continue, until we have a system that puts people before profits and communities before corporations.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a765d94beafa95d05b928d1eac63caac90a651b0","amp;dn":"Democracy+Now+-+21+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a765d94beafa95d05b928d1eac63caac90a651b0","infoHashBuffer":{"type":"Buffer","data":[167,101,217,75,234,250,149,208,91,146,141,30,172,99,202,172,144,166,81,176]},"announce":[],"urlList":[]}}