{"title":"Hank Mobley - The Turnaround! (1965) [2014 _HDTracks ]","uid":11758963,"size":1493897675,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a7a4bb3f343b0a0d4091bfe2d3b658804f29beb4&amp;dn=%5CHank+Mobley+-+The+Turnaround%21+%281965%29+%5B2014+_HDTracks+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":9,"time":1426530662,"description":"Hank Mobley - The Turnaround! (1965/2014)\n FLAC (tracks) 24 bit/192 kHz | Time - 40:31 minutes | 1,46 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n The Turnaround! is jazz tenor saxophonist Hank Mobley's 1965 Blue Note release. The hard bop, soul jazz instrumentalist and composer collaborated with some of the '60s most proficient jazz musicians on this release, including Herbie Hancock, Philly Joe Jones, Paul Chambers, Freddie Hubbard and Donald Byrd, among others.\n\n\n The Hank Mobley of the Turnaround album was a markedly different one from a few years earlier. This session issued in early 1965 was the product of two different sessions. The first was in March of 1963, immediately after Mobley left the Miles Davis band. Those recordings produced &quot;East of the Village,&quot; possibly the greatest example of Mobley's &quot;round tone&quot; on record, and the other was &quot;The Good Life,&quot; a ballad. The rest was recorded nearly two years later in February of 1965. The title cut was produced here -- an Alfred Lion answer to Lee Morgan's &quot;Sidewinder,&quot; which was burning up the charts -- as well as the beautiful &quot;Pat 'n' Chat,&quot; with &quot;Straight Ahead&quot; and &quot;My Sin&quot; rounding out the program. On the earlier material, Donald Byrd, Herbie Hancock, Butch Warren, and Philly Jo Jones helped Mobley out, and on the latter it was Freddie Hubbard, Barry Harris, Paul Chambers, and Billy Higgins. In each case, there were alumnus members of the Miles band Mobley had played in. The main thing about &quot;East of the Village&quot; is the striking difference between the gorgeous melding of Latin and post-bop, straight-ahead rhythms, and the easy, loping blues feel that is cheered on by Jones. This track contains one of Mobley's most memorable solos. On the title track and &quot;Pat 'n' Chat,&quot; there are elongated blues structures; in the former -- it is an unusual 18 bar figure -- and in the latter, there is the major 44 bar pattern that sounds like a blues with a bridge when the AABA pattern is invoked. Here is the evolution of Mobley's tone in full flower, all but gone is the rounded, warm sound, and in its place is a shorter, declarative, bluesier tone with real bite that is perfect for pianists like Harris, who were used to the deeper funk of the Detroit sound. In all this is a solid date, despite its time lapse, and one that gives us a solid picture of the two Mobleys.  \n\n\nTracklist:\n\n 01 - The Turnaround!\n 02 - East Of The Village\n 03 - The Good Life\n 04 - Straight Ahead\n 05 - My Sin\n 06 - Pat 'N Chat\n\n Producer: Alfred Lion. Recording engineer: Rudy Van Gelder.\n Recorded March 7, 1963 and February 5, 1965 at Van Gelder Studio in Englewood Cliffs, NJ.\n\nMusicians:\n Hank Mobley - tenor saxophone\n Donald Byrd - trumpet\n Freddie Hubbard - trumpet\n Herbie Hancock - piano\n Barry Harris - piano\n Butch Warren - bass\n Paul Chambers - bass\n Philly Joe Jones - drums\n Billy Higgins - drums","torrent":{"xt":"urn:btih:a7a4bb3f343b0a0d4091bfe2d3b658804f29beb4","amp;dn":"%5CHank+Mobley+-+The+Turnaround%21+%281965%29+%5B2014+_HDTracks+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7a4bb3f343b0a0d4091bfe2d3b658804f29beb4","infoHashBuffer":{"type":"Buffer","data":[167,164,187,63,52,59,10,13,64,145,191,226,211,182,88,128,79,41,190,180]},"announce":[],"urlList":[]}}