{"title":"Music of Islam 15 Volume Box Set mp3","uid":4044147,"size":1621094326,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a7d91f605e4077f93c10fde75f3cd72a4fc769a2&amp;dn=Music+of+Islam+15+Volume+Box+Set+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pan216","files":236,"time":1203819395,"description":"Music of Islam 15 Volume Box Set mp3\n\nThis box set is absulotly amazing.  The recording quality is very good, and the artists are authentic.  mp3 bit rate is 192 CBR, all album art and some of the booklets are present as well.\n\nOriginal Release Date: April 14, 1998\nNumber of Discs: 17\nFormat: Box set\nNote on Boxed Sets: During shipping, discs in boxed sets occasionally become dislodged without damage. Please examine and play these discs. If you are not completely satisfied, we&amp;#039;ll refund or replace your purchase.\nLabel: Celestial Harmonies\nASIN: B000005Z42\n\nInimitable world music producer Eckart Rahn again brings listeners a collection of recordings that is as moving as it is obscure as it is technically perfect. This sampler selects from a 15-volume set documenting the state of Islamic music from Turkey south to Yemen and Morocco east to Indonesia. The sampler is available for sale, separate from the perhaps imposing set. Detailed documentation discusses Islamic music cursorily and technically. Instrumentation, the role of religion in the music, and Islam and its history are also covered. Unfortunately, there is not much track-by-track text other than the source of each cut. The sampler begins very strongly, with an unaccompanied feat of vocal acrobatics in a Koran recitation recorded in Istanbul, followed by a rich arrangement of Iranian strings and percussion. From Marrakesh, Morocco, comes a sonorous example of deep-pitched drums backing group song. After this example of Gnawa music is an Egyptian flute, string, and percussion melody that clearly brings pyramids and oases to mind. Returning to Istanbul, listeners hear a surprisingly sedate male chorus backed by flute and tambourines from Music of Islam, Vol. 9: Mawlawiyah Music of the Whirling Dervishes. (Perhaps even dervishes need to relax.) Coming from Yemen is a very intricate and hypnotic melody from a plucked string instrument. The compilers chose to represent Pakistan with a near seven-minute raga. A clear, bright, Oriental female voice defines an Indonesian ensemble. Having heard from lower Egypt, listeners make a visit to upper Egypt where the leader of a Nubian troupe initiates each verse answered by the chorus, all to a lively drum beat. More exotic, moving, and densely structured music is heard from Qatar, Egypt, Morocco, Turkey, Tunisia, and Morocco.\n &lt;a href=&quot;\nhttp://vip.tracker.thepiratebay.se/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vip.tracker.thepiratebay.se/announce&lt;/a&gt;","torrent":{"xt":"urn:btih:a7d91f605e4077f93c10fde75f3cd72a4fc769a2","amp;dn":"Music+of+Islam+15+Volume+Box+Set+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7d91f605e4077f93c10fde75f3cd72a4fc769a2","infoHashBuffer":{"type":"Buffer","data":[167,217,31,96,94,64,119,249,60,16,253,231,95,60,215,42,79,199,105,162]},"announce":[],"urlList":[]}}