{"title":"Kurtis Blow - The Best Of Kurtis Blow@320","uid":4077683,"size":231898501,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a817a4649cda3a50bb3642f0bc9afae438facacd&amp;dn=Kurtis+Blow+-+The+Best+Of+Kurtis+Blow%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":24,"time":1205408301,"description":"With his funky, hooky beats and confident, distinct lyrics and flow, Kurtis Blow established himself as one of rap&amp;#039;s earliest crossover artists, a fact which at times obscures his actual talent and innovation. THE BEST OF... offers a fair sampling of the output of a man who stood as one of the first public faces of hip-hop.\n\nHis two best-remembered hits are both present, of course: &quot;The Breaks&quot; stands decades later as arguably early rap&amp;#039;s greatest participatory song, with its handclaps and chants and uncommonly groovy riff, and while &quot;Basketball&quot; inevitably dates itself both lyrically and by its light, bubblegum sound, there&amp;#039;s sweetness in its simplicity. Blow&amp;#039;s rhymes are generally simple but memorable, and the melodies are designed perfectly to hook the listener in. Statement songs such as &quot;Hard Times,&quot; &quot;Tough,&quot; &quot;America,&quot; and &quot;Starlife&quot; (perhaps the first rap lament on the pitfalls of stardom) drive their respective points home. A forgotten classic lurks in 1986&amp;#039;s &quot;I&amp;#039;m Chillin&amp;#039;,&quot; featuring the Transformers theme and the sparsest and baddest lyrics on offer here. Kurtis Blow was the first popular MC of hip-hop and this collection offers ample evidence why.\n\n\n\n01. The Breaks                                                                                                          \n02. Christmas Rappin&amp;#039;                                                                                                   \n03. Hard Times                                                                                                          \n04. Starlife                                                                                                            \n05. Tough                                                                                                               \n06. Daydreamin&amp;#039;                                                                                                         \n07. Party Time                                                                                                          \n08. One-Two-Five (Main Street, Harlem, Usa)                                                                             \n09. 8 Million Stories                                                                                                   \n10. Aj Scratch                                                                                                          \n11. Basketball                                                                                                          \n12. America                                                                                                             \n13. If I Ruled The World                                                                                                \n14. I&amp;#039;m Chillin&amp;#039; \n\n\n\nPersonnel includes: Kurtis Blow (rap vocals, DMX synthesizer, timbales); Run-D.M.C. (rap vocals); Adam White (spoken vocals); Denzil Miller (guitar, keyboards); Danny Harris (guitar, synthesizer); John Tropea, Dean Swenson, J.B. Moore, Curtis Bedreau, Dean Bailin (guitar); Mark &quot;Sugar Rico&quot; Rivera (saxophone); Onaje Allan Gumbs, Don Blackman (piano); Robbie Kondor, Gerard Charles, Jeff Bova (synthesizer); T-Bone Wolk, Richard Pascual, Craig Short, Seth Glassman (bass); Jimmy Bralower, Alonzo &quot;Go-Go&quot; Robinson (drums); Jaime Delgado (congas, timbales); Sam Jacobs (percussion); Davey Dee, William Waring, Larry Smith, Wayne Garfield, Robert Ford (background vocals).\n\nProducers include: Kurtis Blow, J.B. Moore, Robert Ford, Jr., Robert Reed.\nCompilation producer: Harry Weinger.\nIncludes liner notes by Nelson George &amp; Russell Simmons.\nDigitally remastered by Gary Mayo (Polygram Studios).\n\n\nLabel: Mercury/Polygram\nOrig Year: 1994\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\n\n\nEnjoy,Seed and Share\t","torrent":{"xt":"urn:btih:a817a4649cda3a50bb3642f0bc9afae438facacd","amp;dn":"Kurtis+Blow+-+The+Best+Of+Kurtis+Blow%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a817a4649cda3a50bb3642f0bc9afae438facacd","infoHashBuffer":{"type":"Buffer","data":[168,23,164,100,156,218,58,80,187,54,66,240,188,154,250,228,56,250,202,205]},"announce":[],"urlList":[]}}