{"title":"Bashar - Download (MP4)","uid":7686774,"size":369526143,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a88bb96fb4c889e2905e81f8f5b185b926429f94&amp;dn=Bashar+-+Download+%28MP4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"awakeperson","files":15,"time":1348971253,"description":"&quot;DOWNLOAD&quot;\nBecoming More Sensitive to Receiving\nHigher Frequency Energy and Information\n\nLos Angeles, CA 10-11-08\n\nBashar invites you to open the door to your Higher Self and explore your power to become more sensitive to perceiving the downloads of information you are always being sent. By learning how to download high frequency information you can experience the guidance and direction that is perfectly keyed to your life. Join Bashar on this exploration of how to experience the full potential of your life. Included in Bashar's discussion is the role of the pineal gland in the brain and the neurotransmitters that are designed for communication between the Higher Mind and the Physical Mind.\n\nQ&amp;A: Are we going to have a mass sighting of E.T. craft on October 14, 2008? How is our world going to change in response to the current changes we are seeing in our society? How can I participate more consciously in my relationship with my hybrid daughter? How can I interact more consciously with the extraterrestrials who visit me? Why does one person experience a UFO contact event differently than others who are right there? How could I do things that our society would consider impossible? What is the meaning of the date of December 21, 2012 on the Mayan calendar? How can I manifest my twin flame/soul-mate/partner? Do the physical mind's perceptions feed back to the higher mind and what kind of effect does this create? How do the writings in the Bible relating to the creation of mankind align with Bashar's description of creation? What is prayer? How can I better understand the messages given by crop circles?\nWhat does Bashar foresee happening in our economy in the next few years? Who or what is making the crop circles? How can we deal with the extraterrestrial visitors who have negative intentions toward us?\nWhy are extraterrestrial craft attracted to large gatherings such as concerts? If we make a dimensional shift along with the planet, will our loved ones make the shift with us? How can I break the patterns of my life in order to manifest my highest self?\n &lt;a href=&quot;\nhttp://bashar.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bashar.org&lt;/a&gt;\n\n_________________________________________________________________________________\n\nKnowledge is free!\nShare it, seed it, grow it!\n\nMake earth a better place! :)\n","torrent":{"xt":"urn:btih:a88bb96fb4c889e2905e81f8f5b185b926429f94","amp;dn":"Bashar+-+Download+%28MP4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a88bb96fb4c889e2905e81f8f5b185b926429f94","infoHashBuffer":{"type":"Buffer","data":[168,139,185,111,180,200,137,226,144,94,129,248,245,177,133,185,38,66,159,148]},"announce":[],"urlList":[]}}