{"title":"Vermist S01 DVDRip Nl gesproken DutchReleaseTeam","uid":6919536,"size":4511379220,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a943133b09ea526b0d2a1a1d65f1744eadf672a6&amp;dn=Vermist+S01+DVDRip+Nl+gesproken+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Koedje","files":-1,"time":1325158800,"description":" &lt;a href=&quot;http://img827.imageshack.us/img827/5861/vermist.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img827.imageshack.us/img827/5861/vermist.jpg&lt;/a&gt;\n\n\nPlot:\n\nVermist is een Vlaamse fictieserie dat vanaf 2008 werd gerealiseerd door VT4 en Eyeworks. Het project bestaat uit een bioscoopfilm en een televisieserie. De verhaallijnen draaien om het vijfkoppige team van de Cel Vermiste Personen van de Federale Politie, dat zich focust op het terugvinden van vermiste personen. Door onder meer de zaak-Dutroux en de moord op Nathalie Mahy en Stacy Lemmens heeft Vermist een hoog actualiteitsgehalte. De film, geregisseerd door Jan Verheyen, diende tevens als pilot aflevering van de serie. In totaal telt de serie twintig afleveringen, verspreidt over twee seizoenen. Hoofdrollen werden vertolkt door Koen De Bouw, Joke Devynck, Kevin Janssens, Stan Van Samang, CathÃƒÂ©rine Kools en Axel Daeseleire. Oorspronkelijk werd aangekondigd dat er geen derde seizoen zou komen, maar VT4 is hierop teruggekomen. Wanneer dit seizoen zal worden opgenomen en uitgezonden, is onbekend.\n\n\nNl subs bijgevoegd\n\n\nSeizoen 1:\n\n\nAflevering 1: Evi\n\nDe bioscoopfilm van Jan Verheyen is tevens de pilootaflevering van de gelijknamige nieuwe serie. \nEen meisje van zestien loopt weg van huis na een conflict met haar vader. \nHet lijkt een verdwijning als dertien in een dozijn, maar voor Walter Sibelius, teamleider van de Cel Vermiste Personen, \ngaan er al snel een paar alarmlichten branden.\n\n\n\n\nAflevering 2: Baby Alisha\n\nKort na de geboorte verdwijnt de baby van een tienermoeder uit het ziekenhuis. \nDe speurders van de Cel Vermiste Personen concentreren zich op twee pistes. \nMisschien zag de te jonge vrouw het moederschap zelf niet zitten. Of misschien is er een wanhopige kinderloze vrouw met het kind vandoor? \nKunnen de speurders de baby tijdig terugvinden?\n\n\n\n\nAflevering 3: Sander\n\nDe zestienjarige Sander wordt op school gepest. Wanneer hij met medeneming van de long-rifle van zijn vader het ouderlijk huis verlaat, wordt groot alarm geslagen. \nHet ziet ernaar uit dat Sander besloten heeft het recht in eigen handen te nemen en wraak te nemen voor wat hem is aangedaan. \nHet wordt nog zorgwekkender wanneer de speurders een website ontdekken vol filmpjes.\n\n\n\n\nAflevering 4: Rens\n\nDe cel ontdekt per toeval dat Rens, het zoontje van een Nederlandse topcrimineel, ontvoerd is. \nNoch de vader, noch de collega's van de Cel Georganiseerde Criminaliteit zijn erg op de bemoeienissen van Sibelius en zijn team gesteld. \nDat is buiten de gedrevenheid van Tine gerekend, die haar instinct volgt maar haar boekje te buiten gaat.\n\n\n\n\nAflevering 5: Kika\n\nKimberly Kamps, beter bekend als Kika, een meisje dat een belspelletje presenteert, verdwijnt samen met haar vriend Dimi. \nDat gebeurt net op het moment dat haar single aan de pers wordt voorgesteld. \nDe voor de hand liggende verdachten zijn Dimi zelf en een aantal fervente bellers, die zich in het ootje genomen voelen bij het belspelletje.\n\n\n\n\nAflevering 6: Weilandboy\n\nIn een afgelegen weiland wordt het lichaam gevonden van een jonge zwarte man, verzonken inde grond. \nEen verstekeling uit Afrika die uit een vliegtuig is gevallen? Of is er meer aan de hand?\n\n\n\n\nAflevering 7: Sara\n\nSara is tien en verdwijnt onderweg naar school. Haar moeder is een drukbezette zakenvrouw met bijzonder weinig tijd voor haar dochter. \nTwee feiten maken de speurders extra ongerust. Op de kamer van Sara vinden ze pikante foto's van haarzelf. \nBovendien blijkt dat Sara al een dag langer vermist is dan oorspronkelijk was gemeld. Zonder Walter in de buurt gaat de Cel helemaal loos.\n\n\n\n\nAflevering 8: Anja\n\nWanneer de depressieve Anja verdwijnt, ligt de conclusie voor de hand: ze heeft wellicht zelfmoord gepleegd. \nAls blijkt dat haar man een relatie heeft met een jongere vrouw, liggen de kaarten anders. Er zijn aanwijzingen dat Anja is vermoord. \nOndertussen ligt de Cel steeds meer onder vuur vanwege de gebruikte opsporingsmethodes in de zaak-Sara. Het comitÃƒÂ© P stelt een onderzoek in.\n\n\n\n\nAflevering 9: Taxi\n\nEen man is verdwenen nadat een taxi hem heeft opgepikt. Hij wordt teruggevonden, maar de taxichauffeur is spoorloos. \nVolgens de informatie van de Cel is de chauffeur lid van een terroristische organisatie. \nBovendien blijkt dat samen met de taxichauffeur nog iemand verdwenen is: de onderzoeksjournaliste Ilse Mercelis. \nNick gaat op onderzoek uit en wordt eveneens ontvoerd.\n\n\n\n\nAflevering 10: Nick\n\nNick wordt samen met onderzoeksjournaliste Ilse Mercelis vastgehouden. \nDe Chinese criminele organisatie die zij op het spoor was, is verantwoordelijk voor de ontvoering. \nDe tijd dringt, want Ilse heeft dringend medische verzorging nodig. \nIn deze hectische situatie heeft Walter geen tijd om naar de problemen van zijn dochter Lena te luisteren, met alle gevolgen van dien.\n\n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.be\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:a943133b09ea526b0d2a1a1d65f1744eadf672a6","amp;dn":"Vermist+S01+DVDRip+Nl+gesproken+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a943133b09ea526b0d2a1a1d65f1744eadf672a6","infoHashBuffer":{"type":"Buffer","data":[169,67,19,59,9,234,82,107,13,42,26,29,101,241,116,78,173,246,114,166]},"announce":[],"urlList":[]}}