{"title":"Dark Soho - Light in the Dark","uid":3390322,"size":103793644,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a94da6bb5cc358e4b0d27e692aab5b361ea089e0&amp;dn=Dark+Soho+-+Light+in+the+Dark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ninjanano","files":9,"time":1128104900,"description":"The perfect balance between musicality and creative emotion.\n\nFeaturing nine outstanding tracks, Light IN THE Dark is a progression in their signature guitar based sound, pushing across the boundaries into a new direction.\n\nFurther developing their sound beyond the predictable, Dark Soho collaborated with world renowned sitar player Anoushka Shankar, daughter of Ravi Shankar, on the tracks 'Long Way Home' and 'Peace of Mind', perfect examples of contrasting styles and influences that sets Dark Soho apart from their peers.\n\nZeev Dukman (ex member of Dark Soho) appears on the track 'Aliens Cream' which layers twisted synthesizer soundscapes with deep hypnotic techno influenced grooves.\n\nOpening the album is the oustanding track 'Non Stop to Nowhere' which morphs from the melodic guitar laden sound of the intro into an uplifting and unexpected driving groove.\n\nNew tracks 'The Toy', 'Magic' and 'Away' are focused on the dance floor and highlight further the new direction Dark Soho have taken that is winning them new fans all over the world.\n\nThe new album exposes their brilliant combination of groove and intensity, creating a phenomenal sound that travels through the darkness into the light.\n\nStyle: Psytrance\n\nReleased: Nov. 2004/47","torrent":{"xt":"urn:btih:a94da6bb5cc358e4b0d27e692aab5b361ea089e0","amp;dn":"Dark+Soho+-+Light+in+the+Dark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a94da6bb5cc358e4b0d27e692aab5b361ea089e0","infoHashBuffer":{"type":"Buffer","data":[169,77,166,187,92,195,88,228,176,210,126,105,42,171,91,54,30,160,137,224]},"announce":[],"urlList":[]}}