{"title":"The King of Communism (Nicolae Ceausescu).avi","uid":4792436,"size":712795410,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a9f66eaa551e78ea671e758279ecd9e2dadfeb61&amp;dn=The+King+of+Communism+%28Nicolae+Ceausescu%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twinned","files":1,"time":1237760360,"description":"Nicolae Ceausescu created a unique personality cult in the 1970s and 1980s, transforming communist Romania into one of the strangest regimes Europe has ever seen. Newspapers had to mention his name 40 times on every page, factory workers spent months rehearsing dance routines dressed as soldiers and gymnasts for huge shows at which thousands of citizens were lined up to form the words Nicolae Ceausescu with their bodies.\nWhen the Romanian economy and living standards plummeted in the 1980s, the line between theatre and life blurred completely. Ceausescu went on working visits to the countryside where he inspected displays of meat and fruit made out of polystyrene, and closer to home began work on what would have been the largest palace in the world. At the final parade in 1989, workers walked past their leader to the sound of taped chants and applause.\n\nUsing Ceausescu's own archive of 35mm propaganda films, King of Communism offers a surprising and chilling view of the absurd world of the Romanian dictator's regime.\n\n&quot;This is a real-life communist version of Springtime for Hitler,&quot; says director Ben Lewis. &quot;It's an all-singing, all-dancing unmasking of the illusions of communism, but it's also a serious study of the experience, effects and legacy of the twentieth century's most destructive political system.&quot;\n\n\n\n\nThanks to http://docs.torrents.ro","torrent":{"xt":"urn:btih:a9f66eaa551e78ea671e758279ecd9e2dadfeb61","amp;dn":"The+King+of+Communism+%28Nicolae+Ceausescu%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9f66eaa551e78ea671e758279ecd9e2dadfeb61","infoHashBuffer":{"type":"Buffer","data":[169,246,110,170,85,30,120,234,103,30,117,130,121,236,217,226,218,223,235,97]},"announce":[],"urlList":[]}}