{"title":"Alice.Madness.Returns.Crackfix-SKIDROW","uid":6479730,"size":15220082,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aa0e20382ed6ba1e5f69eb43abaf3757238a8d8e&amp;dn=Alice.Madness.Returns.Crackfix-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"musy2","files":1,"time":1308463888,"description":"S K I D R O W\nthe leading force\n\nproudly presents\nAlice: Madness Returns (c) EA\n\n18-06-2011........Release Date &lt;-&gt; Protection..............EACore\nAction...............Game Type &lt;-&gt; Disk(s)...............Crackfix\n\nCRACKFIX NOTES\n\nOn our initial release we only played the very first level. After the\npre we noticed there are many memory checks on the exe. Also that is\none of the reasons why your game may hang sometimes, you gotta blame\nEA for that one, we counted more than 500 checks on the exe\n\nRELEASE NOTES\n\nAlice: Madness Returns delves deep into the dark and violent side of\nthe imagination, creating a nightmarish Wonderland where Alice must\nface the demons that haunt her visions. Visit the grim reality of\nVictorian London and then travel to the beautiful yet ghastly\nWonderland to uncover the root of Alice's madness and discover the\ntruth behind a deadly secret, kept hidden for years\n\nEleven years ago a horrific fire took Alice s family from her and left\nher mind horrifically scarred. Afterwards she was confined to Rutledge\nAsylum, where she struggled to confront her demons by slipping further\ninto her fantasy world of Wonderland. Now, after ten years, she has\nfinally secured her release yet she still bears the heavy\npsychological burden of that tragic event\n\nWith her mind in tatters, she is unable to resolve the fear prompted by\nher strange memories, dreams, and visions. Perhaps she'll do better in\nWonderland. She always has. She travels there, seeking what the &quot;real&quot;\nworld can't provide: security, knowledge, and the truth about the past\nBut in her absence, Wonderland too has suffered. Something has gone\nhorribly wrong, and now a great evil is descending upon what once was\nher beautiful refuge. Can Alice save Wonderland and herself from the\nmadness that consumes them both?\n\nFeatures:\n\nIntense 3rd person action: Use multiple upgradeable melee weapons\nincluding the explosive Teapot Cannon, the punishing Hobby Horse, and\nthe classic Vorpal Blade\n\nExplore a dark and shattered Wonderland: Encounter familiar but now\nstrange characters, including the Cheshire Cat, the Mad Hatter, the\nCaterpillar and the Red Queen\n\nMagical abilities: Obtain peculiar abilities in Wonderland such as\nfloating with Alice's dress, shrinking, or growing to towering sizes in\norder to crush enemies\n\nInteractive puzzles: Intuitive and rewarding puzzles such as\ntransforming obstacles, musical memories, chess, and picture blocks\n\nThe Complete Collection, with an enhanced edition of the first Alice\ntitle\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy all contents to the game installation directory\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n","torrent":{"xt":"urn:btih:aa0e20382ed6ba1e5f69eb43abaf3757238a8d8e","amp;dn":"Alice.Madness.Returns.Crackfix-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa0e20382ed6ba1e5f69eb43abaf3757238a8d8e","infoHashBuffer":{"type":"Buffer","data":[170,14,32,56,46,214,186,30,95,105,235,67,171,175,55,87,35,138,141,142]},"announce":[],"urlList":[]}}