{"title":"7 Days to die  Game Version: 8.8 Alpha","uid":10630519,"size":1802052815,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aa4c0caac1cc0039b1bd414851f0ce79641c5eb0&amp;dn=7+Days+to+die++Game+Version%3A+8.8+Alpha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Steso30","files":401,"time":1406308430,"description":"Year Early Access : 13 December 2013 \nGenre : Action (Shooter) / 3D / 1st Person \nDeveloper : The Fun Pimps \nPublisher: The Pimps Fun\n\nPublication Type : pirates {Steam Early Access} \nLanguage : English \nVoice set Language : English \nCrack : enclosing ( 3DM)\n &lt;a href=&quot;\nhttp://postimg.org/image/kayy8mdgt/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/kayy8mdgt/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.org/image/qobl5511r/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/qobl5511r/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.org/image/a3znuf8qb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/a3znuf8qb/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.org/image/qguw4k8v9/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/qguw4k8v9/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.org/image/x2rtt28x3/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/x2rtt28x3/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.org/image/3xo0odetb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/3xo0odetb/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.org/image/myfhumwat/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/myfhumwat/&lt;/a&gt;\n\n\nOS: 10.6 / 10.9 \nProcessor: 2.4 Ghz Dual Core CPU \nMemory: 4 GB RAM \nGraphics: Nvidia 9800M GTS | Radeon HD 6770M \nHard Drive: 2 GB available space \nAdditional Notes: Install Size Will Gradually Increase with future updates.\n\nUpdate 24.07.2014\nGame Version: 8.8 Alpha\n\nImportant!\n\n\nSurvivalists bonjour, \nWe have an Alpha 8.8 Patch out for you That fixes the steam ID Spoofing or account hijacking bug. To check out the rest of the Pimps News and what's coming in Alpha 9 read on.\n\n7 Days on Youtube \nThe popular YouTube Channel &quot;The Achievement Hunters&quot; Under the &quot;Rooster Teeth&quot; umbrella are doing A series on 7 Days to Die! Head on over to one of the first 2 Videos and Thumbs up to it Show your Support if you'd like to See A regular series by These hilarious guys. \nLet's Play 7 Days to Die Part 1 \nLet's Play 7 Days to Die Part 2\n\nAlpha 9 Status \nOk now for the news You've All Been waiting for. The word on the street is that the Pimps have decided to accelerate their Alpha 9 schedule shuffling a few features around moving some things forward and a few things back to post Alpha 9 to get you guys a kick ass new build sooner. If all goes well you'll get it as soon as August 8th. Here are the Planned Features in going. \nRandomly Generated Infinite Worlds Which Biomes include All types with Custom elevations, Lakes, Rivers Natural Deeper, curvy Roads, random locations, and procedurally generated Centralized A Wasteland city with some never before Seen locations! \nA kickass New AAA GUI with all new art including belt, backpack, character screen, map, friends list, new minimalist compass and player stats. Also includes the GUI added Functionality Including our New Data driven in game map system with Fog of War, A searchable list and Recipe friend compass Tracking \nNew leg sprain, fracture leg, leg and Dysentery Break de-Buff Systems \nUnder water and drowning system Effects \nWorld improvements including decorations adhering to the terrain to altering what is found out and about while scavenging. All major prefabs have been given a container overhaul. We thinned out the cabinets and other things that can hold loot, but increased the odds that things will be found within them. This has the benefit of making Dual longer scavenging more Profitable Ventures while not spreading too much more loot into the World as A whole. \nAnd lastly if time Permits watch out for our New Gore block system where Zombie Bloody Bodies decompose into piles That stack up and can work in the Zombies Favor.\n\nPings Pure Prize Giveaway \nOur friends over at Pure Pings are running A Giveaway! Follow the link below to enter a chance to win a free 7 days to Die Key and Server Bundle! \nPings Pure Giveaway\n\nMac and Linux Versions \nIn A final note Regarding the Linux and Mac versions. The truth is we need more time to improve the Mac version and to get the Linux version fully working. For now we have looked into alternatives for those of you running either of these systems and have come up with a couple ways in which you can still enjoy the game by running Windows on your machine Bootcamp for Mac and Wine for Linux. Here's How you do it.\n\nBootcamp on Mac \nBootcamp is A simple and Easy Way to Run Windows Alongside your OSX. You are required to have A Copy of Windows in order to install.\n\nBefore installing Bootcamp or Windows, Please Ensure That there are no Pending updates for your Machine. This can be done by following these steps:\n1. Go to Apple's Boot Camp Support Page ( http://www.apple.com/support/bootcamp/ ) to See if updates are available for your model. Download and install if necessary. \n2. Click the Apple menu, then Software Update ... to install any updates for your system. \n3. Restart your computer if prompted. After restarting, check for Software updates Again until no New ones are available.\n\nSince Bootcamp is going to be changing your HDD A configuration bit, you want to Backup Will anything you might be afraid to Lose. Chances are the slim, but They are Real, so better Safe than sorry.\n\nNext, you need to Run the Bootcamp Assistant. This can be done by going into the Finder, click Applications, then Utilities. Within the Utilities Folder, you'll Find the Bootcamp Assistant. \nAfter clicking Continue, you Will likely be if you want Asked to install Windows Support Software for your Mac. You've since Come this Far, Will you need to do so. \nThe next thing That's going to happen Driver Downloads Will be so That your New Windows install Will be Able to Talk to the Hardware in your Mac. Either you need to burn These Files to A disc or save to Them A thumbdrive.\n\nNext up is partitioning your HDD. Unless you plan on using A Bunch of Windows programs, Only You're going to need 25GB of space About partitioned for Windows (16GB for the OS, some spare in Case of more stuff). \nWill Take Your Mac partition and this off at this point. Will this Take some time, so do not worry About it.\n\nOnce the partitioning is Complete, you can now install Windows by inserting your install disc into the disc Drive. Your Computer Will restart and now you'll be Able to follow the Windows Installation Normally. \nWhen it asks if you want A typical or Custom Installation, always click Custom and Point to the hard partition labeled BOOTCAMP Drive. If you do not, You're going to Lose All information and OSX on your Machine. \nSelect That You'll have to partition and Format it. This is done by clicking Drive Options (Advanced) then Format. Takes some time windows to install, so Again, Relax for A bit.\n\nOnce the Installation is Complete, simply Remove the Windows install disc (Either by Pressing the EJECT button on your disc Drive or navigating to My Computer, right clicking the disc and Drive click Eject) and insert the Drivers Prepared Media you earlier. \nTo install the Drivers, you just need to Open the Media That you inserted and Double click setup.exe. Let it Run ITS course, restart the Computer and you'll be good to go.\n\nWhich OS To choose to start (you'll always Boot into OSX by Default) hold the Option Key while booting to Select Which OS to use.\n\nWhen you 'Re Done, download Steam, Log in, download and start Playing 7DtD. \nWine on Linux \nStep 1: Update System Files.\n\nStep 2: Use the &quot;Ubuntu Software Center&quot; and download PlayOnLinux (once the packages have been selected, you may need click on to install packages)\n\nStep 3: Run PlayOnLinux\n\nInside &quot;PlayOnLinux&quot;\n\nStep 4: Install New Listed Program\n\nStep 5: Install Steam\n\nStep 6: Highlight Your newly Created Shortcut, and configure the Select COG on the Play on Linux panel.\n\nStep 7 : Click on The Wine Tab, and select configure. Under the &quot;Graphics Tab&quot; check Automatically Capture the mouse in fullscreen. And Then Apply. There should be only the first three boxes Checked in that tab, the last one should remain unchecked. Click Okay.\n\nStep 8: Press the &quot;Reboot Windows&quot; icon, and your virtual Machine Will Update Changes.\n\nStep 9: Exit the configuration window, and Run PlayOnLinux &quot;Steam&quot; \nStep 10: Wait for the updates to Update\n\nFrom Steam:\n\nStep 11 : Login and Download Game (Note: if you use any Special characters in your name and password, you need to write May the login information using A Notepad program (gEdit, etc) and Copy / paste into the login field)\n\nStep 12: Once downloaded, double click game, and VCredist2010 should start downloading. If it doesn't click &quot;Play game&quot;, and it will download for you. Game should &quot;fail to start&quot;; (If still does not VCredist2010 down load, you can right click and Select Properties 7dtd, then, Select &quot;Browse Local Files&quot; and Select &quot;_CommonRedist&quot; file and navigate till you Find the executable.) \nStep 13: Double Click Game again, and this time select &quot;Install 32 Bit&quot;, \nStep 14: Double Click Game Again, and &quot;Play Game&quot; \nStep 15: Play game.","torrent":{"xt":"urn:btih:aa4c0caac1cc0039b1bd414851f0ce79641c5eb0","amp;dn":"7+Days+to+die++Game+Version%3A+8.8+Alpha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa4c0caac1cc0039b1bd414851f0ce79641c5eb0","infoHashBuffer":{"type":"Buffer","data":[170,76,12,170,193,204,0,57,177,189,65,72,81,240,206,121,100,28,94,176]},"announce":[],"urlList":[]}}