{"title":"The Ancient Minstrel_ Novellas - Jim Harrison","uid":13766257,"size":5296001,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aacf976dbed98085dd81a7f900cbaa7b4faaf8ea&amp;dn=The+Ancient+Minstrel_+Novellas+-+Jim+Harrison&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mr_mando","files":3,"time":1457241324,"description":"New York Times bestselling author Jim Harrison is one of our most beloved and acclaimed writers, adored by both readers and critics. In The Ancient Minstrel, Harrison delivers three novellas that highlight his phenomenal range as a writer, shot through with his trademark wit and keen insight into the human condition.\r\n\r\nHarrison has tremendous fun with his own reputation in the title novella, about an aging writer in Montana who spars with his estranged wife, with whom he still shares a home, weathers the slings and arrows of literary success, and tries to cope with the sow he buys on a whim and the unplanned litter of piglets that follow soon after. In Eggs, a Montana woman reminisces about staying in London with her grandparents, and collecting eggs at their country house. Years later, having never had a child, she attempts to do so. And in The Case of the Howling Buddhas, retired Detective Sunderson—a recurring character from Harrison’s New York Times bestseller The Great Leader and The Big Seven—is hired as a private investigator to look into a bizarre cult that achieves satori by howling along with howler monkeys at the zoo.\r\n\r\nWith profound wisdom and sublime humor, The Ancient Minstrel confirms Jim Harrison as one of the most cherished and important writers at work today","torrent":{"xt":"urn:btih:aacf976dbed98085dd81a7f900cbaa7b4faaf8ea","amp;dn":"The+Ancient+Minstrel_+Novellas+-+Jim+Harrison","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aacf976dbed98085dd81a7f900cbaa7b4faaf8ea","infoHashBuffer":{"type":"Buffer","data":[170,207,151,109,190,217,128,133,221,129,167,249,0,203,170,123,79,170,248,234]},"announce":[],"urlList":[]}}