{"title":"Britney Spears Blackout (CD Rip) MusicFanatic98","uid":9687926,"size":106761665,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aae47dde85046e71ff0ca73f4003fbc4a36dddee&amp;dn=Britney+Spears+Blackout+%28CD+Rip%29+MusicFanatic98&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"MusicFanatic98","files":-1,"time":1393811178,"description":"Blackout is the fifth studio album by American recording artist Britney Spears, released on October 26, 2007, by Jive Records and the Zomba Music Group. Opting to re-establish her music career after her fourth record In the Zone (2003), she began planning the project in 2006. Work continued into 2007, during which time Spears' much-publicized personal struggles, including several instances of erratic behavior and her divorce from Kevin Federline, overshadowed her professional endeavors. Blackout was originally scheduled to be released on November 30, though it was ultimately rush-released by a month on October 30 after several unauthorized internet leaks. It was expected to debut at number one on the U.S. Billboard 200, but debuted at number two with first-week sales of 290,000 copies after a last-minute rule change. Consequently, Blackout is distinguished as Spears' first studio album not to debut in the number-one position in the United States, although it was later certified platinum by the Recording Industry Association of America (RIAA) for exceeding one million shipments. The record charted in the top-ten of several national charts internationally, and has attained several certifications worldwide. By the end of 2011, Blackout had sold 3.2 million copies worldwide.","torrent":{"xt":"urn:btih:aae47dde85046e71ff0ca73f4003fbc4a36dddee","amp;dn":"Britney+Spears+Blackout+%28CD+Rip%29+MusicFanatic98","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae47dde85046e71ff0ca73f4003fbc4a36dddee","infoHashBuffer":{"type":"Buffer","data":[170,228,125,222,133,4,110,113,255,12,167,63,64,3,251,196,163,109,221,238]},"announce":[],"urlList":[]}}