{"title":"Exiled Kingdoms RPG v 0.7.925 mod [apkpita]","uid":14992245,"size":105161188,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:aaf75ef7c42fb098110a5a8c1b2c26ccf95bcc34&amp;dn=Exiled+Kingdoms+RPG+v+0.7.925+mod+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1466331774,"description":"Exiled Kingdoms is a single player Action-RPG that allows you to roam freely through a unique world. It is an isometric game, inspired by some of the best role-playing games from the past decades; it brings back the old spirit of the classics in many ways: a challenging environment, choices with consequences, and a solid game system, with different paths to develop your character. \r\n\r\nExplore the world: no one will point you to the best hidden secrets. Talk to hundreds of different characters, each with unique dialogues, and solve dozens of quests. Customize your character with dozens of skills and hundreds of different items. Overcome all kind of monsters and antagonists, choosing carefully the weapons or powers for each encounter. And return to the classical dungeon crawl, with traps and secret doors, and death awaiting the unwary adventurer behind every corner. \r\n\r\nForums and more information at: http://www.exiledkingdoms.com/\r\n\r\nFree version: allows to play as a Warrior or a Rogue. It includes 12 areas, 7 completable quests (others partially completable), and many hours of gameplay, with a level cap adequate to the areas available. More free maps and content will be added with future updates. \r\n\r\nThis is the Full version: everything is unlocked, forever. No other activations are required. Includes 60 areas, 40 quests (plus dozens of procedural quests), hundreds of dialogues, counting over 100,000 words; approximately 35+ hours of gameplay, and more content gets added all the time. Additionally, the full version unlocks the Iron-Man mode (permadeath) and makes the Cleric class available (Mage is still in development). \r\n\r\n\r\nStory introduction: A dark tale, and a brave new world \r\n\r\nA century ago, the Andorian Empire was destroyed by a magical cataclysm that brought The Horrors into our world; humanity was nearly annihilated. Many thousands managed to escape sailing away to the Imperial Colony of Varannar: a savage island, dangerous and unexplored. Mistrust and blame made impossible to elect a new Emperor, and the four Exiled Kingdoms were proclaimed. \r\n\r\nNowadays, the ragtag kingdoms still struggle to survive in a harsh land, often waging war on each other. Empire and the Horrors are, for many, just old legends and fairytales. You are a novice adventurer, rarely paying attention to such old stories; you're more concerned with your latest misadventures and lack of gold. \r\n\r\nBut for once, luck seems to be on your side. You received a letter from New Garand, stating that you are the sole beneficiary of a big inheritance. You don’t remember any relatives in the capital of the Kingdom of Varsilia, but certainly that won’t stop you from an opportunity like this! The road to New Garand will reveal many surprises, and will teach you that fairytales and legends can become, in fact, very real.  \r\n\r\nWhat’s new: \r\nFixes fullscreen buttons bar on old android versions. \r\nNew city (Freetown), and around it, new areas, quests, items and NPCs. Also fixes and improvements. \r\nFull list of  of changelog at: http://www.exiledkingdoms.com/changelog\r\n\r\nNOTE: if you experience lag or other issues right after an update, try restarting your device. \r\n\r\nMod by 25az: \r\nFull license is unlocked \r\n\r\nRequirements: Android OS 4.1 and up","torrent":{"xt":"urn:btih:aaf75ef7c42fb098110a5a8c1b2c26ccf95bcc34","amp;dn":"Exiled+Kingdoms+RPG+v+0.7.925+mod+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaf75ef7c42fb098110a5a8c1b2c26ccf95bcc34","infoHashBuffer":{"type":"Buffer","data":[170,247,94,247,196,47,176,152,17,10,90,140,27,44,38,204,249,91,204,52]},"announce":[],"urlList":[]}}