{"title":"YYMBR Presents The Unofficial Greatest Hits of OJ Da Juiceman","uid":11839089,"size":497930802,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ac3bf76de264625504c0b1943fd82509b6f8517c&amp;dn=YYMBR+Presents+The+Unofficial+Greatest+Hits+of+OJ+Da+Juiceman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheAntidote","files":126,"time":1429813038,"description":"125 of the best OJ Da Juiceman tracks, hand-picked by YYMBR Records.\nThis is current as of 4/23/2015.\nVolume 2 to come!\nPlease seed and spread the word.\nVisit YYMBR Records on Twitter @YYMBR and at http://www.YYMBRrecords.com.\nAlso visit Djack &amp; The Antidote @DATAyymbr.\n\nTrack List:\n1.\tOJ Da Juiceman - All I Need\n2.\tOJ Da Juiceman - 615 f. Lil D.R.E. and Tony Bandz\n3.\tGucci Mane - Vette Pass By f. OJ Da Juiceman\n4.\tOJ Da Juiceman - I'm Gonna Stunt (Frank Sinatra Live Until I Die)\n5.\tOJ Da Juiceman - Trap Hater\n6.\tOJ Da Juiceman - Bustin Chicken (Classic)\n7.\tGucci Mane - Shirt Off (Remix) f. OJ Da Juiceman, Frenchie, and Wooh Da Kid\n8.\tOJ Da Juiceman - I'm Get It\n9.\tOJ Da Juiceman - Ziplock f. Gorilla Zoe\n10.\tOJ Da Juiceman - No Hook (Ring A Ling A Ling)\n11.\tYoung Scooter - Partner f. OJ Da Juiceman\n12.\tOJ Da Juiceman - Burr Beer\n13.\tOJ Da Juiceman - Early Morning Trappin'\n14.\tOJ Da Juiceman - Midget\n15.\tOJ Da Juiceman - Mathmatics\n16.\tOJ Da Juiceman - Kick Door f. Gucci Mane\n17.\tOJ Da Juiceman - In The Hood f. Red Cafe, Rick Ross, and Jadakiss\n18.\tSlim Dunkin - That's A No Go f. OJ Da Juiceman\n19.\tOJ Da Juiceman - Hummer &amp; A Jacob\n20.\tOJ Da Juiceman - The Otis Williams Jr. Story\n21.\tOJ Da Juiceman - Got Work f. ?\n22.\tOJ Da Juiceman - The Mover\n23.\tOJ Da Juiceman - Car Talk\n24.\tWyld Money - Mail Man f. OJ Da Juiceman and Lil Wayne\n25.\tOJ Da Juiceman - Us Fuck Them f. Gucci Mane\n26.\tGucci Mane - Coca Coca f. Rocko, OJ Da Juiceman, Waka Flocka Flame, Shawty Lo, Yo Gotti, and Nicki Minaj\n27.\tOJ Da Juiceman - Baby Sitter f. Cap 1\n28.\tOJ Da Juiceman - H.A.T.E.U. (Remix) f. Mariah Carey, Gucci Mane, and Big Boi\n29.\tVerse Simmonds - Buy You A Round (Remix) f. Jim Jones, The Game, Juvenile, Jermaine Dupri, and OJ Da Juiceman\n30.\tOJ Da Juiceman - Up All Night\n31.\tOJ Da Juiceman - Little Story\n32.\tOJ Da Juiceman - Cemetery Pockets\n33.\tOJ Da Juiceman - Grills Are Gold f. Project Pat, Trae Tha Truth, and 8-Ball\n34.\tOJ Da Juiceman - Otis Williams Story\n35.\tOJ Da Juiceman - How U Doin Juice\n36.\tOJ Da Juiceman - Trapping Early Morning\n37.\tOJ Da Juiceman - DJ Screw\n38.\tOJ Da Juiceman - Flush The Yayo f. Lil Phat\n39.\tOJ Da Juiceman - I Sell f. Gunplay\n40.\tOJ Da Juiceman - Jugg\n41.\tOJ Da Juiceman - Larry Bird f. Lil D.R.E.\n42.\tGucci Mane - Georgia f. OJ Da Juiceman\n43.\tWooh Da Kid - Chopper Loose f. OJ Da Juiceman\n44.\tOJ Da Juiceman - Culinary Art School 2\n45.\tOJ Da Juiceman - Where Ya Been?\n46.\tOJ Da Juiceman - Chickens Go For 30 f. Gucci Mane and Wooh Da Kid\n47.\tOJ Da Juiceman - Sell Chickens\n48.\tOJ Da Juiceman - Bricks Ounces Deuces (B.O.D.)\n49.\tOJ Da Juiceman - Make Crack Like This\n50.\tOJ Da Juiceman - Stunt f. Rocko and Lil Jon\n51.\tOJ Da Juiceman - Glass House\n52.\tOJ Da Juiceman - Pistols f. Project Pat\n53.\tWooh Da Kid - Jack Boys f. OJ Da Juiceman and Gucci Mane\n54.\tGucci Mane - All These Bitches f. Chief Keef and OJ Da Juiceman\n55.\tGorilla Zoe - Helluvalife f. Gucci Mane and OJ Da Juiceman\n56.\tGucci Mane - Sopranos f. OJ Da Juiceman\n57.\tGucci Mane - Overboard f. OJ Da Juiceman, Rock City, and LA The Darkman\n58.\tBallout - Instagram (Remix) f. Fredo Santana and OJ Da Juiceman\n59.\tOJ Da Juiceman - It Is What It Is\n60.\tOJ Da Juiceman - Kush Blunts &amp; Rosay f. Big Kuntry\n61.\tOJ Da Juiceman - Kush\n62.\tOJ Da Juiceman - Juiceman Stupid (Camera's Flashin') f. Princess\n63.\tOJ Da Juiceman - Lullaby f. Wooh Da Kid and Kourtney Money\n64.\tOJ Da Juiceman - Walking On Ice (Remix) f. Twista and Gucci Mane\n65.\tOJ Da Juiceman - 3 P's f. Eldorado Red\n66.\tOJ Da Juiceman - 32 &amp; Bricksquad f. Wooh Da Kid, Frenchie, Waka Flocka Flame, Lil D.R.E., and YBC\n67.\tOJ Da Juiceman - Kingpin\n68.\tYung Joc - Birds (Remix) f. OJ Da Juiceman, Gucci Mane, Nicki Minaj, and Eb Da Iceman\n69.\tOJ Da Juiceman - They Call Me\n70.\tOJ Da Juiceman - Life On The Edge\n71.\tOJ Da Juiceman - Return Of The Juiceman\n72.\tOJ Da Juiceman - No Hook (All I Know Is Mathematics)\n73.\tOJ Da Juiceman - Work f. Criminal Manne\n74.\tWaka Flocka Flame - Flexxin f. Gucci Mane, OJ Da Juiceman, and David Blayne\n75.\tGucci Mane - Dear Diary f. Waka Flocka Flame and OJ Da Juiceman\n76.\tOJ Da Juiceman - Back From The Dead\n77.\tOJ Da Juiceman - What U Say (Remix)\n78.\tOJ Da Juiceman - Intro (ORANGE)\n79.\tOJ Da Juiceman - Castlevania f. YBC\n80.\tOJ Da Juiceman - O.R.A.N.G.E\n81.\tOJ Da Juiceman - Life Of Da Innocent\n82.\tGucci Mane - Just Re'd Up f. OJ Da Juiceman\n83.\tOJ Da Juiceman - Cocaine Pure (I Cook) f. Gucci Mane\n84.\tOJ Da Juiceman - Gimme $20 (Remix) f. Jim Jones, Shawty Lo, Ma$e, and Ron Browz\n85.\tOJ Da Juiceman - Alley Cuts And Hallways f. Kourtney Money\n86.\tOJ Da Juiceman - Chain Swang (Remix) f. Gucci Mane and Backbone\n87.\tOJ Da Juiceman - Batman\n88.\tOJ Da Juiceman - I'm Gettin' Money\n89.\tOJ Da Juiceman - Washing Powder\n90.\tOJ Da Juiceman - Make Tha Trap Say Aye f. Gucci Mane\n91.\tOJ Da Juiceman - 50 Bricks\n92.\tOJ Da Juiceman - Banker f. Kourtney Money\n93.\tOJ Da Juiceman - Bouldercrest\n94.\tOJ Da Juiceman - Trap Work\n95.\tOJ Da Juiceman - Cray\n96.\tOJ Da Juiceman - Came Up\n97.\tOJ Da Juiceman - Retard\n98.\tOJ Da Juiceman - He Dead\n99.\tOJ Da Juiceman - F.U.C.K. f. Tony Bandz and Lil D.R.E.\n100.\tOJ Da Juiceman - Shake &amp; Bake 2\n101.\tOJ Da Juiceman - Rocky\n102.\tGucci Mane - This Is What I Do f. Waka Flocka Flame and OJ Da Juiceman\n103.\tJadakiss - Who's Real? f. OJ Da Juiceman and Swizz Beatz\n104.\tOJ Da Juiceman - I'm Boomin' I'm Bunkin'\n105.\tOJ Da Juiceman - Money Countin f. Eldorado Red\n106.\tOJ Da Juiceman - Benjamin Franklin f. Suga Suga\n107.\tOJ Da Juiceman - 68 Cutlass\n108.\tYoung Scooter - Street Lights f. Gucci Mane and OJ Da Juiceman\n109.\tBusta Rhymes - Hustler's Anthem (Remix) f. Ryan Leslie, Gucci Mane, T-Pain, and OJ Da Juiceman\n110.\tOJ Da Juiceman - Gold Grill Shawty f. Soulja Boy\n111.\tOJ Da Juiceman - Brick Abuser\n112.\tCap 1 - Trampoline Trap f. Young Dolph and OJ Da Juiceman\n113.\tGucci Mane - Move Something f. OJ Da Juiceman and Back Roll Fresh\n114.\tLil Bra - All I Know Is Work f. OJ Da Juiceman\n115.\tOJ Da Juiceman - Halloween Donk\n116.\tOJ Da Juiceman - When I Look At The Trap (Dixon Brothers Thugstep Edit) f. Emalkay and Gucci Mane\n117.\tOJ Da Juiceman - Rap Don't Work\n118.\tReese - Diamond Dance f. OJ Da Juiceman\n119.\tRetro Sushi - Thirty Seven Thirty Two f. OJ Da Juiceman\n120.\tZ-Ro The Mo City Don - I Am The Streets f. OJ Da Juiceman\n121.\tOJ Da Juiceman - Supaman High f. R Kelly\n122.\tGucci Mane - Stealing f. OJ Da Juiceman\n123.\tGucci Mane - Christmas Tree f. PeeWee Longway and OJ Da Juiceman\n124.\tGucci Mane - Candy Lady (Extended Remix) f. OJ Da Juiceman, Wooh Da Kid, Waka Flocka Flame, and Frenchie\n125.\tGucci Mane - Wasted (Extended Remix) f. Plies and OJ Da Juiceman","torrent":{"xt":"urn:btih:ac3bf76de264625504c0b1943fd82509b6f8517c","amp;dn":"YYMBR+Presents+The+Unofficial+Greatest+Hits+of+OJ+Da+Juiceman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac3bf76de264625504c0b1943fd82509b6f8517c","infoHashBuffer":{"type":"Buffer","data":[172,59,247,109,226,100,98,85,4,192,177,148,63,216,37,9,182,248,81,124]},"announce":[],"urlList":[]}}