{"title":"NeuView Media Player Pro V6.0.8.0254 Portable","uid":4978034,"size":4022191,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ac853108da961ef917f6481ea9fa2bffa62e5801&amp;dn=NeuView+Media+Player+Pro+V6.0.8.0254+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zingooo","files":3,"time":1246110328,"description":"Exclusive Neuview Technologies\nNeuview is different to any other media player, in that it has possibly the most leading edge technologies available in a software media player to date. Read about them here ..\nPixelfusion - This is our unique image resampling algorithm, which is based around resolution enhancement to actually improve the perceived quality of video. This idea has been overlooked by media player developers in the past, but due to the consistent increase in computer processing power, it has become a reality at last..\nAdvanced playback kernel - We have overcome the normal playback limitations that are set by DirectShow, by developing a kernel which abstracts the decoding part of DirectShow, allowing previously impossible effects such as reverse playback, and true seamless playback of multiple files, to be performed with ease..\nCodec crash recovery - Poorly implemented codecs can cause an access violation to occur when playing a corrupted or badly formed media file. We provide a mechanism for quickly recovering playback where the error occurred..\n'Ion' Media Presentation Layer - The standard subsystems used for displaying video and playing audio in DirectShow ('VMR' and 'Default DirectSound Device' filters) have been replaced with our own proprietary audio and video renderers, to overcome flaws such as video tearing, problems with multimonitor setups, and audio/video going out of sync..\nPulldown stabilizer - In conjunction with our own vertical blank synchronization logic, this ensures the most solid video playback possible within a multitasking operating system, indistinguishable from that of dedicated hardware video players. The MS Windows operating system provides timers which are accurate to 1/1000 of a second at best, but at a standard monitor refresh rate of 72hz this limited accuracy can cause video to unnecessarily judder for a total of about 7% of playback time when the monitor beam approaches the top/bottom of the screen. We provide an automatic mechanism for counteracting this previously ignored problem.. ","torrent":{"xt":"urn:btih:ac853108da961ef917f6481ea9fa2bffa62e5801","amp;dn":"NeuView+Media+Player+Pro+V6.0.8.0254+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac853108da961ef917f6481ea9fa2bffa62e5801","infoHashBuffer":{"type":"Buffer","data":[172,133,49,8,218,150,30,249,23,246,72,30,169,250,43,255,166,46,88,1]},"announce":[],"urlList":[]}}