{"title":"Icon Lover v5.34 - Final Incl Serial - {K!llERoY512}","uid":8627063,"size":11092959,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:adc62b1baf1f6ba6c1a866d2612b6f6e25d2aa68&amp;dn=Icon+Lover+v5.34+-+Final+Incl+Serial+-+%7BK%21llERoY512%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KilleR512","files":3,"time":1372535048,"description":"[img]http://yuq.me/users/21/716/wBAnhFzLd3.png[/img]\n\n[img]http://i.imgur.com/CeTv53x.jpg[/img]\n\n[size=200][b]Icon Lover v5.34 - Final Incl Serial - {[color=red]K!llERoY512[/color]}[/b][/size]\n\n[quote][b][color=green]Icon Editor to Make Icons for Windows\n\nCreate High-Quality Icons for Windows[/color]\n\n[color=black]IconLover is a powerful, yet easy to use icon editor for making your own icons for any operating system, including Windows, Mac OS, UNIX/Linux and iPhone. It creates native Windows icons (ICO format) of all sizes, up to 256x256 used in Windows 8 and Windows 7, and native MacOS icons (ICNS format) up to 512x512 pixels (this size is used in the latest Mac OS &quot;Leopard&quot; and &quot;Snow Leopard&quot; versions). UNIX/Linux and iPhone use icons in PNG format which is fully supported by IconLover - you can create icons in this format from scratch or convert the existing Windows and Mac OS icons to PNG.\n\nNumerous advanced features including support for variable transparency, built-in drop shadow, smoothing, roll, mirror and other effects, support for multi-layer images, ability to import and export a variety of image formats and batch processing of icons make IconLover the tool of choice for many professional icon designers.[/color][/b][/quote]\n\n[quote][b][color=green]Create and Edit Animated GIFs[/color]\n[color=black]IconLover features native support for GIF animation. You can use this icon software to create animated images, banners and buttons in almost no time.[/color][/b][/quote]\n\n[quote][b][color=green]Create and Edit Bitmap Images for Web and Other Uses[/color]\n[color=black]IconLover can also be used for creating and editing bitmap images in a variety of formats: BMP, JPEG, GIF, PNG, TGA, TIFF etc. It supports transparency and a full range of other format-specific features.[/color][/b][/quote]\n\n\n[quote][b][color=green]Support for Windows 8 and Windows 7 compressed PNG Icons[/color]\n[color=black]IconLover fully supports the compressed PNG format recommended for 256x256 icons in Windows 8 and Windows 7. It helps reduce the overall size of the file without sacrificing image quality and preserves alpha channel transparency.[/color][/b][/quote]\n\n[quote][b][color=green]Automatically Make Icons from Images[/color]\n[color=black]Some designers prefer working with familiar software and then import the resulting image to IconLover and convert it to icons. With support for a variety of image formats, including Adobe Photoshop (PSD), IconLover enables icon designers easily convert images to icons.[/color][/b][/quote]\n\n[quote][b][color=green]Export Icon to Bitmap Images[/color]\n[color=black]You can also use IconLover to open Windows and Mac OS icon files (ICO, ICNS) and export them to common bitmap formats for use on a website, blog, application splash-screen etc.[/color][/b][/quote]\n\n[quote][b][color=green]Convert Icons between Windows[/color]\n[color=black]Full support for Windows (ICO) icon formats enables designers to use IconLover for easy conversion of icons between these operating systems. You can open a Mac OS icon in this icon software and save it for use on a Windows PC, and vice versa.[/color][/b][/quote]\n\n[quote][b][color=black]-::[/color] [color=green]With IconLover 5.34, you can[/color] [color=black]::-[/color]\n[color=black]Manage icons, static and animated cursors, icon and cursor libraries and image lists\nCreate and edit smooth semi-transparent icons, static and animated cursors for Windows\nCreate and edit icons in standard and custom sizes, with color depth up to 32-bit True Color\nCreate and edit animated GIF images\nMake stylish icons from your images\nPaint images with gradients and fills\nCreate multi-layer images\nModify images with drop shadow, opacity, smoothing, negative, grayscale, colorization, rotation, roll and mirror, round corners effects\nImport and export ICO, BMP, JPEG, ANI, CUR, GIF, PNG, TGA, TIFF, WMF, WBMP, XPM, XBM and Adobe Photoshop PSD image formats\nImport Mac OS icons from ICNS and RSRC files\nMake icons in ICNS format for Mac OS\nManage icon libraries for better and more efficient image storage\nExtract icons from Windows executables, libraries and animated cursor files, ZIP and RAR archives\nExport icon captions to text files\nDownload icons from the Internet\nModify icons inside executables\nSearch in folders for icons and cursors\nConvert or apply effects to multiple icons at once\nCustomize desktop and folder icons\nNo internet activation required[/color][/b][/quote]\n\n[quote][b][color=green]System requirements :[/color] [color=black]Windows PC[/color][/b][/quote]\n\n[quote][b][color=black]Homepage :[/color][/b] [url]http://www.aha-soft.com/iconlover/[/url][/quote]\n\n[img]http://doridro.com/imghost/files/49480.png[/img]\n[quote][b][color=black][1][/color] [color=green]Install The App[/color]\n[color=black][2][/color] [color=green]Enter Serial[/color]\n[color=black][3][/color] [color=green]Enjoy This Release!!![/color][/b][/quote]\n\n\n[img]http://yuq.me/users/21/716/RpE2NkrVvW.gif[/img]\n\n[img]http://yuq.me/users/21/716/l9N64TJIMX.gif[/img]\n\n[img]http://yuq.me/users/21/716/Ckzojaq3bY.gif[/img]","torrent":{"xt":"urn:btih:adc62b1baf1f6ba6c1a866d2612b6f6e25d2aa68","amp;dn":"Icon+Lover+v5.34+-+Final+Incl+Serial+-+%7BK%21llERoY512%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adc62b1baf1f6ba6c1a866d2612b6f6e25d2aa68","infoHashBuffer":{"type":"Buffer","data":[173,198,43,27,175,31,107,166,193,168,102,210,97,43,111,110,37,210,170,104]},"announce":[],"urlList":[]}}