{"title":"The Teaching Company- Jewish Mysticism - Prof Kalman Bland","uid":5362030,"size":322069838,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:af057275072435c9a2d0c9f72f269b9e3d0cecb9&amp;dn=The+Teaching+Company-+Jewish+Mysticism+-+Prof+Kalman+Bland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1266140043,"description":"Kalman P. Bland, Ph.D.\n\nDirector, Center for Judaic Studies\n\nDuke University\n\nKalman P. Bland was born in Chicago, IL in 1942. He received a Bachelor's Degree\nin Philosophy from Columbia University and a Bachelor's Degree from the Jewish\nTheological Seminary of America in New York City in 1964. He was awarded a\nMaster of Hebrew Letters Degree from the Jewish Theological Seminary in 1967,\nand the following year was ordained a Rabbi. Continuing his concentration in the\nHistory of Jewish Philosophy and Mysticism, Dr. Bland attended Brandeis\nUniversity where he earned a Doctoral Degree in Medieval Jewish-Islamic\nPhilosophy in 1971.\n\nHis experiences include teaching courses in Jewish Theology at the Jewish\nTheological Seminary, and a course in Medieval Jewish Philosophy at the\nReconstructionist Rabbinical College in Philadelphia. He has taught for two years at Indiana University, as well as The University of North Carolina at Chapel Hill.\nSince 1977, he has been a faculty member at Duke University where he served as\nChairman of the Department of Religion for six years. Currently, he is the Director\nof Duke's Center for Judaic Studies. He also regularly teaches in the Masters of\nArts Program in Liberal Studies. In 1986, he was honored with a Distinguished\nUndergraduate Teaching Award.\n\nCOURSE OBJECTIVES\n\nThese lectures begin by offering an historians answers to two rather\nstraightforward questions: What is Jewish about Jewish Mysticism (Kabbalah)?\nWhat is mystical about Jewish Mysticism? The lectures end with an historians\nattempt to understand our contemporary fascination with such arcane subjects.\nAlong the way, the major trends in Late Antique, medieval, early modern, and\nmodern Jewish mysticisms are introduced. Their characteristic beliefs and\nmeditational techniques are described. The audience may reasonably expect to\ncome away from these lectures having learned something useful about the academic\nstudy of religion, the complexity of Judaism's creative impulses, and the astonishing resources of human imagination as it struggles to de-habituate the everyday in order to discover infinities in grains of sand. Honoring the liberal injunction to let nothing human be alien to us, these lectures are designed to demystify the Kabbalah. They do not seek to judge whether the Kabbalah is morally good or bad, healthy-minded or pathological, philosophically true or empirically false, but to discover what made the Kabbalah possible or attractive to its adherents and implausible or repellent to its opponents. Being an optimist, the lecturer assumes that, just as we are not obliged to become triangles in order to grasp the Pythagorean Theorem, we need not be Jewish Kabbalists in order to fathom Jewish Mysticism.\n\n\nA mere handful of lectures cannot do justice to the two-thousand years of\nJewish history during which a plethora of mystical traditions evolved. They cannot\nchart the many striking parallels and the equally striking dissimilarities between the Kabbalah, Christian mysticism, Sufism, Hinduism, and Buddhism. But they can\nmake visible the otherwise hidden processes by which medieval Jewish mystics-like\ntheir counterparts, the medieval Jewish philosophers and theologians-transformed\nthe heritage of biblical and rabbinic Judaism. With ingenious legerdemain, they\naligned it with ancient mythic consciousness and newfangled metaphysical doctrines\nthat stressed the conflict between outer appearances and inner realities. \n\nThe lectures can suggest something of the competition between the philosophic and mystical traditions and explain why mysticism succeeded where philosophy failed. The lectures can also catch glimpses of Jewish history through the lens of the mystics, just as they can identify some of the mystical factors shaping Jewish communal life and ritual practice. Perhaps most importantly of all, the lectures can provide members of the audience with sufficient historical background, technical terminology, and clarification of fundamental concepts to allow them to confront critically the primary sources of Jewish Mysticism as they become more readily available every day. Being an optimist, the lecturer hopes so.","torrent":{"xt":"urn:btih:af057275072435c9a2d0c9f72f269b9e3d0cecb9","amp;dn":"The+Teaching+Company-+Jewish+Mysticism+-+Prof+Kalman+Bland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af057275072435c9a2d0c9f72f269b9e3d0cecb9","infoHashBuffer":{"type":"Buffer","data":[175,5,114,117,7,36,53,201,162,208,201,247,47,38,155,158,61,12,236,185]},"announce":[],"urlList":[]}}