{"title":"Strength Revolution: An Unconventional Guide to Strength and Con","uid":13842548,"size":4439045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af1285644c39fe8563cd11b5b4d78cb671bd8019&amp;dn=Strength+Revolution%3A+An+Unconventional+Guide+to+Strength+and+Con&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1457818382,"description":"Strength Revolution: An Unconventional Guide to Strength and Conditioning\r\n\r\n\r\n\r\n\r\nEmre Bardakci is a Biomedical Engineer and a black belt with 20 plus years of strength and conditioning experience. Emre spent 12 years in Eastern Europe studying various martial arts and unconventional strength and conditioning methods of elite Eastern European combat sports athletes. To enhance his understanding of Biomechanics, Emre completed his Bachelor's and Master's degree at The Catholic University of America in Biomedical Engineering, focusing on Biomechanics. Emre has competed at the international level and produced numerous National and International medalists in combat sports. This book includes the author's experiences while training in Eastern Europe and the philosophy of Eastern European unconventional training methods. This book mainly contains a list of exercises that the author found to be very beneficial for combat athletes. These methods can be beneficial for anyone that is trying to build a functional strength for various sports. It can also be a great tool to change up regular routines for most athletes. This book will help you become faster, stronger and more effective in your sport","torrent":{"xt":"urn:btih:af1285644c39fe8563cd11b5b4d78cb671bd8019","amp;dn":"Strength+Revolution%3A+An+Unconventional+Guide+to+Strength+and+Con","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af1285644c39fe8563cd11b5b4d78cb671bd8019","infoHashBuffer":{"type":"Buffer","data":[175,18,133,100,76,57,254,133,99,205,17,181,180,215,140,182,113,189,128,25]},"announce":[],"urlList":[]}}