{"title":"Heavier Than Heaven[Team Nanban][TPB]","uid":7203694,"size":1115265,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af126dbdfd70362c0e03db92c0e56486f2001c90&amp;dn=Heavier+Than+Heaven%5BTeam+Nanban%5D%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"594mgnav","files":3,"time":1335021865,"description":"Heavier Than Heaven[Team Nanban][TPB]\n\n PDF | 417 PAGES | Charles R. Cross |\n\n\nDESCRIPTION:\n\nThe art of Nirvana's Kurt Cobain was all about his private life, but written in a code as obscure as TS Eliot's. \nIn Heavier than Heaven Charles Cross has cracked the code, and this definitive biography is an all-access pass to \nCobain's heart and mind. It reveals many secrets, thanks to 400-plus interviews, and even quotes Cobain's diaries and \nsuicide notes revealing an unreleased Nirvana masterpiece. At last we know how he created, how lies helped him die, \nhow his family and love life entwined with his art--plus, what the heck &quot;Smells Like Teen Spirit&quot; really means. \n(It was graffiti by Bikini Kill's Kathleen Hanna after a double date with Dave Grohl, Cobain, and the &quot;over-bored and \nself-assured&quot; Tobi Vail, who wore Teen Spirit perfume; Hanna wrote it to taunt the emotionally clingy Cobain \nfor wearing Vail's scent after sex--a violation of the no-strings-attached dating ethos of the Olympia, Washington, \n&quot;outcast teen&quot; underground. Cobain 's stomach-churning passion for Vail erupted in six or so hit tunes like &quot;Aneurysm&quot; \nand &quot;Drain You&quot;.) Cross uncovers plenty of news, mostly grim and gripping. As a teenager, Cobain said he \nhad &quot;suicide genes&quot; and his clan was peculiarly defiant: one of his suicidal relatives stabbed his own belly in front of \nhis family, then ripped apart the wound in the hospital. Cobain was contradictory: a sweet, popular teenage athlete \nand sinister berserker, a kid who rescued injured pigeons and laughingly killed a cat, a talented yet astoundingly \nmorbid visual artist. He grew up to be a millionaire who slept in cars (and stole one), a fiercely loyal man \nwho ruthlessly screwed his oldest, best friends. Cross, the co-author of Nervmind: Nirvana, the definitive book about \nthe making of the classic album, puts numerous Cobain-generated myths to rest. (Cobain never lived under a bridge--that \nAberdeen bridge immortalised in the 12th song on Nevermind was a tidal slough, so nobody could sleep under it). \nHe gives the fullest account yet of what it was like to be, or love, Kurt Cobain. Heavier than Heaven outshines \nthe also indispensable Come As You Are. It's the deepest book about pop's darkest falling star.\n\n\nPLZ SEED AFTER DOWNLOADING...\n\n&quot;SHARING IS CARING&quot;\n\n\nif u like my releases, then add +rep to me in this link.\n      &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=277915&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=277915&lt;/a&gt;\t","torrent":{"xt":"urn:btih:af126dbdfd70362c0e03db92c0e56486f2001c90","amp;dn":"Heavier+Than+Heaven%5BTeam+Nanban%5D%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af126dbdfd70362c0e03db92c0e56486f2001c90","infoHashBuffer":{"type":"Buffer","data":[175,18,109,189,253,112,54,44,14,3,219,146,192,229,100,134,242,0,28,144]},"announce":[],"urlList":[]}}