{"title":"breaking.bad.s05e15.core74.mp4","uid":8965747,"size":322707768,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af2ce90383840247954129f597b6bf27343fec93&amp;dn=breaking.bad.s05e15.core74.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hardcore74","files":1,"time":1380217357,"description":"Marie confronts Skyler, telling her that Walt is in custody. Skyler brings in Walt Jr. and tells him the truth about his father. They return home only to find Walt hastily packing their bags, explaining to them that they need to go. Skyler deduces that Hank has been killed, and pulls a kitchen knife on Walt. They fight, and Walt flees. He uses a contact of Saul's to assume a new identity, moving to a secluded cabin in New Hampshire. Skyler is threatened by Todd and his gang, and they demand that she not mention Lydia to the DEA agents. Jesse cooks for Todd, and tries to escape his captivity. He is caught, and as a punishment Todd kills Andrea in front of him. Walt decides to call Walter Jr., who hangs up on him after accusing Walt of killing Hank. Walt calls the Albuquerque DEA office in order to surrender. He sees Elliott and Gretchen on TV in a Charlie Rose interview where they both deny Walt had any major contribution to Gray Matter besides the name. The police arrive at the bar to find no trace of Walter.","torrent":{"xt":"urn:btih:af2ce90383840247954129f597b6bf27343fec93","amp;dn":"breaking.bad.s05e15.core74.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af2ce90383840247954129f597b6bf27343fec93","infoHashBuffer":{"type":"Buffer","data":[175,44,233,3,131,132,2,71,149,65,41,245,151,182,191,39,52,63,236,147]},"announce":[],"urlList":[]}}