{"title":"Clash of the titans (nl subs!) by dutch_subbed","uid":6416494,"size":741624309,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:afa6d7c297c0b4450f876498602791bdcde8e0eb&amp;dn=Clash+of+the+titans+%28nl+subs%21%29+by+dutch_subbed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dutch_subbed","files":-1,"time":1306181208,"description":"Geboren als een god, maar opgevoed als een mens probeert Perseus (Sam Worthington) hulpeloos zijn familie te redden van Hades (Ralph Fiennes), de wraakzuchtige god van de onderwereld. Perseus biedt zich vrijwillig aan om deel te nemen aan een levensgevaarlijke missie om Hades te vermoorden, voordat die de macht van Zeus (Liam Neeson) kan grijpen, om zo de aarde in een hel te laten veranderen en prinses Andromeda (Alexa Davalos) van haar leven te beroven. Bijgestaan door Io (Gemma Arterton), een mysterieuze spirituele gids leidt de missie Perseus en zijn groep strijders op een gevaarlijke reis diep de verboden wereld in. Daar moeten ze vechten tegen heidense demonen en andere beesten die geen gevaar vrezen. Perseus zal zijn bestaan en zijn macht als die van een god moeten accepteren en zijn eigen lot moeten creÃƒÂ«ren, wil hij het uiteindelijk gaan redden...\n\n\nA film adaption of the myth of Perseus and his quest to battle both Medusa and the Kraken monster to save the Princess Andromeda. \n\n\n\nMY first upload on pirate bay!\nPlz seed becuz if i wanna grow i need ure seeds!\n\nAlso download text document for trouble shooting.","torrent":{"xt":"urn:btih:afa6d7c297c0b4450f876498602791bdcde8e0eb","amp;dn":"Clash+of+the+titans+%28nl+subs%21%29+by+dutch_subbed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afa6d7c297c0b4450f876498602791bdcde8e0eb","infoHashBuffer":{"type":"Buffer","data":[175,166,215,194,151,192,180,69,15,135,100,152,96,39,145,189,205,232,224,235]},"announce":[],"urlList":[]}}