{"title":"Escape of the Living Dead [Complete]","uid":8636023,"size":130731121,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b03cb6aba461e3c7aedb55fc28956a003c96e382&amp;dn=Escape+of+the+Living+Dead+%5BComplete%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RobbieDee","files":-1,"time":1372744975,"description":"- Contains all issues of Escape of the Living Dead from issues #1-5 and Airborne from #1-3. Also includes Annual and Fearbook. Published by Avatar Press.\n\nGenre: Zombie/Horror\n\n**I don't own or take credit for any of the content contained in this torrent, all credit goes to the creator(s) of the comic.**\n\n\nEscape of the Living Dead:\n\n It's been three years since the blood-soaked night that the dead rose from their graves, attacking and devouring the living. Now, the legacy of that horrific and unexplained event is about to be unleashed once again upon an unsuspecting world... But this time, there may be no escape for those in the terrifying clutches of the cannibalistic, living dead! Hidden within the concrete walls of a secret medical research lab, someone has been studying the last remaining undead remnants of the marauding zombie army.\n\n\nEscape of the Living Dead - Airborne:\n\nIn 1971, the zombie virus continues to spread into the back country of Pennsylvania and a bus load of hippies and flower children headed for San Francisco. After taking a detour and their bus becoming stuck in the mud, the flower children are attacked by a couple of flesh-hungry zombies. Surrounded in the dark, they will continue to fight the zombies even as they fall, one by one...\n\n\nEscape of the Living Dead - Fearbook:\n\nBefore he was one of the undead, he was one of the living and now, the secrets of Escape Of The Living Dead's breakout zombie star are revealed! Deadhead, the enigmatic, Stars and Stripes-wearing leader of the army of the walking dead is not like his rotting brethren. Something burns within him, something beyond the hunger for human flesh, something that the zombie multitude recognizes as a power that even they should fear. In the continuation of creator John Russo's saga of The Living Dead, the murder of the man that is Deadhead will be exposed as we witness the horrific events that now drive him in his inexhaustible pursuit of human entrails... and vengeance! \n\n\nEscape of the Living Dead - Annual:\n\nThe sleepy Pennsylvania town of Jamesville is about to face the most horrific night in its history. A natural disaster of unprecedented proportions strikes as fetid flood waters from a collapsed reservoir inundates the town, trapping the local residents in a nightmarish fight for their lives. But in those raging waters that threaten to erase the town's very existence, something far more terrifying surfaces from the muck and devastation... Something undead... And hungry for human flesh! \n\n\n\n","torrent":{"xt":"urn:btih:b03cb6aba461e3c7aedb55fc28956a003c96e382","amp;dn":"Escape+of+the+Living+Dead+%5BComplete%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b03cb6aba461e3c7aedb55fc28956a003c96e382","infoHashBuffer":{"type":"Buffer","data":[176,60,182,171,164,97,227,199,174,219,85,252,40,149,106,0,60,150,227,130]},"announce":[],"urlList":[]}}