{"title":"Democracy Now - 01 feb 2012","uid":7002481,"size":449993248,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b122f30e525441b2a81fbe6cc01d621bf0f61666&amp;dn=Democracy+Now+-+01+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1328116762,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 01, 2012\n\n- Romney Wins Florida GOP Primary\n- Obama Visits U.S. Automakers in D.C., Praises Industry Rebound\n- U.S. Intelligence Chief: Iranian Leaders More Willing to Attack United States\n- NATO Report: Prisoners Say Pakistan Aiding Taliban\n- Russia Challenges Syria Measure at U.N. Security Council\n- Egypt: Dozens Wounded in Pro-Democracy March\n- Bahraini Protesters On Hunger Strike Are Tear-Gassed in Prison Cells\n- WikiLeaks Founder Julian Assange Battles Extradition in U.K. Court\n- Breast Cancer Charity Faces Backlash After Defunding Planned Parenthood\n- 12 Charged in Occupy Oakland Protests\n- Judge Rejects Attempt to Block Camping Ban on Occupy D.C.\n\n\nSpecial reports\n\n- Romney Gains Momentum With Florida Win, But Gingrich Vows Prolonged Fight\n\nMitt Romney beat Newt Gingrich by 14 percent last night in the Florida primary, but he has yet to win a majority of votes in in any state contest so far and Gingrich has vowed to continue his fight. The Florida vote was the first contest of the year where only registered Republicans could participate, with independents and crossover Democrats restricted from casting ballots in the primary. \\&quot;The Florida primary is a very big one for Mitt Romney,\\&quot; says David Bernstein, political writer for the Boston Phoenix who has covered Romney for years. \\&quot;They knew he was not likely to win a lot of states in the south, some of the conservative Midwest, so Florida was really the one place where they thought they had to win, and with Florida, they feel like the rest of the states really add up in their favor from this point.\\&quot;\n\n\n- Exploring Mitt Romney\\'s Shifting Stances From \\&quot;Moderate\\&quot; Governor to GOP Frontrunner\n\nAs Mitt Romney surges in his bid for the Republican nomination, we take an in-depth look at his career and political record with reporter David Bernstein of the Boston Phoenix who has covered Romney for many years. Bernstein details Romney\\'s shifting stances over the years on a number of key political issues to appease Republican voters in his bid for the party\\'s nomination. \\&quot;The basic [Obamacare] system is entirely taken from what he did\\&quot; with healthcare reform as Massachusetts governor, says Bernstein. Regarding Romney\\'s Mormon faith, Bernstein says, \\&quot;Last time in the 2008 election, he really was trying to win over ... Christian conservatives down in the South and in Iowa. And he tried to talk to them about his Mormonism and he tried to convince them that it was not that different from their religion. It really did not take.\\&quot;\n\n\n- Baltasar Garzon, Trailblazing Judge Who Pursued War Criminals, Faces Trial of His Own in Spain\n\nSpanish Judge Baltasar Garzon is known for ordering the arrest of Chilean dictator Augusto Pinochet and seeking to indict members of the George W. Bush administration for their role in torturing prisoners. Now, Garzon himself is facing trial himself, in Madrid, after right-wing groups objected to his investigation of atrocities committed by supporters of the dictator Francisco Franco. Garzon has used the doctrine of universal jurisdiction to investigate war crimes and torture across national lines. \\&quot;The irony here, of course, is that he is being prosecuted in Spain for trying to apply the very principles that he so successfully promoted internationally,\\&quot; says Reed Brody of Human Rights Watch, who has been in the courtroom observing Garzon\\'s trial.\n\n\n- Is Former Haitian Dictator Jean-Claude \\&quot;Baby Doc\\&quot; Duvalier Off the Hook For Human Rights Crimes?\n\nA Haitian judge announced Monday former Haitian dictator Jean-Claude \\&quot;Baby Doc\\&quot; Duvalier will face trial for corruption, but will not face any charges for the murders, disappearances, torture and other human rights abuses committed during his 15-year rule because the statute of limitations has expired. \\&quot;Unless this ruling is overturned on appeal, it\\'s just going to be another confirmation to people in Haiti that the justice system is always on the side of the rich and powerful, and doesn\\'t serve even to punish the worst atrocities,\\&quot; says Reed Brody of Human Rights Watch. \\&quot;For Jean-Claude Duvalier to come back to Haiti and not be prosecuted is a slap in the face to the thousands of people who were killed and tortured under his rule.\\&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\nÃƒÂ³","torrent":{"xt":"urn:btih:b122f30e525441b2a81fbe6cc01d621bf0f61666","amp;dn":"Democracy+Now+-+01+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b122f30e525441b2a81fbe6cc01d621bf0f61666","infoHashBuffer":{"type":"Buffer","data":[177,34,243,14,82,84,65,178,168,31,190,108,192,29,98,27,240,246,22,102]},"announce":[],"urlList":[]}}