{"title":"TTC - String Quartets of Beethoven","uid":6656880,"size":1061865825,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b17c988cecc739922bd1c840a324cd56a020a36b&amp;dn=TTC+-+String+Quartets+of+Beethoven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"programa","files":25,"time":1315352354,"description":"TTC - String Quartets of Beethoven\nBy Robert Greenberg\n\n\nFormat: MP3\n\n\nIn his 16 quartets for two violins, viola, and cello, Beethoven created a Mount Everest for string players and some of the most sublime, unforgettable music ever written. Continuing to astound listeners after 200 years, these glorious quartets give voice to the innermost landscape of the human heart and spirit. They stand, like Michelangelo's statues or the plays of Shakespeare, at the pinnacle of Western art.\n\nThese history-making pieces revolutionized the string quartet as an art form, bringing to it bold new musical resources and expressive content. In these works, Beethoven mastered, then transcended, the accepted musical norms, creating the quartets as both a trailblazing manifesto of personal expression and a daring challenge to the Western conception of music itself.\n\nHow can we get the most from these intriguing masterpieces? In their mold-breaking construction and rich complexity, how can we find our way to their essence and hear them with full understanding?\n\nIn The String Quartets of Beethoven, Professor Robert Greenberg, composer and celebrated music historian at San Francisco Performances, guides you in a deep encounter with these majestic works of art, offering you the rare opportunity to grasp the musical riches and spiritual greatness of the quartets in a clear and accessible way. Speaking with passion, profound insight, and refreshing informality, Dr. Greenberg reveals the secrets of these multifaceted works in this lectures, aided at every turn by the masterful interpretations of the Alexander String Quartet.\n\n\n24 Lectures\n45 minutes / lecture \n\n\n(The quartets can be downloaded here http://thepiratebay.se/torrent/6653464)","torrent":{"xt":"urn:btih:b17c988cecc739922bd1c840a324cd56a020a36b","amp;dn":"TTC+-+String+Quartets+of+Beethoven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b17c988cecc739922bd1c840a324cd56a020a36b","infoHashBuffer":{"type":"Buffer","data":[177,124,152,140,236,199,57,146,43,209,200,64,163,36,205,86,160,32,163,107]},"announce":[],"urlList":[]}}