{"title":"Holocaust (1978) miniserie Dvd 2/5 (NL subs) 2Lions-Team","uid":5635438,"size":4204661449,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b1d0d2a62c80e5a0136919a6feeacbd14673cf3e&amp;dn=Holocaust+%281978%29+miniserie+Dvd+2%2F5+%28NL+subs%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Pioen","files":-1,"time":1276869576,"description":"Holocaust (1978) miniserie Dvd 2/5       \n \n \n  Verenigde Staten\nDrama / Oorlog\n475 minuten (miniserie, 5 delen)\n\ngeregisseerd door Marvin J. Chomsky\nmet Meryl Streep, Michael Moriarty en James Woods\n\nHet verhaal volgt de ellende van de Joodse familie Weiss in Nazi-Duitsland. De familieleden ondervinden allen de gevolgen van de nieuwe Nazi-regels en zien de mensen in hun omgeving ÃƒÂ©ÃƒÂ©n voor ÃƒÂ©ÃƒÂ©n aan een afschuwelijk lot ten ondergaan. De jonge advocaat Eric Dorf wordt ondertussen opgenomen in de SS, waar hij verandert in een moorddadige machine.\n\nEnglish\n\nDr. Josef Weiss, a Polish ÃƒÂ©migrÃƒÂ©, is a successful general practitioner in 1935 Berlin where he lives with his wife Berta, her parents, and their three children. When his oldest son Karl marries Aryan German Inga, he is confronted by Anti-Semitism but rationalizes it and the family makes the decision not to leave the country. Erik Dorf, husband of one of the doctor's German patients, is a struggling lawyer who seeks employment and social mobility by joining the nascent but powerful Nazi Party. Within three years things have changed drastically in Germany. The doctor initially is forbidden to treat Aryan patients, and ultimately his office is closed down and his practice co-opted by an ethnic German. His home, including Berta's beloved piano, is confiscated, and son Karl is arrested. Although he pleads with Dorf to help him get his son released, he is turned down and ultimately deported to Poland to be reunited with his brother Moses. Berta, along with daughter Anna and son Rudy, is forced to live in a single room on the charity of Inga's family. Frustrated, Rudy leaves to somehow resist Nazi oppression. Daughter Anna is raped by German soldiers and sinks into a depressive, uncommunicative state. She is institutionalized and, in accordance with Nazi policy, is euthanized with other &quot;mental defectives.&quot; Ultimately Berta is sent to Auschwich to be reunited with her husband. Meanwhile Erik, utilizing his skill with semantics and euphemistic terminology continues to rise in the Nazi hierarchy as the protÃƒÂ©gÃƒÂ© of war criminal Reynhard Heidrich. He distances himself emotionally from the horrors of ethnic cleansing as the Nazis move inexorably toward solving the &quot;Jewish Problem&quot; with the &quot;Ultimate Solutiom.&quot; \n\n\n\n\nOriginele DVD 5\n\nFormaat Full 4:3\nAudio : Dolby Digital 2:0\nMenu : Ja\nTaal : Engels\nOndertiteling : Ja Nederlands\nLengte hoofdfilm C.A 446 Minuten\nDVD : Pal\nKleur : Ja \nCover : Ja\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nOorlog\n \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/27586&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/27586&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0077025&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0077025&lt;/a&gt; \n\n*****************************************\n\nBrought to you by \nPioen\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\n\n\n \n \n \n","torrent":{"xt":"urn:btih:b1d0d2a62c80e5a0136919a6feeacbd14673cf3e","amp;dn":"Holocaust+%281978%29+miniserie+Dvd+2%2F5+%28NL+subs%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1d0d2a62c80e5a0136919a6feeacbd14673cf3e","infoHashBuffer":{"type":"Buffer","data":[177,208,210,166,44,128,229,160,19,105,25,166,254,234,203,209,70,115,207,62]},"announce":[],"urlList":[]}}