{"title":"Full Catastrophe Living - John Kabat-Zinn - ebook HTML Mobipocke","uid":4922995,"size":6137118,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1ec0cb4387a7d9ba51605a506bccd4ef287fe15&amp;dn=Full+Catastrophe+Living+-+John+Kabat-Zinn+-+ebook+HTML+Mobipocke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":27,"time":1243743905,"description":"I've read _Full Catastrophe Living_ through, and I review it often, so it I thought it would be convenient to have a copy on my Kindle. Unfortunately, the book is not available for the Kindle, so I decided to make my own, and share with others who've purchased the book and would like it in a digital format.\n\nI've enclosed _Full Catastrophe Living_ in three formats:\n\n  - Markdown (ASCII Text)\n \n  - HTML (with images)\n\n  - Mobipocket (with images)\n\n(If you're not familiar with Markdown, a plain text format for composing for the web, see &lt;http://daringfireball.net/projects/markdown/&gt;).\n\nI haven't thoroughly proofed the text. I skimmed it to fix formatting errors, and I ran it through two different spell checkers. There are probably still a few minor errors lurking about.\n\nEnjoy!\n\nKabat-Zinn, founder of the Stress Reduction Clinic at the University of Massachusetts Medical Center, is perhaps the best-known proponent of using meditation to help patients deal with illness. (The somewhat confusing title is from a line in Zorba the Greek in which the title character refers to the ups and downs of family life as &quot;the full catastrophe.&quot;) But this book is also a terrific introduction for anyone who has considered meditating but was afraid it would be too difficult or would include religious practices they found foreign. Kabat-Zinn focuses on &quot;mindfulness,&quot; a concept that involves living in the moment, paying attention, and simply &quot;being&quot; rather than &quot;doing.&quot; While you can practice anything &quot;mindfully,&quot; from taking a walk to cleaning your house, Kabat-Zinn presents several meditation techniques that focus the attention most clearly, whether it's on a simple phrase, your breathing, or various parts of your body. The book goes into detail about how hospital patients have either improved their health or simply come to feel better despite their illness by using these techniques, but these meditations can help anyone deal with stress and gain a calmer outlook on life. &quot;When we use the word healing to describe the experiences of people in the stress clinic, what we mean above all is that they are undergoing a profound transformation of view,&quot; Kabat-Zinn writes. &quot;Out of this shift in perspective comes an ability to act with greater balance and inner security in the world.&quot; --Ben Kallen  \n","torrent":{"xt":"urn:btih:b1ec0cb4387a7d9ba51605a506bccd4ef287fe15","amp;dn":"Full+Catastrophe+Living+-+John+Kabat-Zinn+-+ebook+HTML+Mobipocke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1ec0cb4387a7d9ba51605a506bccd4ef287fe15","infoHashBuffer":{"type":"Buffer","data":[177,236,12,180,56,122,125,155,165,22,5,165,6,188,205,78,242,135,254,21]},"announce":[],"urlList":[]}}