{"title":"Gershon Kingsley - God Is A Moog","uid":4973936,"size":313487800,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b251336e8e2993fc73df2ba46c9533c0336d2c22&amp;dn=Gershon+Kingsley+-+God+Is+A+Moog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"troncrawdaddy","files":36,"time":1245902624,"description":"Gershon Kinglsey - God Is A Moog\n\nThis is my first torrent. Could not find this anywhere online (weird, because it's public domain and not copyrighted in any way), so I just bought it from the record store I work at and ripped it. \n\nAll MP3s are in 320kbps CBR, so you can enjoy this bizarre and overtly religious (yet subtly psychedelic) series of moog-meets-bible compositions. \n\nThe following is the review of &quot;God Is A Moog&quot;, taken from www.allmusic.com\n\nAlthough religious leaders might disagree, if God Is a Moog, then Gershon Kingsley is His inarguable high priest and this two-CD set is the congregation's Psalter. Disc one comprises a series of numbers never before released, the earliest grouping -- the five &quot;Maven&quot; pieces, dating back to 1972. All featuring cantor Harold Orbach, with these pieces Kingsley sets about sublimely reinventing Yiddish folk songs, breathing new life and meaning into these long-loved numbers. The Yiddish culture was annihilated by Hitler, but Judaism survived, and the &quot;Jewish Experience&quot; with it. Jewish history, of course, is told in book after book of the Bible, leaving it to Proverbs to describe the Jewish life and how it should be lived. And thus it is Proverbs that cantor (and former actor) Norman Atkins quotes on the &quot;Experience&quot; pieces, while Kingsley's Moog emphasizes, queries, and accompanies his words. Serenity, majesty, an ancient world long gone, a future yet to come -- all this and more are conjured up by these pieces. But in the sleeve notes, Kingsley notes the contradiction at the center of Judaism, a universal God for a sole chosen people. And so, as the millennium ended, the Moog master queried God's very Oneness, on the pounding techno piece &quot;The First Commandment,&quot; then followed through his thoughts with &quot;Is There Only One?,&quot; a blend of competing vocals featuring a Jewish cantor, Gregorian chants, and a Catholic choir. Yet for such irreverence, Jewish rituals still seemed to hold meaning for the artist, as 1968's Shabbat for Today well illustrated, celebrating the Jewish sabbath in rock opera fashion. Bright and bouncy, Shabbat's new agey feel and happy pop sound was very much a creature of its time; in fact, it epitomized it, and unlike the more timeless music on the first disc, this reissue on the second disc sounds more than a little dated. The Fifth Cup, also included in full here, suffers from the same fate, at least musically, but its themes of liberation and warnings of freedom's loss are startlingly up to date. Cup, too, was a rock opera revolving around a religious ritual, in this case, the Passover seder. Kingsley utilized the seder's evocation of the Jews' enslavement in Egypt and their eventual liberation as a dramatic prop to question contemporary oppression, poverty, and the erosion of civil liberties. Which means the opening &quot;1984 -- One, One Is One&quot; could have been written this morning. A spiritual journey, a grand musical adventure, looking back at the past, reinventing the future, God Is a Moog will leave you questioning, searching, reconsidering, and seeing the world anew.","torrent":{"xt":"urn:btih:b251336e8e2993fc73df2ba46c9533c0336d2c22","amp;dn":"Gershon+Kingsley+-+God+Is+A+Moog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b251336e8e2993fc73df2ba46c9533c0336d2c22","infoHashBuffer":{"type":"Buffer","data":[178,81,51,110,142,41,147,252,115,223,43,164,108,149,51,192,51,109,44,34]},"announce":[],"urlList":[]}}