{"title":"FLV to AVI MPEG WMV 3GP MP4 iPod Converter 5.3[Activated][xk3nve","uid":7142515,"size":5512573,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b2bafa0065069f89660faea9ad24bcf85926c901&amp;dn=FLV+to+AVI+MPEG+WMV+3GP+MP4+iPod+Converter+5.3%5BActivated%5D%5Bxk3nve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xk3nvel0x","files":2,"time":1333049829,"description":"FLV to AVI MPEG WMV 3GP MP4 iPod Converter is a professional FLV converter software which can convert Flash Video FLV to AVI, FLV to MPEG, FLV to WMV, FLV to MP4 format.\n\nIt also supports convert FLV file to popular video formats including AVI, MPEG, WMV, DivX, Xvid, ASF, 3GP, MP4, iPod, PSP, Zune and convert FLV to audio formats MP3, WMA and WAV.\n\nFLV to AVI MPEG WMV 3GP MP4 iPod Converter is powerful, easy to use software which helps you convert flv file downloading from Youtube and you can watch Youtube video on your Cell Phone, iPod, PSP, Zune, MP4 player anywhere and anyway.\n\nIf you get trouble with Windows Media player in playing your FLV file, the FLV Converter is really what you need! All conversion processes such as FLV to AVI, FLV to MPEG, FLV to WMV, FLV to iPod are very easy and fast with high quality.\n\n\nKey Functions\n\n    * Youtube FLV Converter\n      You can use FLV to AVI MPEG WMV 3GP MP4 iPod Converter to convert video files downloading from youtube into other video/audio formats such as Youtube FLV to AVI Converter, Youtube FLV to MPEG Converter, Youtube FLV to WMV Converter, Youtube FLV to 3GP Converter, Youtube FLV to iPod Converter, Youtube FLV to MP3 Converter, etc.\n    * Converts Flv to Videos - FLV to AVI Converter, FLV to MPEG Converter, FLV to WMV Converter\n      Batch conversion for FLV to AVI, MPEG, WMV, DivX, Xvid, ASF, 3GP, MP4, iPod, PSP, Zune video formats.\n    * Converts Flv to Audios - FLV to MP3 Converter, FLV to WMA Converter, FLV to WAV Converter\n      Batch conversion for FLV to MP3, M4A, WMA, AMR, WAV audio formats.\n\nKey Features\n\n    * Super fast conversion speed provided as it full supports Intel Pentium D Dual-Core Processor and AMD Athlonâ„¢ 64 X 2 Dual-Core Processor which ensures full use of your CPU\n    * Flash Video Converter and Encoder for internet.\n    * Batch files conversion\n    * Inside flv decoder\n    * High-speed encoder ensures smooth conversion of video and audio data\n    * Super fast speed and excellent output quality are provided by the FLV converter\n    * You can select video size, bit rate, NTSC/PAL, frame rate, audio codec, sample rate etc.\n    * Custom define the output audio volume.\n    * Add Letterbox to keep aspect ratio.\n    * Support Drag and Drop\n    * Shutdown computer automatically when job is done\n    * Simple GUI and very EASY to use\n\n\nHow to:\n\n1) Install the application and it's already activated, you don't need to use a key or crack\n2) Enjoy your converter fully working :P :&gt;\n\nMore on info.txt file","torrent":{"xt":"urn:btih:b2bafa0065069f89660faea9ad24bcf85926c901","amp;dn":"FLV+to+AVI+MPEG+WMV+3GP+MP4+iPod+Converter+5.3%5BActivated%5D%5Bxk3nve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2bafa0065069f89660faea9ad24bcf85926c901","infoHashBuffer":{"type":"Buffer","data":[178,186,250,0,101,6,159,137,102,15,174,169,173,36,188,248,89,38,201,1]},"announce":[],"urlList":[]}}