{"title":"How Electronic Things Work And What To Do When They Don't.pdf Go","uid":8702838,"size":4106750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2c7cdbe1148d025cc0c445cb85bab800af0b753&amp;dn=How+Electronic+Things+Work+And+What+To+Do+When+They+Don%27t.pdf+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1374088355,"description":"Robert Goodman | McGraw-Hill/TAB Electronics | 2011-10-17 | 426 pages | English | PDF\n\n\nElectronic equipment 'on the blink'? Don't junk it or pay sky-high repair costs - fix it yourself! Here's a guide to understanding and repairing electronics equipment written for people who would ordinarily 'call the shop'. With this fully illustrated, simple-to-use guide, you will get a grasp of the workings of the electronics world that surrounds you - and even learn to make your own repairs. And you may even start enjoying it! Whether you want to pocket the savings on repair bills, give your beloved equipment the best possible care, or merely understand how it all works, this book will show you how in easy-to-understand language and clear illustrations - and you don't need any technical experience. Written by a technician who has fixed virtually everything that plugs into a wall, this handy do-it-yourself introduction to home and office repair delivers: clear explanations of how things work, written in everyday language; easy-to-follow, illustrated instructions on using test equipment to diagnose problems; guidelines to help you decide for or against professional repair; tips on protecting your beloved equipment from lightning and other electrical damage; and, lubrication and maintenance suggestions. This is an 'Electronics 101' for true beginners. Next time your equipment acts up, don't get mad. Get it working - with a little help from this book. This book features how to understand (and fix): color TVs, DVDs, wireless cellular phones and PDAs, radios, speaker systems, audio/video tuners, CD players, monitors, camcorders, copiers, and fax machines.","torrent":{"xt":"urn:btih:b2c7cdbe1148d025cc0c445cb85bab800af0b753","amp;dn":"How+Electronic+Things+Work+And+What+To+Do+When+They+Don%27t.pdf+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2c7cdbe1148d025cc0c445cb85bab800af0b753","infoHashBuffer":{"type":"Buffer","data":[178,199,205,190,17,72,208,37,204,12,68,92,184,91,171,128,10,240,183,83]},"announce":[],"urlList":[]}}