{"title":"Reality Kings - Money Talks - Pay For Play.mp4","uid":8419187,"size":650636805,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b34cf9c845aa0164ceceecb90bfd9573cb648da2&amp;dn=Reality+Kings+-+Money+Talks+-+Pay+For+Play.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Q88.","files":1,"time":1367130873,"description":"Release date: 12/05/2009\n\nRating: 8.8\n\n&quot;It is that time again and for this update we are going to bring you some of the best parts of our invasion of the Exxxotica 09 convention. It is amazing what porn fans will do for money, and we got a hand full of ladies to jump on stage with us and act a fool. After that we took a little ride with Havoc in search of a nice couple willing to take a crash course in driving stick. The only catch is that we have to use the guys cock as the stick shift and the girl has to drive topless. After that we get two sisters to show us exactly how close they are by doing the unthinkable, we convinced them to apply chap stick to one another butt holes and then apply the same stick to their lips, the results are fucking hilarious. For this weeks juicy porn scene we got a really good one. While waiting at the greyhound station for one of out buddies we met up with two smoking hot babes with one big problem. One of them got their bags lost and is in desperate need of some cash to continue their trip to New York. Lucky for them they met up with us, and after a little persuasion they agreed to come back to our place for the chance to make some cold hard cash. Let just say they made enough money to travel to New York and back while sipping champagne in first class. Dont miss a minute because this update is action packed.&quot;","torrent":{"xt":"urn:btih:b34cf9c845aa0164ceceecb90bfd9573cb648da2","amp;dn":"Reality+Kings+-+Money+Talks+-+Pay+For+Play.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b34cf9c845aa0164ceceecb90bfd9573cb648da2","infoHashBuffer":{"type":"Buffer","data":[179,76,249,200,69,170,1,100,206,206,236,185,11,253,149,115,203,100,141,162]},"announce":[],"urlList":[]}}