{"title":"Jonathan Creek Series 5 complete dwmusic","uid":10170223,"size":872313365,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b3b3cea1f0d59e9b0b78a88bedff5d119b1ec566&amp;dn=+Jonathan+Creek+Series+5+complete+dwmusic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dwmusic","files":-1,"time":1400393289,"description":"E01 The Letters of Septimus Noone: \nThe Mystery of the Yellow Room, based on a 19th-century story by Gaston Leroux, is currently thrilling London theatre audiences with its enticing blend of music, romance and sizzling Gothic melodrama. But events take a sinister turn one night when the show's glamorous singing sensation Juno Pirelli is found horribly stabbed inside a locked dressing room, from which no assailant could possibly have escaped. No weapon or any other evidence of an intruder can be found, nor any rational explanation for the victim's wounds. As the actress's life hangs in the balance, her producer and colleagues remain baffled. And attention once again turns to the lateral-thinking Jonathan Creek for a solution to the whole grisly puzzle. But can Creek - now a happily married man - even be persuaded to embark upon the investigation? As he and his wife Polly struggle to come to terms with a sudden personal tragedy, a series of dark and disturbing family secrets are about to emerge that will throw the...\n\nE02 The Sinner and the Sandman:\nolly and Jonathan move into her father's house in the country, a move which begins badly when Jonathan accidentally frees two burglars. The Creeks attend a parish council meeting where they learn that local lottery winner and community benefactor Leonard Corbyn has been arrested for indecent offences and later Jonathan visits grumpy old psychic Eric Ipswich who has a stroke and is hospitalized. Whilst helping Polly's friend Alison Chater and her vicar husband the Creeks are amazed to find Corbyn's winning lottery numbers written on a wall by Ipswich some half a century earlier. As Polly starts to have nightmares about childhood bogey-man the Sandman, the parish magazine declares sightings of a sinister nocturnal beast on the prowl. Jonathan finds that the numbers on the wall are pure coincidence, based on a phone number written by Eric when he took a message and that the lottery ticket belongs to a Salvation Army captain, Corbyn picking it up when the man dropped it.\n\nE03 The Curse of the Bronze Lamp\nKidnappers posing as musicians infiltrate the birthday party of government minister Rowan Isherwood and abduct his communications expert wife Lindsay, holding her to ransom. At the same time Polly is perturbed when she overhears Horace's twin sisters Heidi and Laurel plot something which sounds sinister and she is even less happy when Jonathan invites to dinner TV weather girl Daisy Shand, an old friend whose baby he delivered. The meal is interrupted by a call from the Creeks' cleaner Denise, whose young male escort has died in the bath and Polly helps her return the corpse home. He is in possession of a ring belonging to Lindsay and Jonathan and Daisy work out that she put it in a balloon which she sent off to pinpoint where she is being held. As a result she is saved whilst Polly finds that the Greeley sisters' secret was a revival of their stage act.","torrent":{"xt":"urn:btih:b3b3cea1f0d59e9b0b78a88bedff5d119b1ec566","amp;dn":"+Jonathan+Creek+Series+5+complete+dwmusic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3b3cea1f0d59e9b0b78a88bedff5d119b1ec566","infoHashBuffer":{"type":"Buffer","data":[179,179,206,161,240,213,158,155,11,120,168,139,237,255,93,17,155,30,197,102]},"announce":[],"urlList":[]}}