{"title":"Hired  Team  Trial  Gold","uid":8906103,"size":809672742,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b685b83b47d2d303f4d471c1d8da42e9fd8e812b&amp;dn=Hired++Team++Trial++Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":-1,"time":1378908897,"description":"Title: Hired Team: Trial Gold\nGenre: FPS / action / sci-fi\nReleased: 30th April 2002\nDeveloper: New Media Generation\nPublisher: New Media Generation\nDescription:\nPolice and Special Forces have been redered helpless against the new breed of terrorism. With civilization on the brink of collapse, only a new highly skilled force can stop the chaos.\n\nYou have been selected to participate in a highly confidential training program. Only an elite group of candidates have been afforded this opportunity. Should you survive the rigurous training, you will join the ranks of the world's top counter-terrorism force - Hired Team.\n\nFight your way through 28 incredibly detailed maps. Heavy fire power - choose from a huge arsenal of weapons. Great single or multiplayer game modes, including: deathmatch, team deathmatch, capture the flag, domination, and team capture the flag. Internet and LAN play. Shine technology - the Shine 3D engine brings enhanced detail and redenring for smoother gameplay.\n\nHow to play:\n1) Mount or burn disc image HTTG.bin;\n2) Run HttHTT.exe from the disc and install the game (or use the autorun menu if it opens);\n3) Run HTTGPatch2_200-G.EXE and patch the game (make sure you install it to the game folder);\n4.1) Play the game with the disc inserted; OR\n4.2) Extract Crack.zip to where you installed the game (overwrite the original file) and play the game without the disc (no in-game music).\n\n! Notice\nI had to run the game in a window on Windows 7 x64 to play it properly, in fullscreen mode there were graphical glitches. To configure the game run Setup.exe, in the Bin folder where you installed the game.","torrent":{"xt":"urn:btih:b685b83b47d2d303f4d471c1d8da42e9fd8e812b","amp;dn":"Hired++Team++Trial++Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b685b83b47d2d303f4d471c1d8da42e9fd8e812b","infoHashBuffer":{"type":"Buffer","data":[182,133,184,59,71,210,211,3,244,212,113,193,216,218,66,233,253,142,129,43]},"announce":[],"urlList":[]}}