{"title":"Van Halen - 1984 (1984) [LOSSLESS FLAC] [Tntvillage]","uid":5313139,"size":271266772,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6f396bd501c307dc850bc3ca76358e9fa52be9c&amp;dn=Van+Halen+-+1984+%281984%29+%5BLOSSLESS+FLAC%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RDaneel20","files":13,"time":1264620778,"description":"Van Halen - 1984 (1984) [LOSSLESS FLAC] [Tntvillage.Scambioetico]\n\n\n\nVisit this link: More info on this torrent\n\nVisit this link: All My Torrent\n\n\n\nVan Halen - 1984\n\n\nby RDaneel\n\n\n\n\n\n\n\n\n[::Album Information::]\n\nTitle: 1984\nYears: 1984 (2000 HDCD remastered version)\nGenre: Hard Rock\nProduction: Warner Bros Records\n\n\n\n[::Tracklist::]\n\n1. 1984 (Halen, Halen, Anthony, Roth) - 1:08\n2. Jump (Halen, Halen, Anthony, Roth) - 4:04\n3. Panama (Halen, Halen, Anthony, Roth) - 3:33\n4. Top Jimmy (Halen, Halen, Anthony, Roth) - 3:02\n5. Drop Dread Legs (Halen, Halen, Anthony, Roth) - 4:15\n6. Hot For Teacher (Halen, Halen, Anthony, Roth) - 4:44\n7. I'll Wait (Halen, Halen, Anthony, Roth, Mc Donald) - 4:45\n8. Girl Gone Bad (Halen, Halen, Anthony, Roth) - 4:35\n9. House Of Pain (Halen, Halen, Anthony, Roth) - 3:19\n\n\n\n[::Review::]\n\n1984 (written as MCMLXXXIV on the front cover) is the sixth album by American hard rock band Van Halen. One of the band's more popular albums (in terms of both record sales and chart performance), 1984 is the final album (to date) featuring singer David Lee Roth, who later left the band in the spring of the following year because of escalating tensions between him and guitarist Eddie Van Halen, as well as Roth's desire to pursue a solo career.\nEddie Van Halen, well-known for his guitar prowess but also a classically-trained pianist, used 1984 as an opportunity to take the band into different territory. Additionally, 1984 was the first Van Halen album to be recorded at Eddie Van Halen's home studio, 5150. Eddie Van Halen's keyboard playing is more prominent on 1984 than on any prior Van Halen album, particularly on the songs &quot;Jump,&quot; &quot;I'll Wait&quot; and instrumental album-opener &quot;1984.&quot;\nThe title track &quot;1984&quot;, a short synth and effects instrumental (the effects had been used as part of Michael Anthony's live bass solo on the Diver Down tour); &quot;Girl Gone Bad&quot;, parts of which previously had been played during the same tour during performances of &quot;Somebody Get Me A Doctor&quot; (most famously at the US Festival show); the hard rock &quot;Drop Dead Legs&quot;, and &quot;Top Jimmy&quot;, a tribute to James Paul Koncek of the band Top Jimmy &amp; The Rhythm Pigs. The album concludes with &quot;House of Pain&quot;, a fast paced heavy song that dates back to the band's early club days of the mid '70s.\nThe engine noise heard during &quot;Panama&quot; was from Eddie revving up his Lamborghini. Microphones were used near the tailpipes.\nDuring an interview for the King Biscuit radio show in 1985, Eddie claimed to have written, &quot;Girl Gone Bad&quot; in a hotel room that he and Valerie had rented. Valerie was asleep, and Eddie woke up during the night with an idea, he had to put on tape. Eddie grabbed a small cassette recorder and recorded himself playing guitar while in the closet. He didn't want to wake Valerie.\nEddie also claims to have written the arrangement for Jump years before the album was recorded. Roth said he came up with the lyric because it was leap year, and because he saw a man on television wanting to commit suicide by jumping off a building.\nA slightly different version of, &quot;House of Pain&quot; had been recorded by the band years prior to the 1984 album being released. The song was demoed when the band recorded material for Gene Simmons.\n1984 peaked at #2 on the Billboard Magazine album charts (#1 at the time was Thriller, which featured an Eddie Van Halen guitar solo on &quot;Beat It,&quot; which Roth had criticized) and contained future hits &quot;Jump&quot;, &quot;Panama&quot;, &quot;I'll Wait&quot;, and &quot;Hot for Teacher&quot;. &quot;Jump&quot; reached #1 on the magazine's singles chart. 1984 is the second of two Van Halen albums to have sold 10 million copies in the United States.\n&quot;Jump&quot; was one of the most successful songs of 1984 and was on the 10 most played songs on the radio that year. As a single, it sold over three million copies alone, making it one of the most popular rock songs of that decade. &quot;Panama&quot; was the third single from the album and reached number 13 on the singles chart in June. The keyboard-driven &quot;I'll Wait&quot; was another single, reaching number 13 on the singles chart in March 1984. &quot;Hot for Teacher&quot;, a humorous song about a grade-school crush, was also a hit, reaching #56 on the Billboard Hot 100, as well as spawning a popular MTV video starring pre-teen lookalikes of the band members. It's also featured on the game Guitar Hero: World Tour.\n\nSome retail stores in the UK refused to stock the album due to the album's artwork being a cherub smoking. A sticker was placed over the artwork.","torrent":{"xt":"urn:btih:b6f396bd501c307dc850bc3ca76358e9fa52be9c","amp;dn":"Van+Halen+-+1984+%281984%29+%5BLOSSLESS+FLAC%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6f396bd501c307dc850bc3ca76358e9fa52be9c","infoHashBuffer":{"type":"Buffer","data":[182,243,150,189,80,28,48,125,200,80,188,60,167,99,88,233,250,82,190,156]},"announce":[],"urlList":[]}}