{"title":"Hogtied------HT-29370 Bella Rossi","uid":8284015,"size":3831430602,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b7a9f4830520b7c1df3a077e2a6e420e49ab62a4&amp;dn=Hogtied------HT-29370+Bella+Rossi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1363903685,"description":"\nBimbo With Big Tits Gets Wrecked!\n\nMar 21, 2013 - Performers: Bella Rossi \n\n\nMP4 and WMV + Pics.\n\n\nWhat do you do with an ungrateful and sassy cunt that just wants to get off? You tie the bitch up and give it to her hard. In her first predicament, cunt is bound in a breast / hair / elbow / crotch rope bondage predicament. First in heels she prances around with all too easy of an effort. The shoes come off, making her tip toe uncomfortably. Enjoying her struggle, the ante is upped with giving the cunt a precarious wood pyramid to balance on as her feet, calves, and ass are caned. Add a vibrator, remove the pyramid, and watch the desperate struggle and pleasure unfold.\n\nSecond, our warmed up cunt is bound in an uncomfortable squat. Cruel labial clamps are attached and stretched very tight to her toes. A flip cat lashes her juicy ass and tits. The cunt tries desperately to avoid the pain... and we enjoy her desperation. All of her whore work pays off and she is rewarded with innumerable orgasms. She loses track of how many, so much so that she is barely able to communicate - stunned with pleasure.\n\nFinally, she is on her knees - in her rightful whore place. Unable to see the &quot;activities&quot; Claire has planned for her, she is terrorized with the tazapper. Her nice juicy ass is tanned to a bright red, prepping her for a strenuous bow style back arch suspension. Confronted again to succumb to the pleasure, she is a writhing drooling hot mess - completely controlled by the hands in her holes and the immense pleasure of the vibrator.\n\nScreens   &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=29370&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=29370&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:b7a9f4830520b7c1df3a077e2a6e420e49ab62a4","amp;dn":"Hogtied------HT-29370+Bella+Rossi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7a9f4830520b7c1df3a077e2a6e420e49ab62a4","infoHashBuffer":{"type":"Buffer","data":[183,169,244,131,5,32,183,193,223,58,7,126,42,110,66,14,73,171,98,164]},"announce":[],"urlList":[]}}