{"title":"Springer.Grids.Clouds.and.Virtualization.Sep.2010","uid":6812277,"size":4403695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7e0e18d1879fdb0dc58f3136412abad7bb51757&amp;dn=Springer.Grids.Clouds.and.Virtualization.Sep.2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1321078677,"description":" &lt;a href=&quot;http://www.wowebook.pro/book/grids-clouds-and-virtualization/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.wowebook.pro/book/grids-clouds-and-virtualization/&lt;/a&gt;\n\nBook Description\nResearch into grid computing has been driven by the need to solve large-scale, increasingly complex problems for scientific applications. Yet the applications of grid computing for business and casual users did not begin to emerge until the development of the concept of cloud computing, fueled by advances in virtualization techniques, coupled with the increased availability of ever-greater Internet bandwidth. The appeal of this new paradigm is mainly based on its simplicity, and the affordable price for seamless access to both computational and storage resources.\n\nThis timely text/reference introduces the fundamental principles and techniques underlying grids, clouds and virtualization technologies, as well as reviewing the latest research and expected future developments in the field. Readers are guided through the key topics by internationally recognized experts, enabling them to develop their understanding of an area likely to play an ever more significant role in coming years.\n\nTopics and features:\n\nPresents contributions from an international selection of experts in the field\nProvides a thorough introduction and overview of existing technologies in grids, clouds and virtualization, including a brief history of the field\nExamines the basic requirements for performance isolation of virtual machines on multi-core servers, analyzing a selection of system virtualization technologies\nExamines both business and scientific applications of grids and clouds, including their use in the life sciences and for high-performance computing\nExplores cloud building technologies, architectures for enhancing grid infrastructures with cloud computing, and cloud performance\nDiscusses energy aware grids and clouds, workflows on grids and clouds, and cloud and grid programming models\nPresents case-studies and novel results related to interoperability across grids and clouds\nThis useful text will enable interested readers to familiarize themselves with the key topics of grids, clouds and virtualization, and to contribute to new advances in the field. Researchers, undergraduate and graduate students, system designers and programmers, and IT policy makers will all benefit from the material covered.\n\nBook Details\nHardcover: 250 pages\nPublisher: Springer (September 2010)\nLanguage: English\nISBN-10: 0857290487\nISBN-13: 978-0857290489","torrent":{"xt":"urn:btih:b7e0e18d1879fdb0dc58f3136412abad7bb51757","amp;dn":"Springer.Grids.Clouds.and.Virtualization.Sep.2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e0e18d1879fdb0dc58f3136412abad7bb51757","infoHashBuffer":{"type":"Buffer","data":[183,224,225,141,24,121,253,176,220,88,243,19,100,18,171,173,123,181,23,87]},"announce":[],"urlList":[]}}