{"title":"$30 Writing School eBook","uid":4110194,"size":7845462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8c516264215cbfb744e3f3637b3fa0c6eb325cd&amp;dn=%2430+Writing+School+eBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kittyfeet1","files":1,"time":1207011091,"description":"$30 Writing School, by Michael W. Dean\n &lt;a href=&quot;\nhttp://www.amazon.com/30-Writing-School-Michael-Dean/dp/1592004865/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/30-Writing-School-Michael-Dean/dp/1592004865/&lt;/a&gt;\n\n\nPRODUCT DESCRIPTION: Are you aspiring to become a writer, but don&amp;#039;t know what it entails, how to approach it, or even where to begin? In compelling-yet-simple terms, this one-of-a-kind book offers the guidance you need to do all that and more. Following the successful and increasingly popular concept of D.I.Y. (Do It Yourself), &quot;$30 Writing School&quot; is designed to get you up and running on the process for organizing, writing, selling and promoting your own books. You&amp;#039;ll find it pleasantly easy to relate to author Michael W. Dean, who is a product of the &quot;indie&quot; revolution as a proven author, filmmaker, and musician himself. His unique style offers an edgier approach that you don&amp;#039;t find in your typical &quot;how to write&quot; book. Written in a conversational tone, techniques and explanations are liberally spliced with Dean&amp;#039;s personal accounts and stories. You&amp;#039;ll learn specific elements of how to get published including how to write a proposal, get an agent, get a publisher, and work through mainstream outlets. From the author&amp;#039;s perspective of having done it himself, self-publishing is explained and encouraged, from Quark layout, to working with a printer, to getting press and distribution. &quot;$30 Writing School&quot; accompanies two successful others of its kind, &quot;$30 Music School&quot; (1-59200-067-3) and &quot;$30 Film School&quot; (1-59200-171-8), both published by Course Technology PTR. This incomparable do-it-yourself approach to becoming a writer is realistic, straightforward, and inspiring. \n\n\nABOUT THE AUTHOR: Michael W. Dean is a true multimedia artist. He is the director of the films D.I.Y. OR DIE: How to Survive as an Independent Artist and HUBERT SELBY JR: It/ll Be Better Tomorrow. He toured the United States and Europe in 2002 and 2003 with D.I.Y. or DIE and recently debuted HUBERT SELBY JR: It/ll Be Better Tomorrow at the Deauville (France) American Film Festival. A prolific author, Dean&amp;#039;s previous books include $30 Music School and $30 Writing School, as well as the critically acclaimed novels Starving in the Company of Beautiful Women and The Simple Pleasures of a Complex Girl. He also co-wrote the book Digital Music DIY Now!, and he contributes to MAKE Magazine. Dean has been interviewed on NPR, BBC radio, and PBS, and was featured on NBC, VH1, and in Variety Magazine. He lectures at colleges, museums, and youth centers throughout America and Europe. Dean has always been interested in art -- before embarking on writing/filmmaking, he was the lead singer of Bomb (Warner Brothers). They released four albums.","torrent":{"xt":"urn:btih:b8c516264215cbfb744e3f3637b3fa0c6eb325cd","amp;dn":"%2430+Writing+School+eBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8c516264215cbfb744e3f3637b3fa0c6eb325cd","infoHashBuffer":{"type":"Buffer","data":[184,197,22,38,66,21,203,251,116,78,63,54,55,179,250,12,110,179,37,205]},"announce":[],"urlList":[]}}