{"title":"[MiamisJuiciest] Lisy (Latin ass fuck for a mango / 021128 / 200","uid":9748592,"size":988371643,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ba2f1167a84cb5f09772ab47fd1c552ccd0b6785&amp;dn=%5BMiamisJuiciest%5D+Lisy+%28Latin+ass+fuck+for+a+mango+%2F+021128+%2F+200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FluxXxu","files":1,"time":1394582909,"description":"[MiamisJuiciest] Lisy (Latin ass fuck for a mango / 021128 / 2009)\n\nThis week we present to you Lisy. The crew caught Lisy gathering mangos in Jmac's backyard. She was jumpy at first, but with theft and trespassing against her, I'm sure she was relieved when Sanchez started joking with her. Lisy is Dominican. She's one of the many cute and curvy Latinas you find in Miami (aka chunga). Sanchez jokingly offered her $100 dollars to stick a mango up her ass. Surprisingly, she took the challenge. She didn't actually shove the piece of fruit up her anus, but she held it with her fat butt cheeks and walked around. Once her ass was exposed, the game was on. Latinas love to show off the booty. Lisy danced around showing off her rump shaking skills, which lead to her showing off her perky brown titties, which lead to her walking around outside fully nude. After all of that, of course she was down to fuck Jmac. They started outdoors with a blowjob, but eventually had to take it inside. Jmac likes to make his girls scream, and there's no need to scare the neighbors. Jmac kept his rep by slaming this girls pussy. He fucked her good and hard and she loved it, but that's not were it ended. This little slut let Jmac in the backdoor. ANAL!!! I'm not talking about gentle 'at least I got it in' butt sex. I'm talking six sphincter stretching positions of hard pounding rough ass fucking. Lisy not only took it, but loved it. You can tell by the way she lapped up all of Jmacs cum when he gave her a huge facial. If you like Latinas, fat asses, aggressive sex, and hot anal, this is the movie for you. If not, you must be gay.\n\nAll Sex, Big Ass, Latina, Big Butts, Anal, Facial\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=80zaxdq9116u.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=80zaxdq9116u.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=igl3tol1h5is.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=igl3tol1h5is.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ba2f1167a84cb5f09772ab47fd1c552ccd0b6785","amp;dn":"%5BMiamisJuiciest%5D+Lisy+%28Latin+ass+fuck+for+a+mango+%2F+021128+%2F+200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba2f1167a84cb5f09772ab47fd1c552ccd0b6785","infoHashBuffer":{"type":"Buffer","data":[186,47,17,103,168,76,181,240,151,114,171,71,253,28,85,44,205,11,103,133]},"announce":[],"urlList":[]}}