{"title":"Ashayana Deane Preparing For Contact","uid":7636339,"size":10183185462,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ba8ce93b5b89b93448c808451acb73115b5eb5a9&amp;dn=Ashayana+Deane+Preparing+For+Contact&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GoAaT999","files":9,"time":1347654868,"description":"Introduction to the &quot;Arc Project&quot; &amp; Eieyani Mentorship Program, Featuring the MCEO Eieyani &quot;CONTACT&quot; Course, Level-1, and the ECKA Games. First in a new Series of &quot;How to&quot; Classes. Recorded en route to Stargate 3 and Bermuda, July 2002.\n\nAlmost 29 hours of intensive class-time, presenting 6 workshops and introducing exceptionally powerful, techniques which address the Guardians recommendations under Plan B and the necessity to prepare for Stargate and Portal transition for both self and other depenedent life forms.\n\nSubject areas include: Comprehending Contact; Facing Contact Realities; Opening-Healing the Personal &amp; Planetary Eye of Elohim; Wising Up-Making Contact; Withness and the Necessity of Higher Mind; Introduction to the Arc Project and Land Entrustment Contracts. Detail covers: Veca World's, Duality Systems &amp; Eternal, Immortal, Mortal and Parasitic Life-fields; Inner Ecka and Eckasha Worlds, Christiac-Eieyanic Unity Systems and Eternal Guardian Life Fields; &quot;Underworlds&quot;, Static-Duality Imploding Black Hole Systems and Devolving Life-fields; Stairways to Heaven and Wormholes to Hell; the Victim: Victimizer game, Lost Souls, Fallen Souls, Over-souls and Avatars; Surfing the Cosmic Inner Net; Astral Issues; Becoming Contact-able; Celebration or Seduction?; Genuine Contact; Simultaneous Selves &amp; Karma; Shadow healing &amp; Shadow Dancer Anatomy; the Flame of Amorea and Azurite Crystal; Mind mechanics; Finding and Using Your Capstone Nodes (self - test) to Improve HSP &amp; Contact; Contact Dynamics; Staying Sane through Understanding; Differentiation Skills; Attitudes, Ethics and Etiquette; &quot;Withness&quot; Accessing Higher Mind; Wayshowers &amp; Gatekeepers. ","torrent":{"xt":"urn:btih:ba8ce93b5b89b93448c808451acb73115b5eb5a9","amp;dn":"Ashayana+Deane+Preparing+For+Contact","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba8ce93b5b89b93448c808451acb73115b5eb5a9","infoHashBuffer":{"type":"Buffer","data":[186,140,233,59,91,137,185,52,72,200,8,69,26,203,115,17,91,94,181,169]},"announce":[],"urlList":[]}}