{"title":"Fiddler on the roof (DivX - HD) 1280 X 720p - moviesbyrizzo","uid":5945198,"size":2065149841,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:bbcfc3046378077b25b6232d5935aac6787af112&amp;dn=Fiddler+on+the+roof+%28DivX+-+HD%29+1280+X+720p+-+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":17,"time":1289337026,"description":"We are most happy to bring to you Norman Jewison's &quot;Fiddler on the roof&quot;\na movie celebrated not only by Jewish folk, but by all lovers of a great musical\nexperience.\n\nWe got a great conversion using the industry standard DivX Converter (Plus) from\nthe Divx corporations own website. Its a 1280 X 720 video with 192k audio - enough\nfor your own theatre experience at home or even at the community hall I would add\nas a suggestion for this scope of quality. Its converted from a 6.55GB MKV file source.\n\nThis is a movie that looks at the clash f cultures and at the oppression that \nis often vented in bigoted form against those you dont consider your own.\nThe families in this movie suffer much from what is the diaspora that is inflicted\non their community in what is hard to understand for those who are the victims of\nit all.\n\nThat all said, there is great music to enjoy, and a fun look at some cultural\nmores that have been part of the landscape in Europe for many centuries certainly.\n\nWe have included the soundtrack and found a musical score to include too, from\na quick search on the net for you.\n\n\nI personally often include &quot;Sunsrise Sunset&quot; in the list of songs I sing at\nKaraoke bars locally, including a great Hava nagila rendition I perform, in a manner to do you proud and that you would be thrilled with equally, if you\nlike this cultural experience too!\n\n\nMichael Rizzo Chessman\n","torrent":{"xt":"urn:btih:bbcfc3046378077b25b6232d5935aac6787af112","amp;dn":"Fiddler+on+the+roof+%28DivX+-+HD%29+1280+X+720p+-+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbcfc3046378077b25b6232d5935aac6787af112","infoHashBuffer":{"type":"Buffer","data":[187,207,195,4,99,120,7,123,37,182,35,45,89,53,170,198,120,122,241,18]},"announce":[],"urlList":[]}}