{"title":"The Anthony Cumia Show 2015-02-03 MP4 MP3 combo","uid":11680623,"size":323284286,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bbef5c4c864f31fb40599930d94b8b3ce2dd3f2e&amp;dn=The+Anthony+Cumia+Show+2015-02-03+MP4+MP3+combo+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1423069472,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Brent Weinbach\n\nEpisode 104: Tuesday starts by learning that insane ISIS burned one of their Jordanian hostages alive, Ant discusses Obama's lack of a plan, talks about social media's impact on propaganda, how other countries handle brutal behavior, and gathers that ISIS is bored of beheading. Ant tells us that he was surprised to see a shit-stirring video Bobo made at the compound regarding Opie and Jimmy's show, we learn about Big A's involvement, hear Bobo's call to Opie and Jimmy to explain himself and listen to their reaction, and the callers (including Stalker Patti and no-filter Paul) express their views. Ant briefly brings up Val Kilmer's throat tumor, Bruce Jenner transitioning into a freak, and then, comedian Brent Weinbach calls in to talk about his &quot;Gangster Party Line&quot; video, his short film &quot;I Don't Dance&quot;, the ease of releasing videos nowadays, and tells us about his upcoming work. While Ant adjusts himself, KtC talks about the &quot;Most Offensive Song&quot; contest and plays a few new entries, we then watch a video of bat shit crazy Randy Quaid, and end with a news story and clip of a dolphin seduction.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:bbef5c4c864f31fb40599930d94b8b3ce2dd3f2e","amp;dn":"The+Anthony+Cumia+Show+2015-02-03+MP4+MP3+combo+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbef5c4c864f31fb40599930d94b8b3ce2dd3f2e","infoHashBuffer":{"type":"Buffer","data":[187,239,92,76,134,79,49,251,64,89,153,48,217,75,139,60,226,221,63,46]},"announce":[],"urlList":[]}}