{"title":"Prokofiev: Symphony-Concerto, Cello Sonata - Han-Na Chang (2003)","uid":14646385,"size":318157788,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bc0a6e7ac0d26a0c9e3ba29bcbca5d03ba4aa9c4&amp;dn=Prokofiev%3A+Symphony-Concerto%2C+Cello+Sonata+-+Han-Na+Chang+%282003%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Scheheraz","files":22,"time":1463592550,"description":"SERGEI PROKOFIEV (1891-1953)\r\nSinfonia Concertante (Symphony-Concerto)\r\nSonata for Cello and Piano\r\n\r\nClassicsToday.com [6/21/2003]:\r\nArtistic Quality: 10 / Sound Quality: 10\r\n&quot;This review is going to be a bit more about my subjective impressions than I usually allow, so I want to ask your indulgence up front. Prokofiev's Sinfonia concertante has its supporters and detractors, but I have always fallen somewhere in the middle: I want to like it but the piece never has really worked for me. In particular, Rostropovich's unequalled intensity in the solo part always has been compromised by soft-edged or unsatisfactory accompaniments (or recordings). Recent performances have improved in that department, but even such famous and technically accomplished cellists as Yo-Yo Ma and Truls Mork never have equaled Rostropovich's abandon in the hellishly difficult and very, very long   scherzo central movement. However, Han-Na Chang and Antonio Pappano collaborate in a truly stunning performance that has all of the great Russian cellist's passion and urgency married (at last!) to an equally gutsy and idiomatic accompaniment, making the work a true &quot;sinfonia concertante&quot;, a contest of equals, for the very first time.\r\nNow if you have always loved this piece or think the above observations are simply nonsense, you can ignore all of the forgoing; but if you have yet to be won over or, like me, have been essentially sitting on the fence waiting for an epiphany, this performance may offer just the ticket. Start at the beginning, and note how Pappano has the LSO players give a nice staccato kick to the oft-repeated arpeggio ostinato that launches the work and recurs throughout the movement. The sense of forward progress, even in this predominantly lyrical introduction, receives additional assistance from Chang, who pours on the tone and phrases with impressive freedom and real Romantic ardor. Her attack on the scherzo is dazzling and totally uninhibited, an extraordinary essay in virtuosity, heightened by the sweetness and purity (in terms of both emotion and intonation) of its slower sections. The finale similarly achieves an all-too-rare feeling of inexorability, with Pappano holding nothing back in the closing pages as the orchestra brass propel the soloist into her highest register for the remarkable final bars. Wow!\r\nThe Cello Sonata, also an appealing and neglected work, makes the perfect coupling, with Pappano as pianist offering as dynamic and emotionally wide-ranging an accompaniment as he did as conductor in the Sinfonia concertante. EMI's sonics in the orchestral work are just about perfect, offering ideal balances and capturing perhaps just a bit too much of Chang's occasional heavy breathing--but I'm not going to let that prevent this performance from earning the highest rating. In the sonata, the cello dominates but there's plenty of room for the piano to expand sonically, and the louder sections reveal both players in good focus. As an offering for the 50th anniversary year of the composer's death in 1953, this release stakes a serious claim as the most important and rewarding yet. Don't miss it.&quot; --David Hurwitz\r\n\r\nSinfonia Concertante (Symphony-Concerto) in E minor Op.125\r\n1. I. Andante [10.07]\r\n2. II. Allegro giusto [16.46]\r\n3. III. Andante [9.58]\r\nSonata in C for Cello and Piano Op.119 *\r\n4. I. Andante grave - Moderato animato - Andante grave, come prima - Allegro animato [11.40]\r\n5. II. Moderato - Andante dolce - Moderato primo [4.49]\r\n6. III. Allegro, ma non troppo - Andantino - Allegro, ma non troppo [8.09]\r\nTotal Playing Time: 61.41\r\n\r\nHan-Na Chang, cello\r\nLondon Symphony Orchestra\r\nAntonio Pappano, *piano\r\n\r\nRecorded: 20-24 March 2002, No.1 Studio, Abbey Road. London\r\nProducer: David Groves\r\nRecording Engineer: Jonathan Allen\r\nEditors: Simon Kiln &amp; Raphael Mouterde\r\n® 2002 The copyright in this sound recording is owned by EMI Records Ltd.\r\n© 2008 EMI Records Ltd.\r\n5099951818920","torrent":{"xt":"urn:btih:bc0a6e7ac0d26a0c9e3ba29bcbca5d03ba4aa9c4","amp;dn":"Prokofiev%3A+Symphony-Concerto%2C+Cello+Sonata+-+Han-Na+Chang+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc0a6e7ac0d26a0c9e3ba29bcbca5d03ba4aa9c4","infoHashBuffer":{"type":"Buffer","data":[188,10,110,122,192,210,106,12,158,59,162,155,203,202,93,3,186,74,169,196]},"announce":[],"urlList":[]}}