{"title":"BBC Breakfast, Lunch And Dinner 3 of 3 Dinner 2012","uid":7945845,"size":735039669,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be75df6fdc9c36270315d7ca0ab850a800222ab4&amp;dn=BBC+Breakfast%2C+Lunch+And+Dinner+3+of+3+Dinner+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1356126196,"description":" &lt;a href=&quot;http://www.bbc.co.uk/programmes/bo1nz987&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.bbc.co.uk/programmes/bo1nz987&lt;/a&gt;\n\nClarissa Dickson Wright's latest culinary adventure reveals the origins and \ndevelopment of our three daily meals - breakfast, lunch and dinner. As a \nnation, we take them for granted, assuming that they have always existed as \nthey are now. But unpick each of these eating rituals, trace their lineage back \nthrough a thousand years of British history and you find fascinating and \nsurprising stories of social upheaval and shifting class structures, of \ntechnological developments and gastronomic revolutions.\n\nClarissa Dickson Wright completes her journey through the history of our \nmealtimes with dinner - our main meal of the day and also our showiest. Dinner \nis when we like to enjoy the finest dishes and exhibit our good taste even if, \nas Fanny Cradock understood, that involves a touch of snobbery. And, as \nClarissa discovers, some people nowadays resort to serving ready meals as if \nthey were their own culinary creations!\n\nBut although dinner is our most ritualistic meal, don't imagine that its \ntraditions are timeless and unchanged. In fact, it's a microcosm of 1,000 years \nof evolving customs. As she journeys back into history, Clarissa reveals that \nin the Middle Ages, even the most refined diners ate with their hands - we have \nthe Italians to thank for introducing us to the fork. Similarly, we have the \nhumble turnip to thank for making roast beef our historic national dish, and \nthe custom of eating dinner in series of separate courses only came to us via \nthe Russian ambassador to Paris in the nineteenth century. But most surprising, \nperhaps, is the fact that for centuries dinner was always served in daylight \nhours. The custom of eating it in the evening only came about because of the \nincreased availability of candles in Georgian times.\n\nSadly, we have the Victorians to blame for the poor reputation of British \ndinnertime cuisine, something that even pioneer TV cook Fanny Cradock could do \nnothing to dispel; and the rise in popularity of ready meals in our own time is \nnot likely to revive it. As she reaches the end of her journey, Clarissa \narrives at a typically outspoken conclusion about the current state of our \nmealtime traditions and what we need to learn from the customs of the past.\n","torrent":{"xt":"urn:btih:be75df6fdc9c36270315d7ca0ab850a800222ab4","amp;dn":"BBC+Breakfast%2C+Lunch+And+Dinner+3+of+3+Dinner+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be75df6fdc9c36270315d7ca0ab850a800222ab4","infoHashBuffer":{"type":"Buffer","data":[190,117,223,111,220,156,54,39,3,21,215,202,10,184,80,168,0,34,42,180]},"announce":[],"urlList":[]}}