{"title":"Archaeoastronomy: Introduction to the Science of Stars and Stone","uid":13088628,"size":11235548,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be88fb79eb6fad57dcdcee4de0f03d16076bada9&amp;dn=Archaeoastronomy%3A+Introduction+to+the+Science+of+Stars+and+Stone&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1450994339,"description":"Title: Archaeoastronomy: Introduction to the Science of Stars and Stones \r\nSeries: Undergraduate Lecture Notes in Physics \r\nAuthor: Giulio Magli \r\nFormat: PDF \r\nHardcover: 246 pages \r\nPublisher: Springer; 1st ed. 2016 edition (November 5, 2015) \r\nLanguage: English \r\nISBN: 9783319228815 \r\n\r\n\r\nThis book provides the first complete, easy to read, up-to-date account of the fascinating discipline of archaeoastronomy, in which the relationship between ancient constructions and the sky is studied in order to gain a better understanding of the ideas of the architects of the past and of their religious and symbolic worlds. The book is divided into three sections, the first of which explores the past relations between astronomy and people, power, the afterworld, architecture, and landscape. The fundamentals of archaeoastronomy are then addressed in detail, with coverage of the celestial coordinates; the apparent motion of the Sun, Moon, stars, and planets; observation of celestial bodies at the horizon; the use of astronomical software in archaeoastronomy; and current methods for making and analyzing measurements. The final section reviews what archaeoastronomy can now tell us about the nature and purpose of such sites and structures as Stonehenge, the Pyramids of Giza, Chichen Itza, the Campus Martius, and the Valley of the Temples of Agrigento. In addition, a set of exercises is provided that can be performed using non-commercial free software, e.g., Google Earth or Stellarium, and will equip readers to conduct their own research. Readers will find the book an ideal introduction to what has become a wide-ranging multidisciplinary science","torrent":{"xt":"urn:btih:be88fb79eb6fad57dcdcee4de0f03d16076bada9","amp;dn":"Archaeoastronomy%3A+Introduction+to+the+Science+of+Stars+and+Stone","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be88fb79eb6fad57dcdcee4de0f03d16076bada9","infoHashBuffer":{"type":"Buffer","data":[190,136,251,121,235,111,173,87,220,220,238,77,224,240,61,22,7,107,173,169]},"announce":[],"urlList":[]}}