{"title":"The Pickwick Papers - Charles Dickens (Penguin Classics)","uid":12556912,"size":11324437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bee7444d12d2eea58f8671a8111354345eba6fa8&amp;dn=The+Pickwick+Papers+-+Charles+Dickens+%28Penguin+Classics%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":3,"time":1444648639,"description":"'One of my life's greatest tragedies is to have already read Pickwick Papers - I can't go back and read it for the first time' Fernando Pessoa\r\n\r\nFew first novels have created as much popular excitement as The Pickwick Papers - a comic masterpiece that catapulted its twenty-four-year-old author to immediate fame. Readers were captivated by the adventures of the poet Snodgrass, the lover Tupman, the sportsman Winkle and, above all, by that quintessentially English Quixote, Mr Pickwick, and his cockney Sancho Panza, Sam Weller. From the hallowed turf of Dingley Dell Cricket Club to the unholy fracas of the Eatanswill election, via the Fleet debtors' prison, characters and incidents spring to life from Dickens's pen, to form an enduringly popular work of ebullient humour and literary invention. This edition is based on the first volume edition of 1837, and includes the original illustrations. In his introduction, Mark Wormald discusses the genesis of The Pickwick Papers and the emergence of its central characters.\r\n\r\nFor more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators","torrent":{"xt":"urn:btih:bee7444d12d2eea58f8671a8111354345eba6fa8","amp;dn":"The+Pickwick+Papers+-+Charles+Dickens+%28Penguin+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bee7444d12d2eea58f8671a8111354345eba6fa8","infoHashBuffer":{"type":"Buffer","data":[190,231,68,77,18,210,238,165,143,134,113,168,17,19,84,52,94,186,111,168]},"announce":[],"urlList":[]}}