{"title":"La Cosecha DVDRip Spanish 2007","uid":5334900,"size":732227584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf62cc6527429545fda75d0f5eca037e4d04ab6a&amp;dn=La+Cosecha+DVDRip+Spanish+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":1,"time":1265243747,"description":"Hace miles de aÃƒÂ±os se desencadenaron una serie de hechos inexplicables idendificados por muchos como las diez plagas bÃƒÂ­blicas. Nadie pensÃƒÂ³ que pudieran ocurrir otra vez hasta ahora...\nKatherine (Hilary Swank), antigua pastora protestante, dejÃƒÂ³ los hÃƒÂ¡bitos tras perder a su hija y a su marido cuando estaban de misiÃƒÂ³n en SudÃƒÂ¡n, y ahora busca respuestas por medio de la ciencia mÃƒÂ¡s que de la oraciÃƒÂ³n. Como profesora de universidad, se ha convertido en una autoridad en la refutaciÃƒÂ³n de fenÃƒÂ³menos religiosos. Hasta ahora, no hay misterio divino que no haya podido resolver. Sin embargo, cuando el maestro de escuela rural Doug Blackwell (David Morrissey) apela a su ayuda para esclarecer una serie de extraÃƒÂ±os sucesos que la gente de su pueblo cree que han sido enviados por Dios, Katherine y su compaÃƒÂ±ero Ben (Idris Elba) se dan cuenta de que a veces los milagros pueden ser traicioneros y que la lÃƒÂ­nea entre fe y supersticiÃƒÂ³n es peligrosamente delgada. Escondido entre los bosques y las tierras pantanosas de Louisiana, Haven es un pueblo en el que las reglas de la razÃƒÂ³n parecen haberse reescrito. Un niÃƒÂ±o ha muerto y el rÃƒÂ­o se ha vuelto sangre; esto es sÃƒÂ³lo el principio de lo que parece ser una reediciÃƒÂ³n de las diez plagas bÃƒÂ­blicas sobre el pueblo.    ","torrent":{"xt":"urn:btih:bf62cc6527429545fda75d0f5eca037e4d04ab6a","amp;dn":"La+Cosecha+DVDRip+Spanish+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf62cc6527429545fda75d0f5eca037e4d04ab6a","infoHashBuffer":{"type":"Buffer","data":[191,98,204,101,39,66,149,69,253,167,93,15,94,202,3,126,77,4,171,106]},"announce":[],"urlList":[]}}