{"title":"Michael Martin - Atheism, Morality, and Meaning","uid":11069040,"size":1818276,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c04958357fb0dc68bdbbb81add9df27a32780ef5&amp;dn=Michael+Martin+-+Atheism%2C+Morality%2C+and+Meaning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philosophi","files":-1,"time":1411243254,"description":"Michael Martin - Atheism, Morality, and Meaning\n\nDespite the pluralism of contemporary American culture, the Judaeo-Christian legacy still has a great deal of influence on the popular imagination. Thus it is not surprising that in this context atheism has a slightly scandalous ring, and unbelief is often associated with lack of morality and a meaningless existence. Distinguished philosopher and committed atheist Michael Martin sets out to refute this notion in this thorough defense of atheism as a both moral and meaningful philosophy of life. Martin shows not only that objective morality and a meaningful life are possible without belief in God but that the predominantly Christian world view of American society is seriously flawed as the basis of morality and meaning.\n\nDivided into four parts, this cogent and tightly argued treatise begins with well-known criticisms of nonreligious ethics and then develops an atheistic meta-ethics. In Part 2, Martin criticizes the Christian foundation of ethics, specifically the Divine Command Theory and the idea of imitating the life of Jesus as the basis of Christian morality. Part 3 demonstrates that life can be meaningful in the absence of religious belief. Part 4 criticizes the theistic point of view in general terms as well as the specific Christian doctrines of the Atonement, Salvation, and the Resurrection.\n\nThis highly informed and sophisticated defense of atheism is a stimulating challenge to religious believers and a serious contribution to ethical theory.","torrent":{"xt":"urn:btih:c04958357fb0dc68bdbbb81add9df27a32780ef5","amp;dn":"Michael+Martin+-+Atheism%2C+Morality%2C+and+Meaning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c04958357fb0dc68bdbbb81add9df27a32780ef5","infoHashBuffer":{"type":"Buffer","data":[192,73,88,53,127,176,220,104,189,187,184,26,221,157,242,122,50,120,14,245]},"announce":[],"urlList":[]}}