{"title":"Big Bill Morganfield - 2009 - Born Lover FLAC","uid":8606322,"size":289570344,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c0c81f4452aaf2baf42a52445376b729f670e3ec&amp;dn=Big+Bill+Morganfield+-+2009+-+Born+Lover+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1372024442,"description":"Big Bill Morganfield - 2009 - Born Lover \n\nBig Bill Morganfield continues to forge his own sound with a delicate balancing act on this, his forth album. He pays tribute to his dad and the Chicago sound he helped create on the title track, but he has a jazzy side that keeps moving the blues in a more sophisticated direction as well. Al Duncan's &quot;Too Late Brother&quot; opens things with a juke-joint rocker in the style of Morganfield's dad, with Steve Guyger's harp tossing some fat on the fire. &quot;High Gas Prices,&quot; a Morganfield original, gives the country blues an urban edge with a tune too many sang in the waning months of 2009. Morganfield sings Pearl Woods' &quot;I Play Dirty&quot; with a winning combination of humor and aggression, with Clark Stern's organ giving the tune a sanctified feel. &quot;Who's the Fool,&quot; another original, is a shuffle on the familiar subject of a faithless woman, and Morganfield growls out the lyric with plenty of panache. What really distinguishes Morganfield from his dad is his way with love songs. Muddy always sounded dangerous, even when he was proclaiming his passion. Big Bill's voice is smoother and more mellow, and when he sings a soulful tune like Buddy Guy's neo-R&amp;B ballad &quot;My Love Is Real,&quot; his voice has a seductive power his dad lacked. On Howlin' Wolf's &quot;My Last Affair&quot; he turns up the wattage and bares his tortured soul with a hopeless vulnerability that's enhanced by some stinging guitar work. Former Waters guitarist Bob Margolin, the man behind Morganfield's first two sets, produced the album and kept things grounded in the traditional Chicago sound. Guyger's harp is splendid throughout, but with three guitarists playing in the session -- Morganfield, Margolin, and Brian Bisesi -- some detailed liner notes would have been helpful to determine who's playing on the various tracks. (AllMusic)\n\nTrack list:\nTrack list:\n01 - Too Late Brother\n02 - High Gas Prices\n03 - My Love Is Real\n04 - Born Lover\n05 - You've Got The Nerve Of A Brass Monkey\n06 - My Last Affair\n07 - Peace Of Mind\n08 - I Play Dirty\n09 - Who's The Fool-\n10 - Lonesome Lonely Blues\n11 - X-rated Lover\n12 - One Kiss\n\nPersonnel:\nBig Bill Morganfield (vocals, guitar);\nBob Margolin, Brian Bisesi (guitar);\nSteve Guyger (harp);\nClark Stern (keyboards);\nTom Brill (bass instrument);\nChuck Cotton (drums).\n\nSplit with Medieval.\nEnjoy and share!","torrent":{"xt":"urn:btih:c0c81f4452aaf2baf42a52445376b729f670e3ec","amp;dn":"Big+Bill+Morganfield+-+2009+-+Born+Lover+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c81f4452aaf2baf42a52445376b729f670e3ec","infoHashBuffer":{"type":"Buffer","data":[192,200,31,68,82,170,242,186,244,42,82,68,83,118,183,41,246,112,227,236]},"announce":[],"urlList":[]}}