{"title":"Graham.Parker.-.Imaginary.Television.2010.LAME-233kbps","uid":5444726,"size":61730846,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c150ce2c28416392ec1853e54fa5e7bd12697735&amp;dn=Graham.Parker.-.Imaginary.Television.2010.LAME-233kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"novamdm","files":-1,"time":1268982920,"description":"Nearly 35 years after making Howlin' Wind, Graham Parker is certainly not an Angry Young Man anymore, but he's managed not to avoid becoming a Cranky Old Man, the fate time often forces upon youthful upstarts. Parker isn't significantly less cynical than he was in the 1970s and '80s, but he's matured into a witty realist who has ceased to be surprised by human failings while knowing there are still plenty of great stories to be found in them, and 2010's Imaginary Television has Parker sharing ten more new songs that confirm his craft and his skills are still strong. Parker isn't rocking very hard on Imaginary Television, but that's not to say he's not lively; &quot;Bring Me a Heart Again&quot; is a jazzy R&amp;B number that swings with quiet assurance, &quot;1st Responder&quot; is a snappy and surprisingly optimistic pop tune, and if &quot;It's My Party (But I Won't Cry)&quot; nods to a certain Lesley Gore oldie; it sounds admirably tough and has a solid swagger all its own. Imaginary Television is a stylistically modest affair, and that is clearly just the way Parker wanted it; the songs are good, but rather than knock himself out trying to convince us, he is willing to let their subtle qualities find their way to the surface, and his voice, while showing a bit of its age, is well-suited to the less aggressive, more intimate style of this work. Parker produced Imaginary Television with keyboard man Louie Hurwitz, and the results mesh well with these songs, with the arrangements and recording adding just enough support without overwhelming the melodies or the lyrics. And while Parker didn't write &quot;More Questions Than Answers&quot; (an old Johnny Nash tune), it sounds like it was made to order for him, and suits the album's smart, quietly witty tone very well. Imaginary Television isn't likely to win Parker any immediate converts like his classic albums of the '70s did, but it also leaves no room to doubt that the man still has anything to say and voice with which to say it -- plenty of artists have sustained long and healthy careers with albums significantly less interesting than this.\n\n01. Weather Report\n02. Broken Skin\n03. It's My Party (But I Won't Cry)\n04. Bring Me a Heart Again\n05. Snowgun\n06. Always Greener\n07. See Things My Way\n08. You're Not Where You Think You Are\n09. Head on Straight\n10. More Questions Than Answers\n11. 1st Responder\n\nAll albums have been tagged, MP3 GAINed, and optimized with MP3packer. &lt;a href=&quot;\nhttp://www.grahamparker.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.grahamparker.net/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:gifpxqr5ldhe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:gifpxqr5ldhe&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Graham_Parker&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Graham_Parker&lt;/a&gt;","torrent":{"xt":"urn:btih:c150ce2c28416392ec1853e54fa5e7bd12697735","amp;dn":"Graham.Parker.-.Imaginary.Television.2010.LAME-233kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c150ce2c28416392ec1853e54fa5e7bd12697735","infoHashBuffer":{"type":"Buffer","data":[193,80,206,44,40,65,99,146,236,24,83,229,79,165,231,189,18,105,119,53]},"announce":[],"urlList":[]}}