{"title":"Lynn Kurland Nine Kingdoms 07-08 mobi/epub","uid":10068591,"size":4787599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c28e1cf1e1d1beacd74de11de49bef79c3250cf7&amp;dn=Lynn+Kurland+Nine+Kingdoms+07-08+mobi%2Fepub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"calemgarity12","files":8,"time":1398817667,"description":"Lynn Kurland's Nine Kingdoms series, Trilogy 3, Volumes 07/08\n\n07 - Dreamspinner\n08 - River of Dreams\n\n(Just letting you know, with Dreamspinner I am having a few problems getting it to open at the very beginning the first time around, it seems to want to open at around page 20, so just a little warning that you will have to go back a few pages to get the very start ^^)\n\nThey are both in Mobi/Epub Files, with covers and metadata provided, they are also ready to be converted into PDF's if you so wish to view them on your computer.\n\nI just wanted to upload these Ebooks as a torrent as they are the continuation of a previous torrent of mine. Also, I went through quite a bit of trouble finding these and wanted to share them with you all. When the 3rd and last book of this trilogy is published I will make sure to find and upload it here with the others.\n\nSeed if you found this torrent useful in any way, I would appreciate it, I will be seeding this one 24/7 for the first few months, then its just depending on if I have a computer available, but if somewhere down the track there end up being no seeds and you wish to download, feel free to leave a comment, I will check here regularly. \n\nP.S all my torrents uploaded here are also on KAT if seeds are lacking here, there should be seeds there if you grab the trackers","torrent":{"xt":"urn:btih:c28e1cf1e1d1beacd74de11de49bef79c3250cf7","amp;dn":"Lynn+Kurland+Nine+Kingdoms+07-08+mobi%2Fepub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c28e1cf1e1d1beacd74de11de49bef79c3250cf7","infoHashBuffer":{"type":"Buffer","data":[194,142,28,241,225,209,190,172,215,77,225,29,228,155,239,121,195,37,12,247]},"announce":[],"urlList":[]}}