{"title":"Lily Wilde And Her Jumpin' Jubilee Orchestra - 1999 - Insect Bal","uid":10518132,"size":328108870,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c2feb23e010909ffc844c82d3c0c9eb79fad69d8&amp;dn=Lily+Wilde+And+Her+Jumpin%27+Jubilee+Orchestra+-+1999+-+Insect+Bal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1404933936,"description":"Lily Wilde And Her Jumpin' Jubilee Orchestra - 1999 - Insect Ball\n\n---Known as one of Portland's most respected rhythm &amp; blues singers, Lily Wilde has a long list of show business credits. Her father was jazz composer/arranger Calvin Jackson, who worked with a &quot;who's who&quot; of musical talent including Harry James, Lucille Ball, Errol Garner, Lionel Hampton, Leroy Vinnegar, Bobby Troup and Julie London, Johnny Otis and others. Surrounded by music, Lily turned pro at age 17. Not long after, she met Stevie Wonder and became a member of &quot;Wonderlove,&quot; his backup vocal group, touring and appearing on the landmark album, &quot;Music of My Mind.&quot; Later she spent several years working as a session singer and back-up vocalist, working with many name artists, including Ricky Lee Jones and saxophonist Lee Allen.\n---Lily eventually relocated to Seattle, where she became a mainstay of the rhythm &amp; blues scene. She spent three years as a member of local legends Junior Cadillac, touring Russia with the band in 1989. She also worked with Duffy Bishop, Little Bill &amp; The Blue Notes and many others, in addition to fronting her own bands. In 1991 the Washington Blues Society named Lily &quot;Entertainer of the Year&quot;. Lily moved to Portland in 1992 and quickly became a local favorite. In 1993 she received a Cascade Blues Society &quot;Muddy&quot; award as &quot;Female Vocalist of the Year.&quot; In 1998 Lily performed with a stellar line-up of vocalists including Nancy King, Dave Frishberg and Rebecca Kilgore in a special event called &quot;Vocal Madness&quot;. In February of 2001, she was a featured vocalist in the Oregon Symphony's &quot;POPS Series&quot; program &quot;Sing, Sing, Sing&quot;, which sold out all four performances at the Arlene Schnitzer Concert Hall. &quot;Jazzscene&quot;, the monthly magazine for the Jazz Society of Oregon, featured Lily as &quot;Musician of the Month&quot; in their March 2001 issue.\n---Lily and Her JJO have wowed audiences at the Waterfront Blues Festival, the Bite of Portland and at Bumbershoot in Seattle. They have performed at numerous benefits and galas for organizations, including Doernbecher Children's Hospital, The Oregon Ballet, St. Vincent dePaul, the Cascade Festival of Music, and The NW Film Center's International Film Festival. On April 25th, 2001and 2002, Lily and the McMenamins Kennedy School staged &quot;The Three Ellas&quot;, a birthday celebration in honor of Ella Fitzgerald which also featured music of the lesser known Ella Johnson and Ella Mae Morse, and included guest appearances by Nancy King and Mario DePriest. In February of 2004 Lily was the featured performer with the Harry James Orchestra at the United Negro College Fund's fundraiser called &quot;This Joint Is Jumpin'&quot; held at the Paramount Theater in Seattle. (cdbaby)\n\n01 - Mister Five By Five\n02 - Since I Fell For You\n03 - Insect Ball\n04 - No More Love\n05 - Tess's Torch Song (I Had A Man)\n06 - Onion\n07 - Rip Van Winkle\n08 - Till My Baby Comes Back\n09 - Go Ahead And Rock\n10 - Oh Babe!\n11 - Stormy Weather (It's Rainin' All The Time)\n12 - Jumpin' Jack\n13 - Work Baby Work\n\nPersonnel:\nGavin Bondy, Chris Schell, Brett White (trumpets)\nStan Bock, Lew Chapman, Monte Skillings (trombones)\nBryan Dickerson, Danny Schauffler, Pete Petersen, Mike Kelly, Chris Mercer (reeds)\nBill Beach (piano)\nMichael Gargano (guitar)\nJoey Seifers or Willy Barber (bass)\nTom Royer (drums)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:c2feb23e010909ffc844c82d3c0c9eb79fad69d8","amp;dn":"Lily+Wilde+And+Her+Jumpin%27+Jubilee+Orchestra+-+1999+-+Insect+Bal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2feb23e010909ffc844c82d3c0c9eb79fad69d8","infoHashBuffer":{"type":"Buffer","data":[194,254,178,62,1,9,9,255,200,68,200,45,60,12,158,183,159,173,105,216]},"announce":[],"urlList":[]}}