{"title":"Recent Advances in Sustainable Process Design and Optimization","uid":12153205,"size":8093501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c37cfa224d0827dc9caceaf761fdb107a0820b2b&amp;dn=Recent+Advances+in+Sustainable+Process+Design+and+Optimization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1437690489,"description":"Advances in Process Systems Engineering Vol. 3 - Recent Advances in Sustainable Process Design and Optimization (World Scientific, 2012).pdf\n\nISBN 9789814271950\n\nThis book is a compilation of the various recently developed techniques emphasizing better chemical processes and products, with state-of-the-art contributions by world-renowned leaders in process design and optimization. It covers various areas such as grass-roots design, retrofitting, continuous and batch processing, energy efficiency, separations, and pollution prevention, striking a balance between fundamental techniques and applications. The book also contains industrial applications and will serve as a good compilation of recent industrial experience for which the process design and optimization techniques were applied to enhance sustainability. Academic researchers and industrial practitioners will find this book useful as a review of systematic approaches and best practices in sustainable design and optimization of industrial processes. The book is accompanied by some electronic supplements (i.e., models and programs) for selected chapters.\nReadership: Advanced undergraduates and graduate students in chemical process design and optimization; non-experts interested in clean process design","torrent":{"xt":"urn:btih:c37cfa224d0827dc9caceaf761fdb107a0820b2b","amp;dn":"Recent+Advances+in+Sustainable+Process+Design+and+Optimization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c37cfa224d0827dc9caceaf761fdb107a0820b2b","infoHashBuffer":{"type":"Buffer","data":[195,124,250,34,77,8,39,220,156,172,234,247,97,253,177,7,160,130,11,43]},"announce":[],"urlList":[]}}