{"title":"Drowner - You're Beautiful, I Forgive You (2013) [FLAC]","uid":8810353,"size":370677784,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c5cbf96df199c62472529020b84ca230d7a9522c&amp;dn=Drowner+-+You%27re+Beautiful%2C+I+Forgive+You+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1376442857,"description":"\n  Drowner - You're Beautiful, I Forgive You (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Dream Pop, Shoegaze, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 850 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Glow \n  02 On Bright Days \n  03 Automatic Zen \n  04 Mirror \n  05 Metro \n  06 Stay With Me \n  07 You \n  08 Not There \n  09 Shadow \n  10 Our Last Day \n  11 Fear of Falling\n  12 Innocent \n\n  Following a promising debut EP in 2012, Houston, Texas-based dream pop unit Drowner deliver volumes of glistening post-shoegaze bliss on their debut full-length, You're Beautiful, I Forgive You. Built on a solid foundation of the shoegaze greats, Drowner lean more toward the sophisticated atmospheres of Slowdive and the kaleidoscopic pop of Lush or Curve than My Bloody Valentine's layers of tender noise, though the driving rhythms of tunes like &quot;Stay with Me&quot; and &quot;Shadow&quot; do recall Loveless' woozy trip-hop-like live drum loops. From their shoegaze foundations, the songs stretch out into different territories, with Anna Bouchard's subtly processed vocals either guiding the tunes or sinking into their sonic depths. Tracks like &quot;On Bright Days&quot; find Bouchard in the forefront, confident and airy over jangly psychedelic guitar that recalls the most optimistic moments of Ride or Chapterhouse in their hazy early-'90s summits. \n\n  Elsewhere, the smoky churn of &quot;Not There&quot; finds her drawn-out harmonies channeling Low's Mimi Parker in a stoic, cautious delivery. Apart from Bouchard's shifting and often gorgeous experiments with vocals, textural guitar work throughout the album is another key component for its success. Tones change from track to track, often blurring into each other through layers of Spiritualized-like honeyed tremolo and resolving in walls of fuzz not unlike that of Deerhunter, Mogwai, No Joy, or other dream pop envelope-pushers. The 12 songs here tend to stretch out languidly, sometimes running into each other over the almost hourlong running time of the album. Though almost every track stands strongly on its own, the entire set can be a little tough to digest at once. However, the mood set by You're Beautiful, I Forgive You can be something just as comforting and accessible as the best tracks can be immediately engaging.","torrent":{"xt":"urn:btih:c5cbf96df199c62472529020b84ca230d7a9522c","amp;dn":"Drowner+-+You%27re+Beautiful%2C+I+Forgive+You+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5cbf96df199c62472529020b84ca230d7a9522c","infoHashBuffer":{"type":"Buffer","data":[197,203,249,109,241,153,198,36,114,82,144,32,184,76,162,48,215,169,82,44]},"announce":[],"urlList":[]}}