{"title":"American Made: Why Making Things Will Return  Greatness","uid":11756399,"size":3308580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6cf16676267d0b0f5d4e211908e6c5c68ec24bb&amp;dn=American+Made%3A+Why+Making+Things+Will+Return++Greatness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1426393239,"description":"American Made: Why Making Things Will Return Us to Greatness by Dan DiMicco.\n\nRequirements: ePUB reader, 3.2 MB\n\nOverview: American manufacturing is on life support--at least, that's what most people think. The exodus of jobs to China and other foreign markets is irreversible, and anything that is built here requires specialized skills the average worker couldn't hope to gain. Not so, says Dan DiMicco, chairman and former CEO of Nucor, America's largest steel company. He not only revived a major US manufacturing firm during a recession, but helped galvanize the flagging domestic steel industry when many of his competitors were in bankruptcy or headed overseas. In American Made, he takes to task the politicians, academics, and political pundits who, he contends, are exacerbating fears and avoiding simple solutions for the sake of nothing more than their own careers, and contrasts them with the postwar leaders who rebuilt Europe and Japan, put a man on the moon, and kept communism at bay. We need leaders of such resolve today, he argues, who can tackle a broken job-creation engine by restoring manufacturing to its central role in the U.S. economy--and cease creating fictitious &quot;service businesses&quot; where jobs evaporate after a year or two, as in a Ponzi scheme","torrent":{"xt":"urn:btih:c6cf16676267d0b0f5d4e211908e6c5c68ec24bb","amp;dn":"American+Made%3A+Why+Making+Things+Will+Return++Greatness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6cf16676267d0b0f5d4e211908e6c5c68ec24bb","infoHashBuffer":{"type":"Buffer","data":[198,207,22,103,98,103,208,176,245,212,226,17,144,142,108,92,104,236,36,187]},"announce":[],"urlList":[]}}