{"title":"Underground Spaces {BBS}","uid":7318899,"size":7981607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7f09594e05cad958c5a16124846b5a5f8335a1a&amp;dn=Underground+Spaces+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1338566370,"description":"It is a strongly held belief that population growth and the demand for\nbetter accommodation and leisure facilities, combined with a desire to\nimprove the landscape, will result in the need to develop more underground spaces. This phenomenon, which started in countries subjected to extreme\nclimates, is now becoming more widespread.\n\nUnderground spaces are being utilized for a wide diversity of needs. They\nrange from classical excavations to subway constructions; underground sports halls; power stations; waste repositories; underground cities, and many others. Their construction techniques are also varied, from open-air excavations to newly developed injection methods.\n\nThe response of the underground structures on the imposed loadings depends on a number of parameters that sometimes are too complex or not fully understood, resulting in budget overruns or even failures that lead to loss of property or life. Such uncertain cases need to be addressed and engineers should be able to accurately predict the construction's performance\nthroughout its construction and service life.\n\nThe First International Conference on Underground Spaces discussed not only structural and environmental material characterization aspects but also the trends regarding the utilization of underground spaces. This book contains papers presented at the Meeting, and covers a wide range of topics including: Use of underground space for industry; Underground power\nstations; Toxic and nuclear waste repositories; Energy underground\nreservoirs; Underground sewerage plants; Waste storage and management; Road and railway tunnels; Utility tunnels; Fire defence; Defence against terrorist attacks.\n\n\n\nHardcover: 224 pages\nPublisher: WIT Press; 1 edition (September 1, 2008)\nLanguage: English\nISBN-10: 1845641256\nISBN-13: 978-1845641252","torrent":{"xt":"urn:btih:c7f09594e05cad958c5a16124846b5a5f8335a1a","amp;dn":"Underground+Spaces+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f09594e05cad958c5a16124846b5a5f8335a1a","infoHashBuffer":{"type":"Buffer","data":[199,240,149,148,224,92,173,149,140,90,22,18,72,70,181,165,248,51,90,26]},"announce":[],"urlList":[]}}