{"title":"Open Transport Tycoon Deluxe (openttd 1.1.3) for Windows 64bit","uid":6700402,"size":20708392,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c8ed77b1d948a47969e01c4831c1b0f117f29121&amp;dn=Open+Transport+Tycoon+Deluxe+%28openttd+1.1.3%29+for+Windows+64bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CCnOSnBT","files":-1,"time":1316949176,"description":"OpenTTD is an open source simulation game based upon the popular Microprose game &quot;Transport Tycoon Deluxe&quot;, written by Chris Sawyer. It attempts to mimic the original game as closely as possible while extending it with new features.\n\nFeatures\n\nOpenTTD is modelled after the original Transport Tycoon game by Chris Sawyer and enhances the game experience dramatically. Many features were inspired by TTDPatch while others are original.\n\nSignificant enhancements from the original game include:\n\n* bigger maps (up to 64 times in size)\n* stable multiplayer mode for up to 255 players in 15 companies, or as spectators\n* dedicated server mode and an in-game console for administration\n* IPv6 and IPv4 support for all communication of the client and server\n* in game downloading of AIs, NewGRFs, scenarios and heightmaps\n* new pathfinding algorithms that makes vehicles go where you want them to\n* autorail/-road build tool, improved terraforming\n* canals, shiplifts, aqueducts\n* larger, non-uniform stations and the ability to join them together\n* mammoth and multi-headed trains\n* different configurable models for acceleration of vehicles\n* clone, autoreplace and autoupdate vehicles\n* the possibility to build on slopes and coasts\n* advanced/conditional orders, share and copy orders\n* longer and higher bridges including several new designs, plus fully flexible tracks/roads under bridges\n* reworked airport system with many more airports/heliports (e.g. international and metropolitan)\n* presignals, semaphores, path based signalling\n* support for TTDPatch NewGRF features offering many options for graphics and behaviour configuration/modification\n* drive-through road stops for articulated road vehicles and trams\n* multiple trees on one tile\n* bribe the town authority\n* many configuration settings to tune the game to your liking\n* save games using zlib compression for smaller sizes, while not interrupting gameplay\n* significant internationalisation support. OpenTTD has already been translated into over 50 languages\n* dynamically created town names in 18 languages, plus NewGRF support for additional languages\n* freely distributable graphics, sounds and music\n* framework for custom (user) written AIs\n* zooming further out in the normal view and zooming out in the small map\n\nLots of effort has been put into making OpenTTD easy to use. These include:\n\n* convert rail tool (to electrified rail, monorail, and maglev)\n* drag&amp;drop support for almost all tools (demolition, road/rail building/removing, stations, scenario editor, etc)\n* sorting of most lists based on various criteria (vehicle, station, town, industries, etc.)\n* mouse wheel support (scroll menus, zoom in/out)\n* autoscroll when the mouse is near the edge of the screen/window\n* sell whole train by dragging it to the dynamite trashcan\n* cost estimation with the 'shift' key\n* advanced options configuration window, change settings from within the game\n\nGraphical/interface features:\n\n* screenshots can be in BMP, PNG or PCX format (select in game options menu)\n* more currencies (including Euro introduction in 2002)\n* extra viewports to view more parts of the game world at the same time\n* resolution and refresh rate selection for fullscreen mode\n* colourful newspaper after a certain date\n* colour coded vehicle profits\n* game speed increase (through fast forward button or by pressing the TAB key)\n* snappy and sticky windows that always stay on top and neatly align themselves to other windows\n* more hotkeys for even less mouse-clicking\n* support for 32 bit graphics\n* support for right-to-left languages\n* support for other (sized) fonts where the user interface scales based on the font and translation\n   &lt;a href=&quot;\nhttp://www.openttd.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.openttd.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:c8ed77b1d948a47969e01c4831c1b0f117f29121","amp;dn":"Open+Transport+Tycoon+Deluxe+%28openttd+1.1.3%29+for+Windows+64bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8ed77b1d948a47969e01c4831c1b0f117f29121","infoHashBuffer":{"type":"Buffer","data":[200,237,119,177,217,72,164,121,105,224,28,72,49,193,176,241,23,242,145,33]},"announce":[],"urlList":[]}}