{"title":"The Corruption of Christianity   (BBC 2000)","uid":6780790,"size":374654765,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cad2a9481a3426d3dadd35072c64c3bfdbfc6ae0&amp;dn=The+Corruption+of+Christianity+++%28BBC+2000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":10,"time":1319847813,"description":"Type : Mpeg 1 layer 3\nBitrate : 192K\nMode : stereo\nFrequency : 44,100 Hz\nEncoder : iTunes v6\n\n\n&quot;The corruption of the best is the worst.&quot;\n\nThis old adage sums up social critic Ivan Illich's view of the fate of the Christian gospel during two thousand years. He speaks as a Christian who believes that through the life, death and resurrection of Jesus of Nazareth, something gloriously new came into the world: the possibility of knowing and loving God in the flesh. But along with this came a new and unprecedented danger: that the call to love more abundantly would become the basis for new forms of power in the hands of those who organize and administer the New Testament.\n\n&quot;Wherever I look for the roots of modernity,&quot; Illich says, &quot;I find it in attempts of the churches to institutionalize and manage Christian vocation.&quot;\n\nIn conversation with David Cayley of Canadian Broadcasting, Illich explores this hypothesis with respect to medicine, law and other modern institutions. He pays particular attention to his radical reading of the parable of the Good Samaritan. Illich looks at how our visual sense has taken over from other senses, his notion of friendship, his research into the loss of proportionality, how tools have given way to systems, and his views on teaching, research, and renunciation.\n\nIllich: &quot;My work is an attempt to accept with great sadness the fact of Western culture. Christopher Dawson ... says that the Church is Europe and Europe is the Church, and I say yes! Corruptio optimi quae est pessima. Through the attempt to insure, to guarantee, to regulate Revelation, the best becomes the worst... I live also with a sense of profound ambiguity. I can't do without tradition, but I have to recognize that its institutionalization is the root of an evil deeper than any evil I could have known with my unaided eyes and mind.&quot;\n\nThis program was originally broadcast in 2000.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:cad2a9481a3426d3dadd35072c64c3bfdbfc6ae0","amp;dn":"The+Corruption+of+Christianity+++%28BBC+2000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cad2a9481a3426d3dadd35072c64c3bfdbfc6ae0","infoHashBuffer":{"type":"Buffer","data":[202,210,169,72,26,52,38,211,218,221,53,7,44,100,195,191,219,252,106,224]},"announce":[],"urlList":[]}}