{"title":"Louisa May Alcott Mystery - Anna Maclean","uid":9096562,"size":1123060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb12beb22de6fb78146373110d01c11f7540141e&amp;dn=Louisa+May+Alcott+Mystery+-+Anna+Maclean&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1382694229,"description":"Louisa and the Missing Heiress: The First Louisa May Alcott Mystery\nLong before she will achieve fame as the author of Little Women, Louisa May Alcott is writing stories of a more dark and mysterious nature. But nothing prepares her for the role of amateur detective she assumes when the body of her dear friend, wealthy newlywed Dorothy Wortham, is found floating in Boston's harbor.\n\nIt's well known that Dorothy's family didn't approve of her husband, a confirmed fortune hunter, but Louisa suspects that some deeper secret lies behind her friend's tragic murder...\n\nLouisa and the Country Bachelor: A Louisa May Alcott Mystery\nLouisa May Alcott returns in this &quot;historically accurate and entertaining mystery series.&quot; (The New York Review of Books)\n\nLouisa convinces her family to visit cousins in rural New Hampshire, only to confront tragedy. A local bachelor is found dead in a ravine, the apparent victim of an accidental fall while hiking. But Louisa suspects foul play and sets out to uncover the vicious murderer hiding among her family's new friends...\n\nLouisa and the Crystal Gazer: A Louisa May Alcott Mystery\nA young Louisa May Alcott accompanies her friend Sylvia to visit Boston's most famous spiritual medium, Mrs. Agatha D. Percy, to contact Sylvia's long-dead father. Louisa isn't one to believe such foolishness-until one of the seer's predictions comes true.\n\nLouisa and Sylvia visit the seer again, but Mrs. Percy's days of divination have been cut brutally short by a killer. Now, Louisa must solve the mystery of the crystal gazer's untimely death by uncovering the shocking truth about her life.","torrent":{"xt":"urn:btih:cb12beb22de6fb78146373110d01c11f7540141e","amp;dn":"Louisa+May+Alcott+Mystery+-+Anna+Maclean","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb12beb22de6fb78146373110d01c11f7540141e","infoHashBuffer":{"type":"Buffer","data":[203,18,190,178,45,230,251,120,20,99,115,17,13,1,193,31,117,64,20,30]},"announce":[],"urlList":[]}}