{"title":"Hidden Treasure - A Map to the Childs Inner Self Ebook","uid":9475953,"size":797699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbc3844f3e7b0207cc770ce1056a33bc6a5f1bb4&amp;dn=Hidden+Treasure+-+A+Map+to+the+Childs+Inner+Self+Ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lazypirate..","files":1,"time":1389696720,"description":"Format: PDF (WEB)\nISBN: 1855754908\nLanguage: English\nLength: 315 Pages\nGenre: Non-Fiction\n\n'Hidden Treasure' is a follow up to Oaklander s first book, 'Windows To Our Children'. Most of the books available in working with this population are written from a traditional play therapy point of view. The Gestalt Therapy-based approach provides a more effective method for psychotherapeutic work with children of all ages. The focus is on the relationship between the therapist and client, rather than observation and interpretation. It is a vigorous, dynamic approach. This book provides an approach to working with children and adolescents that involves a variety of creative, projective and expressive techniques with Gestalt Therapy, theory, philosophy and practice as the underlying framework. The focus is to provide the child with a means for expressing his or her innermost feelings, to foster self-awareness and self-discovery, to enhance self-esteem, and in general, to promote emotional growth. The approach is applicable to a wide variety of ages as well as settings as individual work, family work, and group settings. This book will interest child and adolescent psychotherapists, psychologists, social workers, counselors, interns, school personnel. Many graduate school classes will use this book for their graduate students and it will also have a wide appeal, even to parents.","torrent":{"xt":"urn:btih:cbc3844f3e7b0207cc770ce1056a33bc6a5f1bb4","amp;dn":"Hidden+Treasure+-+A+Map+to+the+Childs+Inner+Self+Ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbc3844f3e7b0207cc770ce1056a33bc6a5f1bb4","infoHashBuffer":{"type":"Buffer","data":[203,195,132,79,62,123,2,7,204,119,12,225,5,106,51,188,106,95,27,180]},"announce":[],"urlList":[]}}