{"title":"[NubileFilms] Kiera Winters, Odette Delacroix, Veronica Rodrigue","uid":8824947,"size":1519991724,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cbf7e0fd67778a2447f6316699c273aa54b4d84b&amp;dn=%5BNubileFilms%5D+Kiera+Winters%2C+Odette+Delacroix%2C+Veronica+Rodrigue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1376821675,"description":"[NubileFilms] Kiera Winters, Odette Delacroix, Veronica Rodriguez (Circle Of Friends / 08.17.2013)\nres:1080p\n\nVeronica Rodriguez, Odette Delacroix, and Kiera Winters are three very different girls who are brought together by their mutual love of sexual pleasure. The trio takes their time undressing each other, exchanging long and eager kisses as their clothes come off.\n\nWhen they are all nude, the girls drop to the ground in a pleasure-giving circle. Odette lies with her mouth buried in Veronica's pussy, while Veronica gives the same pleasure to Kiera and Kiera eats out Odette. Their positioning allows them to caress each other's breasts or use their hands for added hold on their woman's ass cheeks. Soon, all three girls' hips are undulating in pleasure as their tongues work each other's wet eager twats.\n\nWhen all three girls are hot and panting with excitement, they shift positions. Veronica finds herself in the middle, her mouth pressed to Kiera's drenched slit as the brunette squeezes her tits and pinches her nipples. Meanwhile, Odette drops to her hands and knees to continue the thorough pussy licking that she has been delivering to Veronica. They continue like that until Kiera reaches her climax. Her body shudders as Veronica keeps up the oral pleasure to the very end.\n\nThe girls switch positions, leaving Veronica in the middle with her attention now focused between Odette's hairy snatch and Kiera's slick shaved folds. Kiera enjoys her position on the bottom, taking the opportunity to lovingly lap at Veronica's juicy slit with her pierced tongue. With Veronica's efforts, Odette is soon shaking as her orgasm rolls through her.\n\nKiera and Odette switch places once again so that Odette can take her time eating out Veronica's tight anus and wet hole. Veronica is happy to work Kiera towards a second climax with her talented tongue at the same time, eagerly buying her face and fingers in her lover's pussy.\n\nOdette is determined to bring Veronica to the edge. She uses both hands, with a finger buried inside her woman's sheath and the other hand rubbing Veronica's tender clit with increasing speed. Finally Odette is rewarded for her efforts as the Latina babe moans her pleasure as her pussy juices gush everywhere.\n\nSated, the three girls curl up together and close their eyes to enjoy the afterglow of an incredible lovemaking session.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=buo7h2zd5i5adh4jy9dm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=buo7h2zd5i5adh4jy9dm.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=xyubgimzt6sw1tlpdmg0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=xyubgimzt6sw1tlpdmg0.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:cbf7e0fd67778a2447f6316699c273aa54b4d84b","amp;dn":"%5BNubileFilms%5D+Kiera+Winters%2C+Odette+Delacroix%2C+Veronica+Rodrigue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbf7e0fd67778a2447f6316699c273aa54b4d84b","infoHashBuffer":{"type":"Buffer","data":[203,247,224,253,103,119,138,36,71,246,49,102,153,194,115,170,84,180,216,75]},"announce":[],"urlList":[]}}