{"title":"parenti_serpenti","uid":4206453,"size":732513550,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cc02d4af73edbe8915faaf746c375773edafd912&amp;dn=parenti_serpenti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"viniciusmonicelli","files":2,"time":1211828741,"description":"Monicelli always went beyond the Italian comedy genre. His movies mocked the worst habits living inside his characters, with grotesques but reflective stories in ancient and recent Italy. This one is probably his last masterpiece (he&amp;#039;s 92 by now) and if you haven&amp;#039;t seen it yet, go rent it ! A typical southern Italy family reunites in the native home in Sulmona (Abruzzo) for Christmas Seasons. Apparently everything goes marvelously: the parents, 2 sons and 2 daughters, 1 nephew and 1 niece, and 3 brother/sister in law (1 bachelor and 1 couple without sons). Spending just two weeks a year together they always pretended to love each other, acting like a model family. Getting old, the mother Trieste, thinking to his older, sick husband too, during the big Christmas lunch, decides to ask hospitality with ONE and just ONE of the sons. A tragedy.\n\nInstead of the the idyllic family of the first half part, in the second the sleeping grudges and resentments came out explosively, discovering the painful realities about each one, the reasons for which they shouldn&amp;#039;t take their parents at home, OK, but yet too weak to get out of the task. Thought it was a right, correct query nobody wants that burden inventing the weirdest excuses. The war burst on different fronts, reckoning every old rancor.\n\nThe perfectly built dialogues create a nice spectrum of the variegated accents of Italian language (north/south), as it could have happened everywhere. Either watching several times you can&amp;#039;t find a hole in the script, thank overall to the skilled actors (Marina Confalone&amp;#039;s plane sequence is excellent!). The hypocritical social substratum (typical of small towns) where that family grew up and blamed as vile for years, eventually permeated through them and led the dear offspring to that evil ending.\n\nA trivia: Cinzia Leone was substituted for the last scene at the party having suffered a fit in the filming dates. She still carries the after effects of that time with a facial paresis.\n\nThe most poisonous dark comedy made in Italy in the last 20 years, and probably ever. I recommend it warmly to all of you ! \n\n","torrent":{"xt":"urn:btih:cc02d4af73edbe8915faaf746c375773edafd912","amp;dn":"parenti_serpenti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc02d4af73edbe8915faaf746c375773edafd912","infoHashBuffer":{"type":"Buffer","data":[204,2,212,175,115,237,190,137,21,250,175,116,108,55,87,115,237,175,217,18]},"announce":[],"urlList":[]}}