{"title":"Agente 86+Legendas PT-BR [5a temp] - Get Smart [Season 5]","uid":5760369,"size":4772938999,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cceb4b02f63d4e720017bff18c236e9a9bbfd84d&amp;dn=Agente+86%2BLegendas+PT-BR+%5B5a+temp%5D+-+Get+Smart+%5BSeason+5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ScorpionJP","files":-1,"time":1281708274,"description":"Get Smart (Olho Vivo em Portugal e Agente 86 no Brasil) ÃƒÂ© o nome de um conhecido seriado de televisÃƒÂ£o dos Estados Unidos da AmÃƒÂ©rica. Consagrou-se como um dos grandes sucessos da televisÃƒÂ£o mundial na dÃƒÂ©cada de 1960, gerando continuaÃƒÂ§ÃƒÂµes e vencendo muitos prÃƒÂªmios. \n\nTudo deu Inicio[1] com o sucesso dos filmes de James Bond na dÃƒÂ©cada de 1960. Os produtores Leonard Stern e Dan Melnick, associados a Mel Brooks e Buck Henry, idealizaram uma sÃƒÂ©rie de TV cÃƒÂ´mica com os mesmos temas, espionagem e Guerra Fria. \n\nDon Adams foi escolhido graÃƒÂ§as ÃƒÂ  sua atuaÃƒÂ§ÃƒÂ£o no The Bill Dana Show, no qual fazia um atrapalhado detetive de hotel. Ele se engajou tanto no papel que chegou a sofrer acidentes devido ÃƒÂ s cenas de aÃƒÂ§ÃƒÂ£o. Em compensaÃƒÂ§ÃƒÂ£o, ganhou muitos prÃƒÂªmios como ator de comÃƒÂ©dia. Adams nasceu em 13 de abril de 1923 e faleceu em 25 de setembro de 2005, vÃƒÂ­tima de pneumonia[2]. \n\nO episÃƒÂ³dio-piloto foi rodado em preto e branco. A histÃƒÂ³ria comeÃƒÂ§a exatamente como os demais episÃƒÂ³dios, com o Agente 86 indo para o escritÃƒÂ³rio secreto, atravessando vÃƒÂ¡rias portas. Ali tambÃƒÂ©m aparecem o sapato-fone e o cone-do-silÃƒÂªncio. Na missÃƒÂ£o contra o vilÃƒÂ£o Senhor Big (um anÃƒÂ£o), ele recebe ordens do Chefe e ÃƒÂ© ajudado pelos Agentes Canino, 99 (que ele nÃƒÂ£o conhecia) e 34 (escondido em um armÃƒÂ¡rio).Ele ficou muito feliz quando descobriu que seria um agente de campo,ou melhor um agente de missÃƒÂµes pois antes ele era apenas um agente que trabalhava no prÃƒÂ©dio do CONTROLE. \n\nApesar de jÃƒÂ¡ contar com todos esses ingredientes cÃƒÂ´micos que se tornariam famosos, os executivos de produÃƒÂ§ÃƒÂ£o da Rede ABC recusaram-se a comprar a sÃƒÂ©rie, pois, na trama apresentada, a intenÃƒÂ§ÃƒÂ£o dos vilÃƒÂµes era explodir a EstÃƒÂ¡tua da Liberdade. \n\nOs criadores de Smart nÃƒÂ£o se deram por vencidos e foram bater na porta da Rede NBC, que aprovou o projeto e concedeu autorizaÃƒÂ§ÃƒÂ£o para iniciar a produÃƒÂ§ÃƒÂ£o da sÃƒÂ©rie, agora totalmente em cores. \n\nA melhor temporada do seriado ÃƒÂ© provavelmente a primeira, entre 1965 e 1966. Em 1969, a audiÃƒÂªncia caiu um pouco e a Rede CBS assumiu o programa, encontrando como soluÃƒÂ§ÃƒÂ£o casar os protagonistas, de cuja uniÃƒÂ£o nasceram gÃƒÂªmeos. Mas a audiÃƒÂªncia nÃƒÂ£o se recuperou e, como conseqÃƒÂ¼ÃƒÂªncia, a sÃƒÂ©rie foi cancelada em 1970. \n\nAgente 86 durou cinco temporadas, de 1965 a 1970, ganhando sete prÃƒÂªmios Emmy, dois para seriado cÃƒÂ´mico e trÃƒÂªs para Don Adams. Foram produzidos cento e trinta e oito episÃƒÂ³dios de vinte e quatro minutos. No Brasil, foi exibido primeiro pela TV Record e depois, em reprise, pela TV Bandeirantes. Houve um filme[3] para cinema em 1980, chamado The Nude Bomb (A Bomba que Desnuda)[4] e um telefilme[5] em 1989, na Rede ABC. \n\nEm 1995, a Fox tentou revitalizar o seriado com uma nova versÃƒÂ£o, agora com Smart no comando do C.O.N.T.R.O.L e 99 como deputada federal. Apesar do fracasso dessas retomadas, Agente 86 ÃƒÂ© o ÃƒÂºnico seriado a ter passado pelas quatro grandes emissoras americanas ? NBC, CBS, ABC e FOX ? com o elenco original. \n\nNo Brasil, primeiramente foi exibido na TV Record, depois os seus direitos foram comprados pela TV Bandeirantes. Hoje em dia, a UlbraTV transmiteo Agente 86. A Band, no final de 2007, chegou a passar um episÃƒÂ³dio do seriado em um sÃƒÂ¡bado ÃƒÂ  tarde, ÃƒÂ s 14h. Atualmente ele ÃƒÂ© exibido pelo canal de televisÃƒÂ£o paga Nick (Nickelodeon)com nova redublagem de todas temporadas no estudio carioca da Herbert Richers , onde ÃƒÂ© exibido num quadro chamado Nick At Nite. A sÃƒÂ©rie tambÃƒÂ©m ÃƒÂ© exibida pelo canal pago TCM com diferencial da primeira dublagem da ÃƒÂ©poca nos estudios paulista da AIC que fez a partir da 2 temporada em diante nos tempos da Tv record sÃƒÂ³ a 1 temporada ficou ao cargo da Herbert Richers com a 1 primeira dublagem . Para quem tem a parabÃƒÂ³lica ou uma boa antena UHF, passa Agente 86 na Rede Brasil, UlbraTV nos sÃƒÂ¡bados as 17h50 e na internet passa na Tv HotMix \n\nNo dia 20 de junho de 2008, foi lanÃƒÂ§ado o filme inspirado no velho seriado, que se chama Agente 86: O Filme. Os protagonistas sÃƒÂ£o Steve Carell e Anne Hathaway[6] e houve participaÃƒÂ§ÃƒÂ£o dos produtores originais Buck Henry e Mel Brooks[7]. A histÃƒÂ³ria mostra 86 iniciando sua carreira como agente, auxiliado pela veterana 99, em sua primeira missÃƒÂ£o: impedir que a K.A.O.S. entregue cÃƒÂ³digos de lanÃƒÂ§amento de mÃƒÂ­sseis nucleares a terroristas. \n\n\n\nLegendas em PT-BR\n","torrent":{"xt":"urn:btih:cceb4b02f63d4e720017bff18c236e9a9bbfd84d","amp;dn":"Agente+86%2BLegendas+PT-BR+%5B5a+temp%5D+-+Get+Smart+%5BSeason+5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cceb4b02f63d4e720017bff18c236e9a9bbfd84d","infoHashBuffer":{"type":"Buffer","data":[204,235,75,2,246,61,78,114,0,23,191,241,140,35,110,154,155,191,216,77]},"announce":[],"urlList":[]}}