{"title":"Century of Sonnets : the Romantic-era Revival 1750-1850 [Non-Fic","uid":8900210,"size":4699764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce05e11645603181bd1636010d56454432944738&amp;dn=Century+of+Sonnets+%3A+the+Romantic-era+Revival+1750-1850+%5BNon-Fic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1378792969,"description":"ISBN 9780195115611\n\nExpertly edited by Paula R. Feldman and Daniel Robinson, this volume is the first in modern times to collect the sonnets of the Romantic period--many never before published in the twentieth century--and contains nearly five hundred examples composed between 1750 and 1850 by 81 poets, nearly half of them women. A Century of Sonnets includes in their entirety such important but difficult to find sonnet sequences as William Wordsworth's The River Duddon, Mary Robinson's Sappho and Phaon, and Robert Southey's Poems on the Slave Trade, along with Browning's enduring classic, Sonnets from the Portuguese. The poems collected here express the full sweep of human emotion and explore a wide range of themes, including love, grief, politics, friendship, nature, art, and the enigmatic character of poetry itself. Indeed, for many poets the sonnet form elicited their strongest work.\nA Century of Sonnets shows us that far from disappearing with Shakespeare and the English Renaissance, the sonnet underwent a remarkable rebirth in the Romantic period, giving us a rich body of work that continues to influence poets even today. ","torrent":{"xt":"urn:btih:ce05e11645603181bd1636010d56454432944738","amp;dn":"Century+of+Sonnets+%3A+the+Romantic-era+Revival+1750-1850+%5BNon-Fic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce05e11645603181bd1636010d56454432944738","infoHashBuffer":{"type":"Buffer","data":[206,5,225,22,69,96,49,129,189,22,54,1,13,86,69,68,50,148,71,56]},"announce":[],"urlList":[]}}