{"title":"(Blues) Pink Anderson - Carolina Blues Man","uid":6073206,"size":97695964,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ce965cb34b4921febc91b773d9938ae99bfc40ba&amp;dn=%28Blues%29+Pink+Anderson+-+Carolina+Blues+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1293714087,"description":"Style: Acoustic Country Blues, Piedmont Blues,\nRecorded: 1961\nReleased: 1992\nLabel: Prestige/Bluesville\nFile: mp3@ 320kbps \nSize: 92.67 MB\nTime: 39:50\nArt: Full Cover\n\n1. My Baby Left Me This Morning - 3:38\n2. Baby, Please Don't Go - 2:45\n3. Mama Where Did You Stay LastNight - 3:47\n4. Big House Blues - 4:04\n5. Meet Me In The Bottom - 3:52\n6. Weeping Willow Blues - 3:52\n7. Baby I'm Going Away - 2:58\n8. Thousand Woman Blues - 3:45\n9. I Had My Fun - 4:37\n10. Every Day In The Week Blues - 3:49\n11. Try Some Of That - 2:33\n\nPersonnel: \nPink Anderson - Guitar, Vocals\n\n\nNotes: A vast majority of the known professional recordings of Piedmont blues legend Pink Anderson were documented during 1961, the notable exception being the platter he split with Rev. Gary Davis - 'Gospel, Blues and Street Songs' - which was documented in the spring of 1950. This is the first of three volumes that were cut for the Prestige Records subsidiary Bluesville. 'Carolina Blues Man' finds Anderson performing solo - with his own acoustic guitar accompaniment - during a session cut on his home turf of Spartanburg, SC. Much - if not all - of the material Anderson plays has been filtered through and tempered by the unspoken blues edict of taking a familiar (read: traditional) standard and individualizing it enough to make it uniquely one's own creation. Anderson's approach is wholly inventive, as is the attention to detail in his vocal inflections, lyrical alterations, and, perhaps more importantly, Anderson's highly sophisticated implementation of tricky fretwork. \nHis trademark style incorporates a combination of picking and strumming chords interchangeably. This nets Anderson an advanced, seemingly electronically enhanced sound. 'Baby I'm Going Away' - with its walkin' blues rhythms - contains several notable examples of this technique, as does the introduction to 'Every Day of the Week.' The track also includes some of the most novel chord changes and progressions to be incorporated into the generally simple style of the street singer/minstrel tradition from which Pink Anderson participated in during the first half of the 20th Century. Listeners can practically hear Anderson crack a smile as he weaves an arid humor with overtly sexual connotations into his storytelling -- especially evident on 'Try Some of That' and 'Mama Where Did You Stay Last Night.' Aficionados and most all students of the blues will inevitably consider this release an invaluable primer into the oft-overlooked southern East Coast Piedmont blues. \n\n\n","torrent":{"xt":"urn:btih:ce965cb34b4921febc91b773d9938ae99bfc40ba","amp;dn":"%28Blues%29+Pink+Anderson+-+Carolina+Blues+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce965cb34b4921febc91b773d9938ae99bfc40ba","infoHashBuffer":{"type":"Buffer","data":[206,150,92,179,75,73,33,254,188,145,183,115,217,147,138,233,155,252,64,186]},"announce":[],"urlList":[]}}