{"title":"Product Stewardship - Life Cycle Analysis and the Environment","uid":12481138,"size":3637438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf5a5514e9232206b92266de6e65ee1c59916167&amp;dn=Product+Stewardship+-+Life+Cycle+Analysis+and+the+Environment&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1443049428,"description":"Product Stewardship - Life Cycle Analysis and the Environment - Kathleen Sellers (CRC, 2015).pdf\r\n\r\nISBN 9781482223309\r\n\r\nFeatures\r\n\r\nIllustrates the challenges of product stewardship with real-world case studies\r\nExplains life cycle regulations from different parts of the world—US, EU, and China\r\nConsiders the environmental and health implications of particular chemicals on the end users/consumers and the environment\r\nGuides manufacturers to implement sustainable practices using tools such as life cycle analysis to evaluate the possible future consequences of chemical use\r\nSummary\r\n\r\nConsider the Consequences of Bringing a Chemical to Market\r\n\r\nProduct Stewardship: Life Cycle Analysis and the Environment explores the regulatory and scientific aspects of the life-cycle consequences of bringing a chemical to market. Using case studies to bring critical points to life, this multidisciplinary text explores the factors that influence our risk management decisions. It bridges the academic study of life cycle analysis and the practical concerns of those in industry who produce goods for market within the web of global product stewardship regulations and under the eye of consumers concerned with sustainability.\r\n\r\nThis book:\r\n\r\nDiscusses the technical tools that a product steward can use to predict the life cycle consequences of chemical manufacture and use\r\nIncludes the techniques needed to characterize and predict the fate and transport of chemicals in the environment\r\nExplains the formal process of life cycle assessment, which is used to evaluate the potential effects on the environment\r\nDescribes the regulation of both existing and new chemicals, using examples to illustrate the complexity of the factors that affect their regulation\r\nProvides case studies that integrate the technical and regulatory foundations of product stewardship which allows readers to explore past risk-management decisions\r\nProduct Stewardship: Life Cycle Analysis and the Environment describes critical product stewardship regulations and the concept of life cycle thinking in understandable and practical terms. It examines the balance between the benefits of chemical use against the possible consequences of exposure and can assist readers in learning to predict, understand, and regulate the consequences of using a chemical substance through its life cycle","torrent":{"xt":"urn:btih:cf5a5514e9232206b92266de6e65ee1c59916167","amp;dn":"Product+Stewardship+-+Life+Cycle+Analysis+and+the+Environment","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf5a5514e9232206b92266de6e65ee1c59916167","infoHashBuffer":{"type":"Buffer","data":[207,90,85,20,233,35,34,6,185,34,102,222,110,101,238,28,89,145,97,103]},"announce":[],"urlList":[]}}