{"title":"Biogeochemical, Health, and Ecotoxicological Perspectives on Gol","uid":14513264,"size":4871261,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf91452d9d65ab1c67c84c5fdadd58651951927c&amp;dn=Biogeochemical%2C+Health%2C+and+Ecotoxicological+Perspectives+on+Gol&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462310700,"description":"Biogeochemical, Health, and Ecotoxicological Perspectives on Gold and Gold Mining - Ronald Eisler (CRC, 2004).pdf\r\n\r\nDespite the esteemed nature of gold in society, evidence of adverse ecotoxicological effects and risk to human health in various mining and extraction techniques has generated increasing interest in the biological and environmental implications of gold. Biogeochemical, Health, and Ecotoxicological Perspectives on Gold and Gold Mining is the first comprehensive book to evaluate the effect of gold production and use on human health as well as the environmental impact of gold mining and extraction.\r\n\r\nDr. Ronald Eisler, a well-known senior research biologist and expert in the chemical and biological effects of various compounds on wildlife, provides a thorough risk assessment of gold, including its geology and sources and physical, chemical, and metabolic properties. The author documents gold concentrations and field collections of abiotic materials and biota and presents research on the lethal and sublethal effects of gold on plants and animals. Supported by case histories, the book examines health risks in gold miners, human sensitivity to jewelry and dental implants, and medicinal uses. It uses examples in several countries to thoroughly explore the environmental effects of gold extraction, including tailings disposal, acid mine drainage, cyanide, arsenic, and mercury contamination, water management issues, and abandoned mines.\r\n\r\nUnlike traditional risk assessments, the author also takes into account social, political, economic, medicinal, and psychological variables for a more complete perspective on gold's impact on health and the environment. Biogeochemical, Health, and Ecotoxicological Perspectives on Gold and Gold Mining concludes with a discussion on mining legislation, safety, and procedures","torrent":{"xt":"urn:btih:cf91452d9d65ab1c67c84c5fdadd58651951927c","amp;dn":"Biogeochemical%2C+Health%2C+and+Ecotoxicological+Perspectives+on+Gol","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf91452d9d65ab1c67c84c5fdadd58651951927c","infoHashBuffer":{"type":"Buffer","data":[207,145,69,45,157,101,171,28,103,200,76,95,218,221,88,101,25,81,146,124]},"announce":[],"urlList":[]}}