{"title":"Moral Panics and the Copyright Wars - William Patry","uid":12781939,"size":8218184,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cfc7a5f5941f8c758398f7f8410ee3891091ce4b&amp;dn=Moral+Panics+and+the+Copyright+Wars+-+William+Patry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Spud17","files":1,"time":1447798496,"description":"Moral Panics and the Copyright Wars by William Patry\r\n\r\nPublished by Oxford University Press in 2009\r\n\r\nMetaphors, moral panics, folk devils, Jack Valenti, Joseph Schumpeter, John Maynard Keynes, predictable irrationality, and free market fundamentalism are a few of the topics covered in this lively, unflinching examination of the Copyright Wars: the pitched battles over new technology, business models, and most of all, consumers.\r\n\r\nIn Moral Panics and the Copyright Wars, William Patry lays bare how we got to where we are: a bloated, punitive legal regime that has strayed far from its modest, but important roots. Patry demonstrates how copyright is a utilitarian government program - not a property or moral right. As a government program, copyright must be regulated and held accountable to ensure it is serving its public purpose. Just as Wall Street must serve Main Street, neither can copyright be left to a Reaganite &quot;magic of the market.&quot;\r\n\r\nThe way we have come to talk about copyright - metaphoric language demonizing everyone involved - has led to bad business and bad policy decisions. Unless we recognize that the debates over copyright are debates over business models, we will never be able to make the correct business and policy decisions.\r\n\r\nA centrist and believer in appropriately balanced copyright laws, Patry concludes that calls for strong copyright laws, just like calls for weak copyright laws, miss the point entirely: the only laws we need are effective laws, laws that further the purpose of encouraging the creation of new works and learning. Our current regime, unfortunately, creates too many bad incentives, leading to bad conduct. Just as President Obama has called for re-tooling and re-imagining the auto industry, Patry calls for a remaking of our copyright laws so that they may once again be respected.\r\n\r\nPDF, 292 pages, English\r\n\r\nPlease seed and share with others. :)","torrent":{"xt":"urn:btih:cfc7a5f5941f8c758398f7f8410ee3891091ce4b","amp;dn":"Moral+Panics+and+the+Copyright+Wars+-+William+Patry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfc7a5f5941f8c758398f7f8410ee3891091ce4b","infoHashBuffer":{"type":"Buffer","data":[207,199,165,245,148,31,140,117,131,152,247,248,65,14,227,137,16,145,206,75]},"announce":[],"urlList":[]}}