{"title":"The Felice Brothers - Yonder Is The Clock[2009][EAC,log,cue. FLA","uid":9107319,"size":340694658,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cfe31800d235062f2018babaacaea760e88d3a17&amp;dn=The+Felice+Brothers+-+Yonder+Is+The+Clock%5B2009%5D%5BEAC%2Clog%2Ccue.+FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1382906240,"description":"Artist: The Felice Brothers \nRelease: Yonder Is The Clock\nReleased:  2009\nLabel:  Team Love\nCatalog#:  TL-39\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:[/colorAlternative/Indie Folk Rock,Americana\n\n01. The Big Surprise (4:22)\n02. Penn Station (3:58)\n03. Buried in Ice (3:11)\n04. Chicken Wire (2:43)\n05. Ambulance Man (5:27)\n06. Sailor Song (3:30)\n07. Katie Dear (3:59)\n08. Run Chicken Run (5:00)\n09. All When We Were Young (3:25)\n10. Boy from Lawrence County (5:21)\n11. Memphis Flu (3:02)\n12. Cooperstown (6:14)\n13. Rise and Shine (4:25)\n\n\n\n[color=blue]Description\nThe Felice Brothers had a banner year in 2008, ditching their gig as New York City street performers in favor of a record contract, increased distribution, and international tour dates. Released just 13 months after the self-titled Felice Brothers -- an album that served as the band's de facto introduction to the world at large -- Yonder Is the Clock offers another confident, rustic batch of northeastern Americana. Painted with earth tones and dotted with the same American archetypes that previously peppered Music from Big Pink, these songs draw easy parallels to the influences that spawned them, from Bob Dylan's drawl to the Band's rickety harmonies. Yonder Is the Clock certainly makes no attempt to disguise its roots, and while it often lacks the technical skill of Robbie Robertson or the poetic prowess of Dylan, the musicians do shoulder the weight of their predecessors. The Felice Brothers have always prized storytelling above instrumental chops, and Yonder Is the Clock (whose title borrows from Mark Twain's The Mysterious Stranger) spins its sepia-toned narratives with conviction and authenticity, like a traveling band playing folk ballads by campfire. This is an album that references Depression-era plagues and cold New England winters with a hardened grin, an album in which turn-of-the-century ballplayers like Ty Cobb populate the nostalgic ballads. As with the previous record, Clock flirts with ramshackle country (particularly during the two fowl-related numbers, &quot;Chicken Wire&quot; and &quot;Run Chicken Run&quot;;) but devotes more of its time to slow, melancholic twang, while producer Jeremy Backofen eschews excessive knob-twiddling for a casual, live-in-the-studio ambience. The best introduction to the Felice Brothers still rests in the band's live show, where even the most leisurely songs brim with rich hootenanny appeal. Nevertheless, Yonder Is the Clock is the band's most nuanced effort to date, an effortless piece of Catskills folk and narrative know-how that shows just how far a band can grow in one year's time.","torrent":{"xt":"urn:btih:cfe31800d235062f2018babaacaea760e88d3a17","amp;dn":"The+Felice+Brothers+-+Yonder+Is+The+Clock%5B2009%5D%5BEAC%2Clog%2Ccue.+FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfe31800d235062f2018babaacaea760e88d3a17","infoHashBuffer":{"type":"Buffer","data":[207,227,24,0,210,53,6,47,32,24,186,186,172,174,167,96,232,141,58,23]},"announce":[],"urlList":[]}}