{"title":"The Cars - Blue Tip [Jimmy Fallon 05-24-2011] (720p).mpg","uid":6788979,"size":125564928,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d0987a8ab185ea043d9e96291e8fbeee81e5345b&amp;dn=The+Cars+-+Blue+Tip+%5BJimmy+Fallon+05-24-2011%5D+%28720p%29.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1320197905,"description":"The Cars - Blue Tip [Jimmy Fallon 05-24-2011] (720p).mpg\n\n\nHQ 720p Jimmy Fallon Show live performance music video. &quot;Blue Tip&quot; is a song by the American rock band The Cars from their 2011 album Move Like This. The song was written and sung by Cars lead vocalist and songwriter Ric Ocasek. \n\nThe song was originally previewed by the band as a 73-second sample on their Facebook page in October 2010. A full video for the song was released February 17, 2011\n\nThe Cars are an American rock band that emerged from the early New Wave music scene in the late 1970s. The band consisted of lead singer and rhythm guitarist Ric Ocasek, lead singer and bassist Benjamin Orr, guitarist Elliot Easton, keyboardist Greg Hawkes and drummer David Robinson. The band originated from Boston, Massachusetts, and were signed to Elektra Records by George Daly, then A&amp;R head, in 1977.\n\nThe Cars were at the forefront in merging 1970s guitar-oriented rock with the new synth-oriented pop that was then becoming popular and which would flower in the early 1980s. The Cars started fresh with their debut album The Cars which went on to go platinum in late 1978, The Cars debut album was called a &quot;genuine rock masterpiece&quot; by allmusic. Probably the most successful and well known song from the album &quot;Just What I Needed&quot;, started as a demo in 1977. The song was sent as a mix tape to a local DJ in the Boston area, who played the song in heavy rotation. This soon caught the attention of other DJ's, which led to the signing of the band by Elektra Records in 1977. The Cars have mentioned this numerous times including in their &quot;last&quot; interview in June 2000. Robert Palmer, music critic for The New York Times and Rolling Stone, described The Cars' musical style by saying: &quot;they have taken some important but disparate contemporary trends of punk minimalism, the labyrinthine synthesizer and guitar textures of art rock, the '50s rockabilly revival and the melodious terseness of power pop and mixed them into a personal and appealing blend.&quot;\n\nThe band broke up in 1988, and Ocasek had always discouraged talk of a reunion since then, telling one interviewer in 1997 &quot;I'm saying never and you can count on that.&quot; Bassist Benjamin Orr died in 2000 from pancreatic cancer. In 2005, Easton and Hawkes joined with Todd Rundgren to form a spin-off band, The New Cars, which performed classic Cars and Rundgren songs alongside new material. The remaining members reunited in 2010 to record a new album, titled Move Like This, which was released on May 10, 2011, and a tour started on the same day.\n(video has a mostly transparent white &quot;NBC Peacock&quot; logo at the bottom left)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Blue_Tip&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Blue_Tip&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/eakdoAAdM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/eakdoAAdM&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 1280x720 (16:9) 29.97fps 5800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 320kbps\n   Duration: 00:03:51\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated July 22, 2011\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n","torrent":{"xt":"urn:btih:d0987a8ab185ea043d9e96291e8fbeee81e5345b","amp;dn":"The+Cars+-+Blue+Tip+%5BJimmy+Fallon+05-24-2011%5D+%28720p%29.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0987a8ab185ea043d9e96291e8fbeee81e5345b","infoHashBuffer":{"type":"Buffer","data":[208,152,122,138,177,133,234,4,61,158,150,41,30,143,190,238,129,229,52,91]},"announce":[],"urlList":[]}}