{"title":"Powderfinger - Golden Rule CDRip 2009 [Cov+CD][Bubanee]","uid":5161334,"size":90411268,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d0f054c6094358072781cd111c9dbcd3e4653472&amp;dn=Powderfinger+-+Golden+Rule+CDRip+2009+%5BCov%2BCD%5D%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bubanee","files":18,"time":1258163004,"description":"Powderfinger\nOrigin \tBRISBANE, Australia\n\nIn this CDRip collection i have provided the Covers and CD JPegs [Pictures]\nAlong with EAC Log/Files and M3U Playlist\nPlease SEED for others to Enjoy!\nCheers, Bubanee\n\nPowderfinger is an Australian rock band. The band formed in Brisbane in 1989, and since 1992 their line-up has consisted of vocalist Bernard Fanning, guitarists Darren Middleton and Ian Haug, bassist John Collins, and drummer Jon Coghill.\n\nPowderfinger became a commercial success with their third studio album Internationalist in 1998. Since then they have released several hit singles and award-winning works earning them a total of fifteen ARIA Awards. Numerous Powderfinger albums have reached multiple-platinum status, as well as top 5 rankings in the weekly Australian music charts. Odyssey Number Five, Powderfinger's most successful album to date, earned over eight platinum certifications and ARIA Awards in five different categories.\n\nAfter the release of their first DVD These Days: Live in Concert and a &quot;best of&quot; release, Powderfinger announced a hiatus in 2005. The announcement of a two month-long nationwide tour with Silverchair entitled Across the Great Divide followed the release of their sixth studio album, Dream Days at the Hotel Existence in June 2007.\n\nAcross their sixteen year career, Powderfinger has been actively involved in philanthropic causes. In 2005, Powderfinger performed at a WaveAid concert in Sydney, to help raise funds for areas affected by the 2004 Indian Ocean earthquake. Another performance at the Sydney Opera House in October 2007 raised funds for breast cancer victims and their families. The aim of their recent Across the Great Divide tour was to promote the efforts of Reconciliation Australia, and to promote awareness of the gap in life expectancy between Indigenous and non-Indigenous children. \n\nGolden Rule is the upcoming seventh studio album by Australian rock band Powderfinger, set to be released on 13 November 2009. The album reunites the band with producer Nick DiDia, who produced several of the group's previous albums including, Internationalist, Odyssey Number Five and Vulture Street. The band recorded the album at Studio 301 in Byron Bay, New South Wales, beginning in June 2009, and completing the recording in August. The group's drummer Jon Coghill announced the name of the album on 11 September 2009.\n\nThe first single to be released will be &quot;All of the Dreamers&quot;, which was released on 16 October 2009. Lead singer Bernard Fanning describes the song as the &quot;most consistently upbeat song that we have written in our entire career,&quot; and that &quot;it's a sideways glance at the sometimes redundant nature of party politics&quot;, however he has stated that it is not a particularly political song, but rather &quot;a general dissatisfaction with the way democracy can be blindsided by the self interest that holding on to power can generate&quot;.\n\nOn November 6th it was mentioned by the band's lead guitarist Darren Middleton on the Powderfinger website that the upcoming second single off the album would be &quot;Burn Your Name&quot;. The video clip for the song was filmed in Thailand.\n\n   1. &quot;A Fight About Money&quot;\n   2. &quot;El Camino de la Muerte&quot;\n   3. &quot;All of the Dreamers&quot;\n   4. &quot;Burn Your Name&quot;\n   5. &quot;Sail the Wildest Stretch&quot;\n   6. &quot;Poison in Your Mind&quot;\n   7. &quot;Iberian Dreams&quot;\n   8. &quot;Jewel&quot;\n   9. &quot;Think It Over&quot;\n  10. &quot;Awake&quot;\n  11. &quot;Stand Yourself&quot;\n  12. &quot;Golden Rule&quot;\n","torrent":{"xt":"urn:btih:d0f054c6094358072781cd111c9dbcd3e4653472","amp;dn":"Powderfinger+-+Golden+Rule+CDRip+2009+%5BCov%2BCD%5D%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0f054c6094358072781cd111c9dbcd3e4653472","infoHashBuffer":{"type":"Buffer","data":[208,240,84,198,9,67,88,7,39,129,205,17,28,157,188,211,228,101,52,114]},"announce":[],"urlList":[]}}