{"title":"Western Architecture - From Ancient Greece to the Present","uid":14347630,"size":93966171,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1a6ffe64b0b49c563aa430ee40b3791f5ce3b8b&amp;dn=Western+Architecture+-+From+Ancient+Greece+to+the+Present&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1460995865,"description":"Western Architecture: From Ancient Greece to the Present (World of Art)\r\nThames and Hudson | 1999 | ISBN: 0500203164 | English | 388 pages | PDF | 90 MB\r\n\r\nWestern Architecture is an original and far-reaching survey of the history of architecture in Europe and North America, from ancient Greece to the present. From the earliest classical temples to today's achievements, over two thousand years of Western architectural history are summarized. Every architectural style is the product of an ideology, and the author shows how the buildings of Greece and Rome, of the Early Christian and Byzantine centuries, of the Gothic Middle Ages, the Renaissance, and the Enlightenment grew out of their respective cultures. In the nineteenth century the story in Europe and North America became more complicated, with the competing forces of Romanticism and industrial functionalism leading to apparently contradictory results–a situation that continues today in the clash between postmodernism and high-tech. But perspectives change, and every decade has its own views of the past. Eastern Europe has inevitably been underrepresented in Western criticism since 1945; Czech Baroque, Polish Neoclassicism, and Hungarian Art Nouveau provide some unexpected revelations. Illustrated throughout with photographs closely linked to the text, this is a guide for the student and general reader to follow into the twenty-first century","torrent":{"xt":"urn:btih:d1a6ffe64b0b49c563aa430ee40b3791f5ce3b8b","amp;dn":"Western+Architecture+-+From+Ancient+Greece+to+the+Present","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1a6ffe64b0b49c563aa430ee40b3791f5ce3b8b","infoHashBuffer":{"type":"Buffer","data":[209,166,255,230,75,11,73,197,99,170,67,14,228,11,55,145,245,206,59,139]},"announce":[],"urlList":[]}}