{"title":"The Death of Santini - Pat Conroy.epub","uid":9284469,"size":2515015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1c42892d89516aaad771a286fe7e20131b73d07&amp;dn=The+Death+of+Santini+-+Pat+Conroy.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1385990284,"description":"In this powerful and intimate memoir, the beloved bestselling author of The Prince of Tides and his father, the inspiration for The Great Santini, find some common ground at long last.\n\nPat Conroy's father, Donald Patrick Conroy, was a towering figure in his son's life. The Marine Corps fighter pilot was often brutal, cruel, and violent; as Pat says, &quot;I hated my father long before I knew there was an English word for 'hate.'&quot; As the oldest of seven children who were dragged from military base to military base across the South, Pat bore witness to the toll his father's behavior took on his siblings, and especially on his mother, Peg. She was Pat's lifeline to a better world-that of books and culture. But eventually, despite repeated confrontations with his father, Pat managed to claw his way toward a life he could have only imagined as a child.\n\nPat's great success as a writer has always been intimately linked with the exploration of his family history. While the publication of The Great Santini brought Pat much acclaim, the rift it caused with his father brought even more attention. Their long-simmering conflict burst into the open, fracturing an already battered family. But as Pat tenderly chronicles here, even the oldest of wounds can heal. In the final years of Don Conroy's life, he and his son reached a rapprochement of sorts. Quite unexpectedly, the Santini who had freely doled out physical abuse to his wife and children refocused his ire on those who had turned on Pat over the years. He defended his son's honor.\n\nThe Death of Santini is at once a heart-wrenching account of personal and family struggle and a poignant lesson in how the ties of blood can both strangle and offer succor. It is an act of reckoning, an exorcism of demons, but one whose ultimate conclusion is that love can soften even the meanest of men, lending significance to one of the most-often quoted lines from Pat's bestselling novel The Prince of Tides: &quot;In families there are no crimes beyond forgiveness.&quot;","torrent":{"xt":"urn:btih:d1c42892d89516aaad771a286fe7e20131b73d07","amp;dn":"The+Death+of+Santini+-+Pat+Conroy.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1c42892d89516aaad771a286fe7e20131b73d07","infoHashBuffer":{"type":"Buffer","data":[209,196,40,146,216,149,22,170,173,119,26,40,111,231,226,1,49,183,61,7]},"announce":[],"urlList":[]}}