{"title":"The Killers - Human (Thin White Duke Edit) - Day &amp; Age [2008]","uid":4568687,"size":7896293,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d32a434a0b7d7d845075648ec4f2c7926dd93775&amp;dn=The+Killers+-+Human+%28Thin+White+Duke+Edit%29+-+Day+%26+Age+%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sams-town","files":1,"time":1228975839,"description":"Human (Thin White Duke Edit) - 5:29\nThe Killers - Day &amp; Age [2008]\niTunes bonus track (US and Canada) (pre-order only)\n\n192kbs mp3\n\n-----\n\nThe Killers is an American alternative rock band from Las Vegas, Nevada. Formed in 2002, the group consists of Brandon Flowers (vocals, keyboards), Dave Keuning (guitar, vocals), Mark Stoermer (bass guitar, vocals) and Ronnie Vannucci Jr. (percussion, drums).\n\nPart of the post-punk revival movement, The Killers draw influence from music styles of the 1980s and 1990s. The group's debut album, Hot Fuss (2004) brought the band mainstream success. The Killers' second album, Sam's Town, was released in 2006, and the compilation album Sawdust containing B-sides, rarities, and new material, was released in 2007. The band's first two albums have sold in excess of 12 million copies worldwide combined and their third album, Day &amp; Age, produced by Stuart Price, was released in November 2008.\n\n-----\n\nStuart David Price (born in Paris, 9 September 1977) is a British electronic musician, songwriter, and producer whose remixing and production skills are coveted by artists including Madonna, Missy Elliott, The Killers, Gwen Stefani, Seal and most recently Keane. His acts include British electronic pop/rock band Zoot Woman (with Adam and Jonny Blake), Les Rythmes Digitales, Paper Faces, Man With Guitar, Thin White Duke, and the parodic French moniker Jacques Lu Cont, though he actually grew up in Reading, England.\n\n-----\n\nThis was the last track from Day &amp; Age that I had not yet seen uploaded to TPB. Please seed, and I hope this time my upload is faster :(\n\n-----\n\nThe Killers - Tidal Wave (Bonus Track) - Day &amp; Age [2008]\nhttp://thepiratebay.se/torrent/4561492","torrent":{"xt":"urn:btih:d32a434a0b7d7d845075648ec4f2c7926dd93775","amp;dn":"The+Killers+-+Human+%28Thin+White+Duke+Edit%29+-+Day+%26+Age+%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d32a434a0b7d7d845075648ec4f2c7926dd93775","infoHashBuffer":{"type":"Buffer","data":[211,42,67,74,11,125,125,132,80,117,100,142,196,242,199,146,109,217,55,117]},"announce":[],"urlList":[]}}