{"title":"Mary J. Blige feat. Jay Sean - Each Tear  (2nafish)","uid":5487219,"size":112388100,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d42b9c9f88797b6ed216237082c9f41e6be1085b&amp;dn=Mary+J.+Blige+feat.+Jay+Sean+-+Each+Tear++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1270796214,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Each Tear&quot; is a song performed by American R&amp;B recording artist Mary J. Blige. It will be released as the second international single from her ninth studio album Stronger With Each Tear. The song is originally sung by just Blige on the U.S. version of her album though on the re-release and on international releases the song is a featured duet to reflect each of the international markets.\n\nThe song was re-recorded with several different artists to reflect the international markets. It is featured on editions of the album with one of five people: with Jay Sean for the UK , for Italy with Tiziano Ferro; for Australia, Vanessa Amorosi, on the Canadian/U.S. release it features K'naan and for Germany it features Rea Garvey.\n\nThe Italian version was released to the Italian Itunes store on February 26, 2010. The Australian release of the song with Vanessa Amorosi will be on April 22, 2010. The German release with Rea Garvey will be released April 23, 2010. The UK version with Jay Sean will be released on April 26, 2010.\n\nStronger with Each Tear (often styled as Stronger withEach Tear) is the ninth studio album from American R&amp;B and soul  singer Mary J. Blige. The album was released in the U.S. on December 21, 2009 under Blige's own imprint Matriarch Records, making it her third consecutive album to be released during the Christmas period following The Breakthrough (2005) and Growing Pains (2007).\n\nInternationally it was released December 18, 2009 in Australia and Germany, December 21 in France, December 23 in Japan with further international releases (in some cases re-releases) in February and March 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d42b9c9f88797b6ed216237082c9f41e6be1085b","amp;dn":"Mary+J.+Blige+feat.+Jay+Sean+-+Each+Tear++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d42b9c9f88797b6ed216237082c9f41e6be1085b","infoHashBuffer":{"type":"Buffer","data":[212,43,156,159,136,121,123,110,210,22,35,112,130,201,244,30,107,225,8,91]},"announce":[],"urlList":[]}}