{"title":"Rick Springfield - I've Done Everything For You","uid":4767605,"size":116695044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d495ea7190909272ca6d61d9a42cb0ec906dec48&amp;dn=Rick+Springfield+-+I%5C%27ve+Done+Everything+For+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1236933029,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nRick Springfield (born Richard Lewis Springthorpe on August 23, 1949 in Sydney) is an Australian-American songwriter, musician and actor. As a musician he is most famous for the 1981 #1 single &quot;Jessie's Girl&quot;, which became a Grammy Award-winning landmark of 1980s pop-rock and helped establish the emerging music video age. Also an actor, Springfield's best known role is that of the character Dr. Noah Drake on the daytime drama General Hospital. He originated the character from 1981-1983 and then returned to play him again from 2005 until present. He then appeared on Don't Forget The Lyrics in January 2009 to sing his song &quot;Jessie's Girl&quot; and his new song &quot;What's Victoria's Secret.&quot; He stayed until the show was over. On March 19 2009 he plays a gig in support of Voices of Uganda at the Key Club in Los Angeles. The gig is co-organized by fellow General Hospital alum, actress Melissa Fitzgerald.\n\nAfter a break of several years to do some acting, Springfield returned to music in 1981 with the album Working Class Dog. Most notable on this album were the singles &quot;Jessie's Girl&quot;, which went to #1 on the Billboard charts, and &quot;I've Done Everything for You&quot; which was written by Sammy Hagar, and reached #8 on Billboard. Springfield won a Grammy in 1982 for &quot;Best Male Rock Vocal Performance&quot; for &quot;Jessie's Girl&quot;. Springfield was also nominated for a second Grammy in 1982 and a third Grammy in 1983. His subsequent release in 1982, the album Success Hasn't Spoiled Me Yet, also contained a string of top 40 hits including the #2 hit &quot;Don't Talk to Strangers&quot; and the ballad &quot;What Kind of Fool Am I?&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d495ea7190909272ca6d61d9a42cb0ec906dec48","amp;dn":"Rick+Springfield+-+I%5C%27ve+Done+Everything+For+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d495ea7190909272ca6d61d9a42cb0ec906dec48","infoHashBuffer":{"type":"Buffer","data":[212,149,234,113,144,144,146,114,202,109,97,217,164,44,176,236,144,109,236,72]},"announce":[],"urlList":[]}}