{"title":"Garth Brooks - The Thunder Rolls  (2nafish)","uid":5555318,"size":165091332,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d4971d835e2dd84d0da892cdcf0f5d67ed848a9f&amp;dn=Garth+Brooks+-+The+Thunder+Rolls++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1273623192,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Thunder Rolls&quot; is a song released by American  Country music artist Garth Brooks. It debuted on his second album No Fences and also appears on The Hits, The Limited Series, Double Live and The Ultimate Hits. &quot;The Thunder Rolls&quot; was written by Brooks and Pat Alger and was Garth Brooks' sixth number one on the country chart.\n\nIt was originally recorded by Tanya Tucker, but was never released until it appeared on her self-titled 1995 box set. Her version included a third verse which Brooks himself intended to use on his version, but did not at the suggestion of producer, Allen Reynolds.\n\nThe song begins with a man driving home in torrential rain, from &quot;somewhere that he never should have been&quot;. His wife is waiting at home for his return, &quot;praying it's the weather that's kept him out all night&quot;. When the man does return, the woman rushes out to meet him only to smell a perfume on his person, implying that he was with another woman.\n\nAlthough the recording featured only the first two verses, in concert Brooks often performed the third verse, to audience delight. When he began thinking about a video, Brooks chose to allude to the third verse by including the theme of domestic violence. This would tie together the two versions of the song. Brooks chose to play the central part of the philandering husband, so that he could &quot;make sure [the character] was so despicable that the whole viewing audience wanted to shoot him&quot;.\n\nBefore the video's release, Cathy Gurley, the head of public relations at Capitol Nashville, arranged a screening for industry women. They unanimously endorsed the video, describing it as a powerful statement against domestic violence. The video was released to CMT and The Nashville Network (TNN), where CMT immediately named it a &quot;Pick Hit&quot;. On May 1st, the day after the video's release, TNN banned the video. CMT pulled it soon after, with a CMT representative commentating that the network was &quot;in business to entertain, not to promote or condone gratuitious violence or social issues&quot;. TNN offered to resume airplay if Brooks would film a disclaimer for the end. Although Brooks and Gurley read the TNN script, he refused to film the additional scene, saying it felt as if he would be using the controversy to promote the video. Brooks told TNN they could add a disclaimer if they chose, but he was not going to compromise his vision.\n\nBecause the video had been pulled so quickly, few people had seen it. Radio stations, country bars, television stations and newspaper began requesting copies of the video so that they - and their audiences - could form their own opinions. Several radio stations in the United States screened the video at quickly-organized fund raisers for local battered women's shelters. Capitol Records was contacted numerous times by women's shelters, thanking the company for raising awareness of domestic violence. On May 7, VH-1, which generally aired pop videos, announced that they would begin playing &quot;The Thunder Rolls&quot;.\n\nThe following month, Capitol Nashville president Jimmy Bowen sent copies of the video to members of the Country Music Association, so that they could consider it for the upcoming awards show. On October 2, the video was awarded the CMA Video of the Year award.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d4971d835e2dd84d0da892cdcf0f5d67ed848a9f","amp;dn":"Garth+Brooks+-+The+Thunder+Rolls++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4971d835e2dd84d0da892cdcf0f5d67ed848a9f","infoHashBuffer":{"type":"Buffer","data":[212,151,29,131,94,45,216,77,13,168,146,205,207,15,93,103,237,132,138,159]},"announce":[],"urlList":[]}}