{"title":"All Good Things - Jerry Garcia Studio Sessions [VBR-MP3] !!!","uid":4785008,"size":633859297,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d62274c218c7eb41085127bf4bfd35bec86ed855&amp;dn=All+Good+Things+-+Jerry+Garcia+Studio+Sessions+%5BVBR-MP3%5D+%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"frostyfreeze","files":91,"time":1237517763,"description":"!!!FIXED!!!\n\nhere's what would be a rare and pricey little gem for your listening pleasure / as usual: no album covers, no booklet scan (this originally comes with a 128 pg. Booklet filled with great photos + stories; sorry,  but you can buy the thing if you want it that badly) - JUST music, encoded this time in VBR-MP3 with a range of 32-192Kbps, but with a more sensitive (accurate) conversion setting; not too shabby + saves on the size for up &amp; down times, please seed accordingly (i can't do it alone u know) / all track info was automatically filled by Windows Media Player so they may appear rather weird, just wanted to get this done quickly 4 y'all / questions, comments, up-rates + requests always welcomed / help put an end corporate to welfare + bailouts!!!\n- much love 2 u all, \n frosty\n\n                 THE CORRECT TITLE of DISC 6 is:\n                               &quot;Outtakes, Jams &amp; Alternates&quot;\n\nEditorial Reviews from Amazon.com:\n\nJerry Garcia fed an insatiable appetite for music in the '70s, a decade when the Grateful Dead released seven studio albums and three live collections. Simultaneously, he embarked on a solo career that, like the Dead's '70s records, alternately attempted to harness and indulge Garcia's free-flowing inspiration. All Good Things collects the five studio albums he recorded between 1972 and 1982 in one thoroughly annotated, generously enhanced box set. Garcia as a solo artist was most inspired when indulging his eclectic whims--the entirety of his almost-all-alone debut, 1972's Garcia, a then-revelatory acoustic-swing version of Irvin Berlin's &quot;Russian Lullaby,&quot; and any number of easy-flowing jams)--and least interesting when in the sway of contemporaneous rock and R&amp;B. Garcia wasn't so much a guy who honed albums as he was a musician who loved to play, whether the tapes were rolling or not. The producers of All Good Things take full advantage of his prolificacy, fleshing out each of the individual titles with bonus material and capping the box with a richly rewarding 12-song CD of outtakes and alternate versions. --Steven Stolder\n\nProduct Description from Amazon.com:\nOne of the most celebrated figures in all of rock 'n' roll, beloved Grateful Dead lead guitarist, vocalist, and eternal good-will ambassador Jerry Garcia pursued an eclectic array of folk, bluegrass, roots-rock, Motown and R&amp;B-influenced side projects throughout his storied career. Both acoustic and electric, solo and jamming with the Jerry Garcia Band, his albums apart from the massive output of Dead releases capture the diverse talents of an incomparable music legend. Spanning 1972-1982, this historic boxed set collects Garcia's five solo studio albums - all newly remastered and expanded - plus a must-have bonus disc filled entirely with previously unreleased gems from the vaults.\n\n\nfor complete tracklisting see:  &lt;a href=&quot;\nhttp://www.amazon.com/All-Good-Things-Garcia-Sessions/dp/B0001W0FD4/ref=sr_1_2?ie=UTF8&amp;s=music&amp;qid=1232000581&amp;sr=8-2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/All-Good-Things-Garcia-Sessions/dp/B0001W0FD4/ref=sr_1_2?ie=UTF8&amp;s=music&amp;qid=1232000581&amp;sr=8-2&lt;/a&gt;","torrent":{"xt":"urn:btih:d62274c218c7eb41085127bf4bfd35bec86ed855","amp;dn":"All+Good+Things+-+Jerry+Garcia+Studio+Sessions+%5BVBR-MP3%5D+%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d62274c218c7eb41085127bf4bfd35bec86ed855","infoHashBuffer":{"type":"Buffer","data":[214,34,116,194,24,199,235,65,8,81,39,191,75,253,53,190,200,110,216,85]},"announce":[],"urlList":[]}}