{"title":"I'm Sorry I Haven't A Clue (ISIHAC) BBC-Radio","uid":3647603,"size":9405398430,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d6d989beea8987a81c022dbf69d7af11a37b5036&amp;dn=I%5C%27m+Sorry+I+Haven%5C%27t+A+Clue+%28ISIHAC%29+BBC-Radio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"InnerRevolution7","files":474,"time":1174865393,"description":"This torrent contains two related long-running BBC Radio programs:\n\n**I&amp;#039;m Sorry I&amp;#039;ll Read That Again (1964-1973)**\n\nBilled as &amp;#039;Radio Prune,&amp;#039; this show starred John Cleese, Greame Garden, Tim Brooke-Taylor, Bill Oddie, Jo Kendall and David Hatch\n \nIrreverant sketch humor, post-Goon Show, pre-Monty Python. The show brought to the air silly voices, early shades of Python humor, mildly smutty jokes, purposely awful puns (light-heartedly booing a purposely bad pun would become as much a part of the show&amp;#039;s audience participation as laughing at the funnier jokes). It was totally anarchic for the times. \n\nThe show shines soley because of the talents of those present. John Cleese would later become one of the founding members of Monty Python&amp;#039;s Flying Circus, also famous for the BBC-TV program Fawlty Towers, and is undoubtedly one of the best comedy writers and performers ever. Bill Oddie and Greame Garden were regular performers on the show, and wrote the scripts with contributions from the others. (Python-to-be Eric Idle is also sometimes mentioned in the writing credits.) Garden and Oddie along with Tim Brooke-Taylor would later form &amp;#039;The Goodies&amp;#039; for BBC-TV. David Hatch was another regular on the show. He has gone on to become Managing Director of the BBC Network Radio.\n\nEpisodes during 1966-68 tend to have a fun, brilliant, Python-esque quality; including the &amp;#039;Curse Of The Flying Wombat&amp;#039; serial which is split up into 13 parts of the 1966 season. As more time passed though, the joke writing very gradually appears to become lazier in the 1969-73 seasons, and in retrospect those later episodes suffer and seem somewhat less quick-witted. It was around this time that Cleese&amp;#039;s interests turned toward the Monty Python troupe, although he did continue \nto appear in episodes of ISIRTA. In 1989, everyone reunited for the ISIRTA 25th Anniversary special which finds them once again at their best and is not to be missed.\n\n-----\n\n**I&amp;#039;m Sorry I Haven&amp;#039;t A Clue (1972-present)**\n\nBilled as &amp;#039;The anecdote to panel games,&amp;#039; the show consists of a panel of four comedians, split into two teams and &amp;#039;given silly things to do&amp;#039; by a chairman. Clue stars Graeme Garden, Barry Cryer, and Tim Brooke-Taylor. Comedy legend Willie Rushton was also a regular panelist on the show before his death in 1996.\n\nThe first season includes John Cleese and Bill Oddie as regulars, as the show was originally conceived as a continuation of &amp;#039;I&amp;#039;m Sorry I&amp;#039;ll Read That Again.&amp;#039; The idea was for the cast to continue into a new series without the burdon of having to write weekly scripts. Graeme Garden struck upon the idea of giving 4 funny people silly things to do, forcing them to improvise rather than having everything be pre-written in script form. The ground-breaking results have often been imitated but never equalled. The early shows sometimes can seem a bit stiff. The show found its true rhythm, debatably, beginning somewhere in the middle of the 1980&amp;#039;s. The fun still continues today.\n\nThe chairman is Humphrey Lyttelton, who has become legendary in his deadpan and comically-grumpy style of presiding over the show.","torrent":{"xt":"urn:btih:d6d989beea8987a81c022dbf69d7af11a37b5036","amp;dn":"I%5C%27m+Sorry+I+Haven%5C%27t+A+Clue+%28ISIHAC%29+BBC-Radio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6d989beea8987a81c022dbf69d7af11a37b5036","infoHashBuffer":{"type":"Buffer","data":[214,217,137,190,234,137,135,168,28,2,45,191,105,215,175,17,163,123,80,54]},"announce":[],"urlList":[]}}