{"title":"EnigmaT Set Rips { Cuts } - December 23rd, 2013","uid":9390193,"size":604760578,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d6f7621cb604de4f5af67bdd27f3664cd0c29bb4&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+23rd%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":79,"time":1387873687,"description":"7 Skies - Are We On Air (Set Rip)-enTc.mp3\nAeden - Destinations (Manuel Rocca Remix) (Cut From Rocca Set)-enTc.mp3\nAleksandr Voloshok - A Year Ago (Cut From M.PRAVDA Set)-enTc.mp3\nAlex H - Seeking Agapism (Cut From Ronde Set)-enTc.mp3\nAlex M.O.R.P.H. &amp; Natalie Gioia - Dreams (Alternative Club Mix) (Cut From MORPH Set)-enTc.mp3\nAlex Tunka - Beyond (Original Mix) (-Short- Cut From Rayel Set)-enTc.mp3\nAllen &amp; Envy - Forever Lost (Ikerya Project Remix) (Cut From Envy Set)-enTc.mp3\nAllen &amp; Envy - Mass Exodus (James Williams Remix) (Cut From Envy Set)-enTc.mp3\nAlvaro &amp; Joey Dale - Ready For Action (Cut From W&amp;W Set)-enTc.mp3\nAndy Elliass - Nargohtrond (Original Mix) (Cut From Random X Set)-enTc.mp3\nArman Aydin - Miura (Original Mix) (Cut From Faruk Set)-enTc.mp3\nArmin van Buuren - Intense (SaFe Shark Bootleg) (Cut From Malhotra Set)-enTc.mp3\nAstrix - Type 1 (Blazer Remix) (Cut From Pulse Origin Set)-enTc.mp3\nAzotti - The Miracle (Kago Pengchi Remix) (Cut From Ost Set)-enTc.mp3\nBen Preston Feat. Susie - This Feeling Inside (Las Salinas Remix) (Set Rip)-enTc.mp3\nBlaine Hilton - Take Me Back (G8 Pres. Changes Remix) (Cut From Calixta Set)-enTc.mp3\nBlasterjaxx - Mystica (Original Mix) (Cut From Vegas Set)-enTc.mp3\nChristian Drost - Central Station (Original Mix) (Cut From MIKE Set)-enTc.mp3\nChristopher Lawrence - The Dark (Casey Rasch Remix) (Cu From Sherry Set)-enTc.mp3\nCold Rush - Horizon (Original Mix) (Set Rip)-enTc.mp3\nCosmic Gate - So Get Up (Heatbeat Remix) (Set Rip)-enTc.mp3\nDave202 - ID (ABGT 058 Rip)-enTc.mp3\nDepeche Mode - Personal Jesus (Kash Tavedi Booty) (Cut From PvD Set)-enTc.mp3\nDiviner &amp; Aaheley Williams - Aura (Allen &amp; Envy Remix) (Cut From Random X Set)-enTc.mp3\nDualitik - Fiesta Sonora (Sterling Moss Remix) (Cut From Sherry Set)-enTc.mp3\nEddie Bitar &amp; Genix feat. Jennifer Rene - Drift (Eddie Bitar 140 Remix) (Cut From Sherry Set)-enTc.mp3\nEDX &amp; Nadia Ali - This Is Your Life (ID Remix) (ABGT 058 Rip)-enTc.mp3\nEDX - Angry Heart (ID Remix) (ABGT 058 Rip)-enTc.mp3\nEDX - ID (ABGT 058 Rip)-enTc.mp3\nExtravagance SL - Brera (Alex M.O.R.P.H. Remix) (Cut From MORPH Set)-enTc.mp3\nFanatic Emotions feat. Kate Lesing - Where Are You Now (Album Version) (Cut From Distant Moon Set)-enTc.mp3\nFaruk Sabanci - ID 001 (Cut From Faruk Set)-enTc.mp3\nFaruk Sabanci - ID 002 (Cut From Faruk Set)-enTc.mp3\nFrancesco Sambero &amp; Ian Flux - Suheila (Marsbeing Remix) (Cut From Sunny Set)-enTc.mp3\nGary B - Stronger Love (Steve Brian Remix) (ABGT 058 Rip)-enTc.mp3\nGreg Downey - Vivid Intent (Will Atkinson Dreamy Mix) (Cut From Sherry Set)-enTc.mp3\nID - ID (Cold Rush Remix) (Set Rip)-enTc.mp3\nID - Raveology (Original Mix) (Cut From Vegas Set)-enTc.mp3\nIndecent Noise feat. Ridgewalkers - Full Moon Fever (Power Vocal Mix) (Cut From Above Clouds Set)-enTc.mp3\nIRA feat. Sarah Russell - Constant Invasions (Azima Remix) (Cut From Envy Set)-enTc.mp3\nJohann Stone - White Walkers (Original Mix) (Cut From Sherry Set)-enTc.mp3\nJustin Oh feat. Jonny Rose - City Lights (ABGT 058 Rip)-enTc.mp3\nLaidback Luke &amp; Peking Duk - Mufasa (Original Mix) (Cut From Vegas Set)-enTc.mp3\nLondon Grammar - Strong (Judah Remix) (ABGT 058 Rip)-enTc.mp3\nLuke Bond feat. Stephy - Run &amp; Hide (Set Rip)-enTc.mp3\nMa5haria - Mettle (Sedi Remix) (ABGT 058 Rip)-enTc.mp3\nMallorca Lee feat. Ross Ferguson - She Said (Cut From Envy Set)-enTc.mp3\nManuel Rocca - Revitalia (Cut From Rocca Set)-enTc.mp3\nMarco Raineri - Logga (Original Mix) (Cut From R.I.C.K. Set)-enTc.mp3\nMark Eteson - Aventus (Vocal Mix) (Set Rip)-enTc.mp3\nMartin Garrix - Animals (Oliver Heldens Remix) (Cut From W&amp;W Set)-enTc.mp3\nMerk &amp; Kremont Vs. Amersy - Charger (Original Mix) (Cut From Vegas Set)-enTc.mp3\nMetallica - Enter Sandman (Sektor V Rework) (Set Rip)-enTc.mp3\nMichael Woods - Alt (Cut From W&amp;W Set)-enTc.mp3\nO.B.M Notion &amp; Airzoom - After Rain (Marcel Kenenberg Remix) (Cut From Kenenberg Set)-enTc.mp3\nOmega Drive - Roll It (Original Mix) (Cut From R.I.C.K. Set)-enTc.mp3\nPerpetuous Dreamer - The Sound Of Goodbye (Fanatic Emotions Remix) (Cut From Distant Moon Set)-enTc.mp3\nR3hab &amp; Nervo &amp; Ummet Ozcan - Revolution (Vocal Mix) (Cut From W&amp;W Set)-enTc.mp3\nRake feat. Emma Lock - Happiness (Mark Pledger Remix) (Cut From Sherry Set)-enTc.mp3\nReece Project - The Sound (TrancEye Remix) (Cut From Envy Set)-enTc.mp3\nRobert Vadney - Wasteland (Cut From PvD Set)-enTc.mp3\nRoger Shah - No Brainer (Original Mix) (Cut From Shah Set)-enTc.mp3\nRoman Messer feat. Christina Novelli - Frozen (Alex M.O.R.P.H. Remix) (-SAMPLE-)-enTc.mp3\nSamNSK - Human &amp; Nature (Original Mix) (Cut From Tom Amy Set)-enTc.mp3\nSenor Kuros - Sawanah (Original Mix) (Cut From Juliet Star Set)-enTc.mp3\nSergey Shabanov - Solitude (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nSir Adrian &amp; Katty Heath - Wider Horizon (Azotti Remix) (Set Rip)-enTc.mp3\nSolarstone feat. Lemon - Lovers (Alucard Remix) (Set Rip)-enTc.mp3\nSolarstone with Aly &amp; Fila - Fireisland (Suncatcher Remix) (Set Rip)-enTc.mp3\nSunlounger - Balearic Romance (Roger Shah Rework) (Cut From Shah Set)-enTc.mp3\nSunlounger feat. Andre Frauenstein - Mojito (Ari Kyle &amp; Audioscape Remix) (Cut From Shah Set)-enTc.mp3\nSuyano &amp; Billy The Kit - Busted (Origiinal Mix) (Cut From Vegas Set)-enTc.mp3\nT&amp;T feat. Nicci - Suicide (Original Mix) (Cut From Vegas Set)-enTc.mp3\nTasadi &amp; Aryas - Lost Garden (Orignal Mix) (Cut From Tasadi Set)-enTc.mp3\nVitor Valline &amp; E-Cologyk - Crystal Prism (Cut From W&amp;W Set)-enTc.mp3\nWoody van Eyden - Saripadanisa (Original Mix) (Cut From WvE Set)-enTc.mp3\nWoody van Eyden - Thrill of Speed (Cut From WvE Set)-enTc.mp3\nYves V &amp; D-Wayne - Crackle (Original Mix) (Cut From Vegas Set)-enTc.mp3\nZack Roth - Sleep Talking (ABGT 058 Rip)-enTc.mp3\n","torrent":{"xt":"urn:btih:d6f7621cb604de4f5af67bdd27f3664cd0c29bb4","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+23rd%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6f7621cb604de4f5af67bdd27f3664cd0c29bb4","infoHashBuffer":{"type":"Buffer","data":[214,247,98,28,182,4,222,79,90,246,123,221,39,243,102,76,208,194,155,180]},"announce":[],"urlList":[]}}