{"title":"Dark_Souls_[R.G.Origami]","uid":7569264,"size":2495618998,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d71dbd12db26811ea920ce4d4866864834491670&amp;dn=Dark_Souls_%5BR.G.Origami%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ciurlo76","files":8,"time":1345944128,"description":"System Requirements\n\nCPU: AMD Phenom II X2 545 3.0 Ghz - Intel Core 2 Duo E6850 3.0 Ghz \nRAM: 2 GB  \nVGA: ATI Radeon HD 4870 - GeForce 9800 GTX+ \nDX: 9.0c  \nOS: Windows XP, Windows Vista, Windows 7 or newer  \nHDD: 4 GB  \nSound: Direct Sound Compatible \nNetwork: Online play requires software installation of and log-in to Games For Windows - LIVE  \n\n\nDescription\n\nDark Souls: Prepare To Die Edition (1C-SoftKlab / Namco Bandai) (RUS / ENG / Mul Ti9) [Lossless Repack Totale] da RG Origami\n\nimage\n\nimage\n\nINFORMATION:\n\nâ–ª Released: August 24, 2012 \nâ–ª Genre: Action / RPG / 3rd Person \nâ–ª Developer: From Software \nâ–ª Publisher: 1C-SoftKlab / Namco Bandai\nâ–ª Publication Type: Repak \nâ–ª Language: English, Russian, German, French, Spanish , Italian, Chinese, Korean, Polish \nâ–ª Sound language: English \nâ–ª Tablet: Not required / FLT\n\n SYSTEM REQUIREMENTS:\n\n âˆš Operating System: Microsoft Windows XP / Vista / 7; \n âˆš Processor: Core 2 Duo 3 GHz; \n âˆš RAM: 2 GB; \n âˆš Video Card: GeForce 9800 GTX + / Radeon HD 4870 +; \n âˆš Free hard drive space: 3.65 GB\n\n DESCRIPTION:\n\n What kills you makes you stronger! Go to the dark and harsh world filled with despair. Your fate will depend on the ability to properly assess the situation and to build a strategy of behavior, learn quickly and be unpredictable. Dark Souls will require you to the absolute concentration and will be severely punished for the mistakes. But dying you become stronger! Each test is a puzzle with an infinite number of solutions. Useful to you in the first place, the ability to think strategically to defeat multiple opponents and finish your way.\n\nGAME FEATURES:\n\n - Darkly, difficult and exciting . Ruthlessness to mistakes and reward ingenuity - these are the principles Dark Souls. Learn how to think strategically, and then you will be able to overcome the most serious obstacles. Developed a unique playing style, develop your character and try different methods to overcome obstacles - the only way you can achieve success. \n - A world without borders . Explore a vast world in the style of dark fantasy where dungeons are organically intertwined with each other, forming a single play area. \n - to each his due . Dark Souls - it's 60 hours of game play, about a hundred unique monsters, incredible variety of weapons and magic spells, the effectiveness of which depends on the course of the battle, fighting style and characterization. \n - Mutual assistance . You can always interact with other players, without interrupting your own adventure. Network Features Dark Souls bring new experiences and impressions in a single player game. You can chat with other players, learn from their mistakes, or leave them a warning. \n - Role-based variety. During the game you can choose which character abilities to improve, according to their own tastes and preferences. On you will depend on your character will become master of the sword or the master of magic. \n - symbol of life and hope . An important part of Dark Souls is a beacon (Beacon Fire). This is not just a save point game progress and rebirth after death. He will be your refuge, peace-giving in the dark and violent world, as well as an emotional union with other adventurers.\n\nFeatures:\n\nâ–ª Do not cut / no recoded \nâ–ª Choosing to install a tablet or without \nâ–ª Installation of ~ 12 min ","torrent":{"xt":"urn:btih:d71dbd12db26811ea920ce4d4866864834491670","amp;dn":"Dark_Souls_%5BR.G.Origami%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d71dbd12db26811ea920ce4d4866864834491670","infoHashBuffer":{"type":"Buffer","data":[215,29,189,18,219,38,129,30,169,32,206,77,72,102,134,72,52,73,22,112]},"announce":[],"urlList":[]}}