{"title":"Patria - Nihil Est Monastica (2013)","uid":8832629,"size":102357573,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d78cc177c4601030f464140ded390c7571a52eab&amp;dn=Patria+-+Nihil+Est+Monastica+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Baphom3t","files":17,"time":1377027982,"description":"PATRIA's wrath was unleashed by Mantus (All instruments) &amp; Triumphsword (Vocals) through the first demo &quot;Hills of Mist&quot; in 2008. With the purpose to create a Necro Raw Metal in the vein of the early 90' Black Metal acts mixed with dark and ambient symphonies, they came in the middle of a failed modern world offering to the real darkness worshippers an extremely honest music straightly dedicated to their underground souls.\n\nIn 2009 the debut album &quot;Hymns of Victory and Death&quot; was released by the russian label Monokrom, getting a quite positive reviews from the specialized media and maniacs around the globe. The second album &quot;Sovereign Misanthropy&quot; was recorded and released in 2010, once and again by the great Monokrom, showing that same archaical feeling from the first one, but more into a ritualistic, weird and experimental metal way. Thirstily inspired they went fast through a MCD entitled &quot;Gloria Nox Aeterna&quot; out in September of 2010 by Monokrom, containing four exclusive songs plus the demo &quot;Hills of Mist&quot; and the videos &quot;Culto das Sombras&quot; and &quot;Old Blood Legacy&quot; as bonus.\n\nIn 2011 PATRIA have signed to the cult french label Drakkar Productions and released in June of the same year its third full-length opus &quot;Liturgia Haeresis&quot; in DIGI, LP and DOWNLOAD. The portuguese label Heavy Steel Records released the cassette edition. This material is still collecting very positive reviews from the underground zines to the major magazines, beyond a fantastic support from the real Black Metal manics around the planet.\n\nNow in 2012 we recently finished the recordings of our upcoming album &quot;Nihil Est Monastica&quot; that will be out in the first semester of 2013, once and again by Drakkar Productions [France]. The tenuous line between necro Black Metal and experimental avant-garde music in an epic journey when the south american madness meets the apocalyptical scandinavian vein. Twisted, dirty &amp; melodic in a very unique way! Definitely not for all ears!!! Cover art by Costin Chioreanu [Darkthrone, Ulver, Aura Noir].\n\n\nLine-Up\nTriumphsword [Vocals]\nMantus [All Instruments]\nIgniis Inferniis [Live Guitar]\nW.S. Vulkan [Live Bass]\nAbyssius [Live Drums]","torrent":{"xt":"urn:btih:d78cc177c4601030f464140ded390c7571a52eab","amp;dn":"Patria+-+Nihil+Est+Monastica+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d78cc177c4601030f464140ded390c7571a52eab","infoHashBuffer":{"type":"Buffer","data":[215,140,193,119,196,96,16,48,244,100,20,13,237,57,12,117,113,165,46,171]},"announce":[],"urlList":[]}}