{"title":"War And Peace - ElWoOd-Kusuku","uid":4590454,"size":1565396324,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d82cebf77f7208c0bd742b890c2c0a4c1123327e&amp;dn=War+And+Peace+-+ElWoOd-Kusuku&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ElWoOdBr","files":-1,"time":1229804831,"description":"&quot;War and Peace&quot; is the first English film version of the novel &quot;War and Peace&quot; by Leo Tolstoy. It is an American/Italian version, directed by King Vidor and produced by Dino De Laurentiis and Carlo Ponti. The music score was by Nino Rota and the cinematography by Jack Cardiff. The film was made by Dino de Laurentiis Productions and distributed by Paramount Pictures.\n\nThe film stars Audrey Hepburn, Henry Fonda, Mel Ferrer, Vittorio Gassman and Anita Ekberg with Herbert Lom, Oskar Homolka, Helmut Dantine, Tullio Carminati, Barry Jones, Milly Vitale, Anna-Maria Ferrero, Wilfrid Lawson, May Britt, Jeremy Brett and John Mills.\n\nIt was awarded the Golden Globe for Best Foreign-Language Foreign Film and it had Academy Awards nominations for Best Director (King Vidor), Best Cinematography, Color (Jack Cardiff) and Best Costume Design, Color (Maria De Matteis).\n\n&quot;War and Peace&quot; is a novel by Leo Tolstoy, first published from 1865 to 1869 in the newspaper called &quot;Russkii Vestnik&quot;, which tells the story of Russian society during the Napoleonic Era. It is usually described as one of Tolstoy's two major masterpieces, the other being &quot;Anna Karenina&quot;, as well as one of the world's greatest novels.\n\n&quot;War and Peace&quot; offered a new kind of fiction, with a great many characters caught up in a plot that covered nothing less than the grand subjects indicated by the title, combined with the equally large topics of youth, marriage, age, and death. Though it is often called a novel today, it broke so many conventions of the form that it was not considered a novel in its time.\n\n\n\nSize: 1,49 GB\nVideo: Xvid 688x400 23.98fps 803Kbps\nAudio: In English, on Dolby AC3 48000Hz stereo 192Kbps\nSubtitles: English and Spanish\n\n\n\n-=Calma que jÃƒÂ¡ vai pro portal!=-","torrent":{"xt":"urn:btih:d82cebf77f7208c0bd742b890c2c0a4c1123327e","amp;dn":"War+And+Peace+-+ElWoOd-Kusuku","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d82cebf77f7208c0bd742b890c2c0a4c1123327e","infoHashBuffer":{"type":"Buffer","data":[216,44,235,247,127,114,8,192,189,116,43,137,12,44,10,76,17,35,50,126]},"announce":[],"urlList":[]}}