{"title":"Democracy Now - 12 jan 2012","uid":6950518,"size":454280594,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d92bd9d9fc6cad7b9003f7f5dba401a4cd7f4e3a&amp;dn=Democracy+Now+-+12+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1326385074,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 12, 2012\n\n- Karzai Condemns Video of US Marines Urinating on Afghan Corpses\n- Nigeria Strike Day 4: Oil Workers Threaten to Shut Down Oil Production\n- Iran Urges U.N. to Condemn Assassination of Nuclear Scientist\n- Christian Right Leaders to Gather to Pick Anti-Romney Candidate\n- Republicans Ask Court to Allow For Unlimited Corporate Donations to Campaigns\n- Survey: Class Conflict Growing in U.S. Between Rich and Poor\n- Haiti Marks Two Years Since Devastating Earthquake\n- Chinese Workers at Xbox Factory Threaten To Commit Mass Suicide\n- Hundreds Protest Against GuantÃƒÂ¡namo in Washington\n- Lawsuit Filed Seeking Info On Use of Drones Inside United States\n\n\nSpecial reports\n\n- Ex-FCC Commissioner Michael Copps on Media Consolidation, Broadband Expansion, Threats to Journalism\n\nMichael Copps served two terms with the Federal Communications Commission. Now the staunch supporter of an open internet and opponent of media consolidation has retired. In a wide ranging discussion, he examines the FCC's key accomplishments and failures of the past decade. Copps argues broadband is &quot;the most opportunity-creating technology perhaps in the history of humankind,&quot; and laments that the United States still lacks a national broadband infrastructure. He says the FCC has yet to address a lack of diversity in media ownership, noting that &quot;owning a station has a lot to do with the kind of programing that is going to be on that station.&quot; Regarding the future of journalism, he calls on the FCC to make access to quality journalism a &quot;national priority,&quot; saying, &quot;the future of our democracy hinges upon having an informed electorate.&quot;\n\n\n- A Path to War? Assassination of Iran Nuclear Scientist, New Sanctions Strain U.S.-Iran Relations\n\nIran says a nuclear scientist involved in its uranium enrichment program was killed by assassins in Tehran on Wednesday, becoming the latest Iranian scientist to die in a series of similar incidents. Earlier this week, Iran announced it had sentenced a U.S.-born man to death for allegedly spying for the CIA. Meanwhile, the United States is leading a global campaign to shut down Iranian oil exports in order to pressure the country to end its alleged nuclear weapons program. Iran responded by threatening to close the Strait of Hormuz, a major transit point for one fifth of oil traded worldwide. &quot;If we are increasing the sense of threat, we may be able to prevent [the Iranian's] capabilities to a certain extent, but we're also increasing their desire for the nuclear deterrent,&quot; says Trita Parsi, founder and president of the National Iranian American Council. &quot;At some point, that desire will overcome the obstacles. In essence, you cannot threaten a country into feeling secure.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d92bd9d9fc6cad7b9003f7f5dba401a4cd7f4e3a","amp;dn":"Democracy+Now+-+12+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d92bd9d9fc6cad7b9003f7f5dba401a4cd7f4e3a","infoHashBuffer":{"type":"Buffer","data":[217,43,217,217,252,108,173,123,144,3,247,245,219,164,1,164,205,127,78,58]},"announce":[],"urlList":[]}}