{"title":"Little Women (1949).avi","uid":8433781,"size":732055552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d97e7f2a4121ca6aff0691b6d7dccff6a013b422&amp;dn=Little+Women+%281949%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carabina","files":1,"time":1367566475,"description":"AllMovie synopsis:\n\nOf the many film versions of Louisa May Alcott's Little Women, this 1949 MGM adaptation is by far the prettiest. Set in New England during the Civil War, the film relates the various adventures of the March sisters: Jo (June Allyson), Beth (Margaret O'Brien), Amy (Elizabeth Taylor) and Meg (Janet Leigh). Jo emerges as the main character, as she leaves hearth and home to try her luck as a novelist in New York. Moments of high comedy (the sisters' amateur theatricals) are counterpointed with grim tragedy (the death of the youngest March girl), with romantic interludes provided by the faithless Laurie (Peter Lawford) and the loyal Professor Bhaer (Rossano Brazzi). Unlike Selznick's 1933 Little Women or Gillian Armstrong's 1994 adaptation, this 1949 version tends to be more an extension of the old Hollywood contract-player typecasting system than a heartfelt evocation of the Alcott original. Even so, Little Women is consistently pleasing to the eye, especially when seen in its original Technicolor \n\nIMDB Summary:\nLouisa May Alcott's autobiographical account of her life with her three sisters in Concord Mass in the 1860s. With their father fighting in the civil war, the sisters: Jo, Meg, Amy and Beth are at home with their mother - a very outspoken women for her time. The story is of how the sisters grow up, find love and find their place in the world. Written by Rob Hartill\n\nMeg, Josephine, Amy and Beth are the little women who, together with their mother, keep the home fires burning while their preacher father serves with the Union army during the Civil War. Meg, the eldest, is a second mother to the troupe while &quot;Jo&quot;, the tomboy, takes on the role of man of the house. Amy yearns for the good things in life, and Beth, the youngest and frailest of the four, seeks comfort in gentle music. A simple tale of four young girls coming to womanhood. This is a great summary but, I wanted to mention that Beth is not the youngest March sister - Amy is. The order is Meg, Jo, Beth, Amy.\n\nRuntime:121 min\nYear: 1949\nRuntime: 121 Min\nDirected: Mervyn LeRoy\n\n","torrent":{"xt":"urn:btih:d97e7f2a4121ca6aff0691b6d7dccff6a013b422","amp;dn":"Little+Women+%281949%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d97e7f2a4121ca6aff0691b6d7dccff6a013b422","infoHashBuffer":{"type":"Buffer","data":[217,126,127,42,65,33,202,106,255,6,145,182,215,220,207,246,160,19,180,34]},"announce":[],"urlList":[]}}