{"title":"Virtual CD-ROM Control Panel-INSTALL VIRTUAL DRIVES","uid":8503157,"size":61064,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d9a7b2ef8a412dd07ce888f53131f7f2ecbbd2ff&amp;dn=Virtual+CD-ROM+Control+Panel-INSTALL+VIRTUAL+DRIVES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prodallasosoft","files":1,"time":1369354515,"description":"This utility enables users of Windows XP, Windows Vista, and Windows 7 to mount ISO disk image files as virtual CD-ROM drives\n\n4/23/2013\nVersion: 2.0.1.1\nThe Virtual CD-ROM Control Panel utility enables users of Windows XP, Vista, and 7 to mount ISO disk image files as virtual CD-ROM drives. This can be highly useful for reading disk images to install software or recover backup files. Notes: This tool is not supported by Microsoft; use at your own risk. Windows 8 users do NOT need this tool. Windows 8 natively supports ISO files. In Windows 8, you can simply open an ISO file and Windows automatically assigns it a drive letter and reads it as a virtual drive. \n\n\nSupported Operating System\n\nWindows 7, Windows Server 2003, Windows Server 2008, Windows Server 2008 R2, Windows Vista, Windows XP\n\n    Windows XP, Windows Vista, or Windows 7; Windows Server 2003, Windows Server 2008, or Windows Server 2008 R2 \n\nThis is a self-extracting Zip archive. Download the file and execute it. Click Unzip and select any appropriate folder to extract the contents. Before using this tool, read the readme.txt file and follow its instructions for installation and use. \n\nHere are the directions on how to install, these come with exe file\nReadme for Virtual CD-ROM Control Panel v2.0.1.1\n\nSystem Requirements\n===================\n- Windows XP Home or Windows XP Professional\n\nInstallation instructions\n=========================\n1. Copy VCdRom.sys to your %systemroot%system32drivers folder. \n2. Execute VCdControlTool.exe\n3. Click &quot;Driver control&quot;\n4. If the &quot;Install Driver&quot; button is available, click it. Navigate to the %systemroot%system32drivers folder, select VCdRom.sys, and click Open.\n5. Click &quot;Start&quot;\n6. Click OK\n7. Click &quot;Add Drive&quot; to add a drive to the drive list. Ensure that the drive added is not a local drive. If it is, continue to click &quot;Add Drive&quot; until an unused drive letter is available.\n8. Select an unused drive letter from the drive list and click &quot;Mount&quot;.\n9. Navigate to the image file, select it, and click &quot;OK&quot;. UNC naming conventions should not be used, however mapped network drives should be OK.\n\nYou may now use the drive letter as if it were a local CD-ROM device. When you are finished you may unmount, stop, and remove the driver from memory using the driver control.\n This worked well on Windows 7 Pro/ I used Winrar to open the Zip file, you use what you like.","torrent":{"xt":"urn:btih:d9a7b2ef8a412dd07ce888f53131f7f2ecbbd2ff","amp;dn":"Virtual+CD-ROM+Control+Panel-INSTALL+VIRTUAL+DRIVES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9a7b2ef8a412dd07ce888f53131f7f2ecbbd2ff","infoHashBuffer":{"type":"Buffer","data":[217,167,178,239,138,65,45,208,124,232,136,245,49,49,247,242,236,187,210,255]},"announce":[],"urlList":[]}}