{"title":"Currency Converter Plus v3.5.1 APK (Android)","uid":14408049,"size":5330872,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:da9847f23090d9dfe8300600a7ec1cb8bfc03088&amp;dn=Currency+Converter+Plus+v3.5.1+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pahly","files":1,"time":1461434107,"description":"Simple currency converter and exchange rates calculator for up to 15 currencies at once!\r\nWe’ve seen it all – various currency converters, exchange rates lists with charts and historic data. But who need all that fancy stuff, when you simply need to find out on holiday how much does that thing cost, right?\r\nThis app will do exactly what you’d expect of it during the vacation in some country. It’s main advantage is that you can choose up toto 15 currencies that are visible on mainscreen.\r\nConversion will take place right away – just as you start to type the numbers.\r\n\r\nDo you wish to do some math with the numbers? No problem – use built-in calculator. Result will be automaticaly converted to all currencies. Can’t find your currency? Just add it as a new currency code and simply run update. App will download it’s name and fresh exchange rate. From now on it will always auto-update.\r\n\r\nMain features of this currency converter are:\r\n– nice graphics, also suited for tablets and android wear.\r\n– ease of use – convert up to 15 currencies at once!\r\n– offline usage – roaming prices are no longer a problem now – all the exchange rates are cached!\r\n– filter of currencies – just press search in list\r\n– various preferences that allows you to change all the small things\r\n– online update is provided via European central bank, Additional sources, RSS feeds or you can manually add any custom currency\r\n\r\nWhat’s New\r\n– Performance improvements\r\n– Fixed minor issues reported by users\r\n\r\nRequirements: 2.3.3 and up","torrent":{"xt":"urn:btih:da9847f23090d9dfe8300600a7ec1cb8bfc03088","amp;dn":"Currency+Converter+Plus+v3.5.1+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da9847f23090d9dfe8300600a7ec1cb8bfc03088","infoHashBuffer":{"type":"Buffer","data":[218,152,71,242,48,144,217,223,232,48,6,0,167,236,28,184,191,192,48,136]},"announce":[],"urlList":[]}}