{"title":"Shadows - At Abbey Road (2003)  FLAC","uid":5833075,"size":361374483,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dac3cf1d8923a6c3da2b5831a096aa3ac4a9c902&amp;dn=Shadows+-+At+Abbey+Road+%282003%29++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"keeybee","files":29,"time":1284590789,"description":"Please seed!\n\nThe Shadows are a British pop group with a total of 69 UK hit charted singles: 35 as 'The Shadows' plus 34 as 'Cliff Richard and The Shadows', from the 1950s to the 2000s. The Shadows were also very successful in the British EP charts that were compiled by several different publications during the 1960s based on sales statistics from a limited number of retailers around the country. Typically The Shadows and Cliff Richard &amp; The Shadows each had 4 No.1 selling EPs. According to British Hit Singles &amp; Albums (19th edition), The Shadows\nare the third most successful UK charted hit-singles act, behind Elvis Presley and Cliff Richard.  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Shadows&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Shadows&lt;/a&gt;\n\n\nAt Abbey Road - The Shadows\nDisky 2003\n\n01  The Shadows - At Abbey Road - Guitar Tango (Un-issued un-dubbed version)\n02  The Shadows - At Abbey Road - Theme From 'The Boys' (Un-dubbed version)\n03  The Shadows - At Abbey Road - Wonderful Land (Un-issued version (mono))\n04  The Shadows - At Abbey Road - Atlantis (Un-dubbed version)\n05  The Shadows - At Abbey Road - Gonzales (Original mono LP version)\n06  The Shadows - At Abbey Road - Witch Doctor (The Savage) (Un-issued film version)\n07  The Shadows - At Abbey Road - It's Been A Blue Day (Un-issued alternative un-dubbed version)\n08  The Shadows - At Abbey Road - What A Lovely Tune (Un-issued stereo version)\n09  The Shadows - At Abbey Road - All Day (Un-issued alternative version)\n10  The Shadows - At Abbey Road - Razzmataz (Un-issued alternative version)\n11  The Shadows - At Abbey Road - Nothing, Folks (Un-issued instrumental track)\n12  The Shadows - At Abbey Road - No, No, Nina (Un-issued instrumental version)\n13  The Shadows - At Abbey Road - John's Rocker (Un-issued  version of 'I Wish I Could Shimmy Like My Sister Arthur')\n14  The Shadows - At Abbey Road - Don't Stop Now (Alternative version)\n15  The Shadows - At Abbey Road - God Only Knows(Un-issued remixed and modified version)\n16  The Shadows - At Abbey Road - Slaughter On 10th Avenue\n17  The Shadows - At Abbey Road - Benno-san(Alternative version)\n18  The Shadows - At Abbey Road - Zero X Theme (Stereo re-mix)\n19  The Shadows - At Abbey Road - Thunderbirds Theme (Stereo re-mix)\n20  The Shadows - At Abbey Road - Scotch On The Rocks (Stereo re-mix)\n21  The Shadows - At Abbey Road - Tennessee Waltz (Alternative version)\n22  The Shadows - At Abbey Road - Chitty Chitty Bang Bang (Un-issued instrumental)\n23  The Shadows - At Abbey Road - Don't Cry For Me Argentina (Un-issued full stereo version)\n &lt;a href=&quot;\nhttp://www.cmt.com/artists/az/shadows_oldies_/1171702/album.jhtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmt.com/artists/az/shadows_oldies_/1171702/album.jhtml&lt;/a&gt;\n","torrent":{"xt":"urn:btih:dac3cf1d8923a6c3da2b5831a096aa3ac4a9c902","amp;dn":"Shadows+-+At+Abbey+Road+%282003%29++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dac3cf1d8923a6c3da2b5831a096aa3ac4a9c902","infoHashBuffer":{"type":"Buffer","data":[218,195,207,29,137,35,166,195,218,43,88,49,160,150,170,58,196,169,201,2]},"announce":[],"urlList":[]}}