{"title":"Isabela FTVMembers 1-18-09","uid":4676719,"size":4004744185,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:dadda4809d010a19db2f9acf92e52a6fda3c74c3&amp;dn=Isabela+FTVMembers+1-18-09&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KittensAshes","files":263,"time":1232923740,"description":"1/18/09 update from ftv of Isabela\n\n\n----------------------------------------------------------------------\n\n249 Photos, 3700 Mb Video Added.\n\nAt a busy and 'sassy' mall where all the hot girls go to shop, we spot a very sexy girl going shopping.  Checking her out in her sexy clothes and heels, we stop to ask her to pose for FTV.  Soon enough, she's flashing those big breasts -- and doesn't mind the risk or attention!  Going to a boutique, she videotapes herself going naked and changing into some sexy clothes.  More flashing at the mall, then she changes into a bikini, and starts splashing around in the water fountain in the middle of the mall square!!  Getting a little too much attention, its time to go home.  Taking off her bikini, she skinny dips into the pool, then plays with herself as we get some extreme closeups.  Drying herself up, she gives her body a nice hard breast and butt massage (hot!).  Finding the comforts of the bedroom, she wears a sexy white (seethrough) top and starts masturbating with a vibrator.  One strong orgasm later, and she's up to a second one!  Notice the strong contractions.  She plays with her long labia, and spreads open for some deep wide closeups.  Out to a lunch break, she does an interview about her sex life.  Then its off to the park, in a very cute short dress &amp; heels, and you'd think she'd just pose there... instead doing cartwheels and other acrobatics, all while we watch her breasts fall out (and see between her legs).  Then she starts climbing a tree, and playing with herself up there!  Hot moments for sure, until we get caught and its time to leave.  She decides to do something very FTV style... a First Time fisting!  Still in her cute dress, she slips several fingers inside, working them deep... until she has her whole fist in her!  She works it hard and deep, getting aroused -- a hot fisting scene for sure!  Then she needs to masturbate again, using a vibrator for one last climax.  Enjoy this First Time Video girl, she is definitely a gorgeous addition to the site.\n\n-----------------------------------------------------------------------\n\n","torrent":{"xt":"urn:btih:dadda4809d010a19db2f9acf92e52a6fda3c74c3","amp;dn":"Isabela+FTVMembers+1-18-09","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dadda4809d010a19db2f9acf92e52a6fda3c74c3","infoHashBuffer":{"type":"Buffer","data":[218,221,164,128,157,1,10,25,219,47,154,207,146,229,42,111,218,60,116,195]},"announce":[],"urlList":[]}}