{"title":"David Niven - The Moon's a Baloon","uid":4081263,"size":31550991,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:db1e6b204a295d7f1e8af84f333288209122c1cc&amp;dn=David+Niven+-+The+Moon%5C%27s+a+Baloon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paulyearwig","files":5,"time":1205539616,"description":"General Information\n===================\n Title:                  The Moon&amp;#039;s a Balloon\n Author:                 David Niven\n Copyright:              1977\n Audiobook Copyright:    1977\n Genre:                  Speech\n\nFile Information\n================\n Number of MP3s:         4\n Total Duration:         2:11:17\n Total MP3 Size:         30.09\n\n\nBook Description\n================\nPublished in 1972, THE MOON&amp;#039;S A BALLOON proved one of the great bestsellers \nof the decade--and if you read the first page you&amp;#039;ll know why. You are \nimmediate hooked by star David Niven&amp;#039;s wild, wicked sense of humor. \nWhether it is his Dickensian childhood, his outrageous tour of duty \nwith the British military, or his climb to unexpected stardom, this \nis truly Niven exactly as you imagine he would be. \n\nImagine, however, seems to be an operative word. Niven was less interested \nin relating the facts of his life than he was in telling a good story \nand in putting his best face to the public--something that is not entirely \nunexpected in an autobiography, particularly the autobiography of a \nHollywood star. Later writers have noted that Niven played fast and \nloose with the facts in THE MOON&amp;#039;S A BALLOON, and that for all his charm \nhe could be viciously despicable when the mood took him; it is also \nworth pointing out that he was never quite the &quot;A List&quot; star that he \nseems to be in his memoirs. \n\nBut all this is actually a little beside the point. Whether it is factually \naccurate and emotionally honest or not, THE MOON&amp;#039;S A BALLOON is simply \na delightful read right from the first page, where we meet Nessie, the \nPicadilly hooker who introduced Niven to the joys of the flesh. Approximately \nhalf the book concerns Niven&amp;#039;s life before he arrived in Hollywood as \na would-be actor, and it is a riotous ride; once Niven hits the film \nindustry, however, he begins to name drop with the best of them--offering \nmemorable glimpses of such famous names as director William Wyler and \nstars Laurence Olivier and Vivian Leigh. It is all fascinating stuff. \n\nIt can also be quite startling. As just one example among many, when \nwriting of his first wife&amp;#039;s death Niven mentions that Joan Crawford \nstepped in to care for his children while he attempted to cope with \nhis grief. Yikes! And although he was a great womanizer and cut a swath \nthrough Hollywood&amp;#039;s beauties, Niven does no name dropping there; he \ndoes, however, describe an affair with a &quot;Great Big Star&quot; who was very \nlikely Merle Oberon, the leading lady of WUTHERING HEIGHTS. \n\nTrue enough, THE MOON&amp;#039;S A BALLOON will hardly stand a cold factual analysis--bu-\nt it is a tremendously fun thing to read, a joyous and fun book, and \nwhile quite a lot of it is of the &quot;tall tale&quot; variety it certainly presents \nthe star as he likely most wished to be seen and be remembered. Don&amp;#039;t \npick it for bedtime reading, because you&amp;#039;ll never put it down! Recommended.-\n\n","torrent":{"xt":"urn:btih:db1e6b204a295d7f1e8af84f333288209122c1cc","amp;dn":"David+Niven+-+The+Moon%5C%27s+a+Baloon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db1e6b204a295d7f1e8af84f333288209122c1cc","infoHashBuffer":{"type":"Buffer","data":[219,30,107,32,74,41,93,127,30,138,248,79,51,50,136,32,145,34,193,204]},"announce":[],"urlList":[]}}