{"title":"The Tangled Web {BBS}","uid":6917744,"size":4178455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbc92427146045f1ed91abfcfbfbd46608e69adf&amp;dn=The+Tangled+Web+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1325090684,"description":"&quot;Thorough and comprehensive coverage from one of the foremost experts in browser security.&quot;\n--Tavis Ormandy, Google Inc.\n\nModern web applications are built on a tangle of technologies that have been developed over time and then haphazardly pieced together. Every piece of the web application stack, from HTTP requests to browser-side scripts, comes with important yet subtle security consequences. To keep users safe, it is essential for developers to confidently navigate this landscape.\n\nIn The Tangled Web, Michal Zalewski, one of the world's top browser security experts, offers a compelling narrative that explains exactly how browsers work and why they're fundamentally insecure. Rather than dispense simplistic advice on vulnerabilities, Zalewski examines the entire browser security model, revealing weak points and providing crucial information for shoring up web application security. You'll learn how to:\n\n    * Perform common but surprisingly complex tasks such as URL parsing and HTML sanitization\n    * Use modern security features like Strict Transport Security, Content Security Policy, and Cross-Origin Resource Sharing\n    * Leverage many variants of the same-origin policy to safely compartmentalize complex web applications and protect user credentials in case of XSS bugs\n    * Build mashups and embed gadgets without getting stung by the tricky frame navigation policy\n    * Embed or host user-supplied content without running into the trap of content sniffing\n\nFor quick reference, &quot;Security Engineering Cheat Sheets&quot; at the end of each chapter offer ready solutions to problems you're most likely to encounter. With coverage extending as far as planned HTML5 features, The Tangled Web will help you create secure web applications that stand the test of time.\n\n\n# Paperback: 320 pages\n# Publisher: No Starch Press; 1 edition (November 26, 2011)\n# Language: English\n# ISBN-10: 1593273886\n# ISBN-13: 978-1593273880","torrent":{"xt":"urn:btih:dbc92427146045f1ed91abfcfbfbd46608e69adf","amp;dn":"The+Tangled+Web+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbc92427146045f1ed91abfcfbfbd46608e69adf","infoHashBuffer":{"type":"Buffer","data":[219,201,36,39,20,96,69,241,237,145,171,252,251,251,212,102,8,230,154,223]},"announce":[],"urlList":[]}}