{"title":"HISTORY OF POP AND ROCK MUSIC - part 555","uid":9620343,"size":680529642,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dd4bd4157cb542302a7b120c225c08086218ecac&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+555&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1392491923,"description":"\n\n                           PART  555\n\n\n         The Black Crowes are an American rock band formed in 1989. Their discography includes nine studio albums, four live albums and several charting singles. The band was signed to Def American Recordings in 1989 by producer George Drakoulias and released their debut album, &quot;Shake Your Money Maker&quot;, the following year. The follow-up, &quot;The Southern Harmony and Musical Companion&quot;, reached the top of the Billboard 200 in 1992. \nAfter a hiatus between 2002 and 2005, the band released &quot;Warpaint&quot;, which hit number 5 on the Billboard chart. After the release of a double album, the greatest hits-like and mostly acoustic &quot;Croweology&quot; in August 2010, the band started a 20th anniversary tour that was followed by an ongoing second hiatus. The band has announced that they will return in early 2013.\n         The band has sold over 30 million albums, and is listed at number 92 on VH1's &quot;100 Greatest Artists of Hard Rock&quot;. They were also labeled by Melody Maker as &quot;The Most Rock 'n' Roll Rock 'n' Roll Band in the World&quot; and the readers of Rolling Stone voted them 'Best New American Band' in 1990.\n\n\n\n             THE BLACK CROWES  -  Hard to Handle  (1990)\n             THE BLACK CROWES  -  Remedy  (1992)\n             THE BLACK CROWES  -  Only A Fool  (1999)\n             THE BLACK CROWES  -  Lickin (2001)\n\n\n            &quot;Hard to Handle&quot; is a 1968 song originally recorded by Otis Redding and written by Redding, Al Bell and Allen Jones. It was released posthumously after Redding's death in 1967 on the album &quot;The Immortal Otis Redding&quot;. Redding's version reached #38 on the Billboard R&amp;B charts and #51 on the pop charts.Perhaps the most notable cover is that by The Black Crowes, for whom it was their breakout hit single from their 1990 debut album &quot;Shake Your Money Maker&quot;. Two versions of the song exist: the original album version and the hit single remixed with an overdubbed brass section. The Crowes' version reached number one on the Billboard Album Rock Tracks chart and number 26 on the Billboard Hot 100.\n\n            &quot;Remedy&quot; is the second track by The Black Crowes from their second album, &quot;The Southern Harmony and Musical Companion&quot;. It reached #1 on the Billboard Album Rock Tracks chart in May 1992 and stayed at #1 for 11 weeks. On the Billboard Hot 100 chart, the song peaked at #48. The song can be heard on the fictional radio station &quot;Liberty Rock Radio 97.8&quot; in the video game Grand Theft Auto IV. \n\n              &quot;Only A Fool&quot;  is a  song written and performed by The Black Crowes., released as a single in January 12, 1999 and included in the album &quot;By Your Side&quot; of the same year.The Black Crowes promoted  &quot;By Your Side&quot; by performing on numerous television programs in North America and Europe. The album debuted at its peak position of number 26 on the Billboard 200 and generally received positive reviews. While some critics depreciated &quot;By Your Side&quot; for its similarity to albums by Rod Stewart and The Rolling Stones, most reviewers lauded The Black Crowes' return to the straightforward approach of their debut album, Shake Your Money Maker (1990). Chris Robinson's singing and Rich's guitar playing also won praise from critics, though reviews of the lyrics were mixed.\n\n              &quot;Lickin'&quot; was the first single from the album &quot;Lions&quot;. It was released in 2001 as their first album on V2 Records following their departure from Columbia, ; 'Lickin &quot;  peaked at number 9 on Billboard's Mainstream Rock Tracks on May 19. The song's promotional video was a compilation of various takes of a static, low-angle shot of the band performing the song on a tiny stage. \n\n\n                ","torrent":{"xt":"urn:btih:dd4bd4157cb542302a7b120c225c08086218ecac","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+555","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd4bd4157cb542302a7b120c225c08086218ecac","infoHashBuffer":{"type":"Buffer","data":[221,75,212,21,124,181,66,48,42,123,18,12,34,92,8,8,98,24,236,172]},"announce":[],"urlList":[]}}