{"title":"Pavitra Papi (1970) VCD - No Subs - Balraj Sahni, Tanuja [DDR]","uid":11225207,"size":1645738131,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd8cf31762b02b4d6427efbe159e3cbc8d3db5d4&amp;dn=Pavitra+Papi+%281970%29+VCD+-+No+Subs+-+Balraj+Sahni%2C+Tanuja+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1413427744,"description":"[COLOR=&quot;PaleTurquoise&quot;][CENTER]2014.10.15[/CENTER][/COLOR]\n[/CENTER]\n\nPavitra Papi (1970) VCD - No Subs - Balraj Sahni, Tanuja [DDR]\n\nPavitra Paapi is a 1970 Bollywood drama film directed by Rajendra Bhatia. \nThe film stars Parikshit Sahni and Tanuja. \nThe movie was based on a Punjabi novel by famous writer Nanak Singh\n\nMUSIC:- \nPrem Dhawan has composed both the lyrics and music for this movie. &quot;Teri Duniya Se&quot; sung by Kishore Kumar stands out prominently for its raw grief and pathos. \nThis song was played across radio and television channels when Kishore died on 13th October 1987\n\n    CAST:-\n    Balraj Sahni ... pannalal\n    Tanuja ... Veena\n    Parikshat Sahni ... Kedarnath (as Ajay Sahni)\n    Achala Sachdev ... Maya\n    Abhi Bhattacharya ... Writer (Man who helped Kedarnath)\n    I. S. Johar ... Adarshan Lala\n    Neetu Singh ... Vidya (as Baby Sonia)\n    Manorama ... Mrs. Adarshan Lala\n    Jayshree T. ... Dancer in white dress (in song &quot;Sada Sadak Dil&quot;) (as Jaishree)\n    Madhumati\n    Gulshan Bawra ... Adarshan's worker\n    Upendra Trivedi\n    Jugnu\n    Paul Mahendra\n    Fatima\n\nDirector: Rajendra Bhatia\nMusic Director: Prem Dhawan\t\nLyricist: Prem Dhawan\t\n \nSongs are included in MP3s\nPavitra Papi (1970) 00. Title Music and Screen Credits, Prem Dhawan\nPavitra Papi (1970) 01. Allah Hi Allah Kar Pyare, Mohammed Rafi, Prem Dhawan\nPavitra Papi (1970) 02. Shada Shadak Dil Kare Dhak Dhak, Usha Mangeshkar, Asha Bhosle, Prem Dhawan\nPavitra Papi (1970) 03. Le De Saiyaan Odhani, Asha Bhosle, Mohammed Rafi, Prem Dhawan\t\nPavitra Papi (1970) 04. O Munni Ke Lala, Usha Khanna, Asha Bhosle, Prem Dhawan\t\nPavitra Papi (1970) 05. Teri Duniya Se Hoke Majboor Chala, Kishore Kumar, Prem Dhawan\nPavitra Papi (1970) 06. Dilwale Dukhde Bure, Lata Mangeshkar, Prem Dhawan\nPavitra Papi (1970) 07. Poochho Na Kaise Pehli Raat Guzri, Asha Bhosle, S. Shailaja, Prem Dhawan\n\nSYNOPSIS- Pavitra Papi (1970)\nPannalal is employed in a clock repair shop owned by Adarshan Lala and is replaced by Kedarnath,who comes to the town of Punjab in search of such work, as according to him, his ancestors were in the same business. On this Pannalal curses him as being the cause of his family becoming destitute and writes a letter to him saying that this has driven him to suicide and disappears. Kedarnath is guilt ridden and goes out of his way to help, his wife Maya, and his two daughters, Veena and Vidya. Kedarnath rents a room with them, writes letters to her on behalf of her husband and teaches Veena during his free time making him fall in love with her. But when Maya tells him that Veena's marriage is already arranged he helps in the marriage of Veena with the son of Daulatram. When Maya tells him that she has no money to pay for the marriage expenses, he steals cash from his employer, and tells Maya that the money is from Pannalal. He then goes away from the village . Veena's in laws turn out to be rogues except for her father-in-law who counsels his family that they should not torture the daughter of somebody.\n\nGuilt-ridden by Pannalal 's suicide, Kedarnath helps their family and steals money from his employer for Pannalal's daughter's marriage.\n\nKedarnath is employed with a local clock/watch repair shop, owned by a parsimonious Adarshan Lala. Kedarnath goes out of his way to help a destitute woman, Maya, who husband is missing, with two daughters, Veena and Vidya. Kedarnath rents a room with them, writes letters to her on behalf of her husband, Pannalal, and even arranges the marriage of Veena with the son of Daulatram. When Maya tells him that she has no money to pay for the marriage expenses, he steals cash from his employer, and tells Maya that the money is from Pannalal. And all along telling Maya that he is a close friend of Pannalal, even though he has never met Pannalal, leave alone know him, making one think as to what devious secret Kedarnath is hiding, and what is the reason behind Pannalal's disappearance.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-1\nVideo Bitrate: 1149 kbps\nVideo Resolution: 352x288\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec:  MPEG-1 Layer 2\nAudio Bitrate: 224kb/s CBR 44100 Hz\nAudio Streams: 2\nAudio Languages: Hindi\nRunTime: About 120 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]    \nDuration: About 2 hours","torrent":{"xt":"urn:btih:dd8cf31762b02b4d6427efbe159e3cbc8d3db5d4","amp;dn":"Pavitra+Papi+%281970%29+VCD+-+No+Subs+-+Balraj+Sahni%2C+Tanuja+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd8cf31762b02b4d6427efbe159e3cbc8d3db5d4","infoHashBuffer":{"type":"Buffer","data":[221,140,243,23,98,176,43,77,100,39,239,190,21,158,60,188,141,61,181,212]},"announce":[],"urlList":[]}}