{"title":"Elizabeth &amp; the Catapult - Like It Never Happened (2014) [FL","uid":9497205,"size":254027687,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dd9a50885b1366d0c6389cf75f5492617c59ac6e&amp;dn=Elizabeth+%26amp%3B+the+Catapult+-+Like+It+Never+Happened+%282014%29+%5BFL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1390143587,"description":"\n  Elizabeth &amp; the Catapult - Like It Never Happened (2014) [FLAC]\n\n  Released: 2014\n  Genre: Pop/Rock\n  Styles: Indie Pop, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Happy Pop \n  02 Like It Never Happened \n  03 Salt of the Earth \n  04 Shoelaces\t \n  05 Someday Soon \n  06 More Than Enough \n  07 Please Yourself \n  08 Wish I Didn't \n  09 True Love Will Find You in the End \n  10 Sugar Covered Poison\n  11 Last Opus\t\n\n  After parting company with Verve Forecast after 2010's The Other Side of Zero, Elizabeth Ziman began learning how to play guitar and busking in New York subways. Since her previous two albums were written on piano -- her first instrument -- new possibilities presented themselves for this offering. There are nine new songs on this set, as well as a cover. Former bandmate Dan Molad helmed most of these sessions, and this cast of players is small. The dynamic nature of the guitar is evident in many of her new compositions, though she hasn't forsaken her piano. Opener &quot;Happy Pop&quot; continues to reflect her similarity to Sara Bareilles, but the leaner production aesthetic is more dynamic. The title track, with its meld of acoustic and electric guitars, brushed percussion, string pads, and layered backing vocals, is breezy and stirring. &quot;Someday Soon,&quot; with acoustic guitars and Rob Mouse on strings, melds Americana and pop, employing a simple yet effective melody and a lovely lyric.\n\n  &quot;Please Yourself,&quot; with its crunchy guitars, stacked organs, and brittle percussion, is lyrically poignant as well as melodically infectious. The faux doo wop on &quot;Wish I Didn't&quot; underscores a bitter love song whose lyric is a tad cloying as it goes out of its way to highlight curse words against the sweet backing vocal track and a fine musical arrangement. Ziman's reading of Daniel Johnston's transcendent &quot;True Love Will Find You in the End&quot; may not be quite as powerful as the songwriter's, but it is truly effective and will likely make this song more palatable to listeners not exposed to or drawn in by his own singing. As a whole, Like It Never Happened benefits from its lower-budget production. It is, if anything, more imaginative than her previous albums. And Ziman's songwriting, while consistently in the grain she previously established, is more intimate and immediate here.","torrent":{"xt":"urn:btih:dd9a50885b1366d0c6389cf75f5492617c59ac6e","amp;dn":"Elizabeth+%26amp%3B+the+Catapult+-+Like+It+Never+Happened+%282014%29+%5BFL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd9a50885b1366d0c6389cf75f5492617c59ac6e","infoHashBuffer":{"type":"Buffer","data":[221,154,80,136,91,19,102,208,198,56,156,247,95,84,146,97,124,89,172,110]},"announce":[],"urlList":[]}}