{"title":"The Odyssey of Ibn Battuta - David Waines","uid":13416562,"size":3066071,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dda77acc0097d48bbe76b5542de0687e4d7aaea7&amp;dn=The+Odyssey+of+Ibn+Battuta+-+David+Waines&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454501143,"description":"Ibn Battuta was, without doubt, one of the world’s truly great travellers. Born in fourteenth-century Morocco, and a contemporary of Marco Polo, Ibn Battuta has left us an account in his own words of his remarkable journeys throughout the Islamic world and beyond: journeys punctuated by adventure and peril, and stretching from his home in Tangier to Zaitun in faraway China.\r\n\r\nWhether sojourning in Delhi and the Maldives, wandering through the mazy streets of Cairo and Damascus, or contesting with pirates and shipwreck, the indefatigable Ibn Battuta brings to vivid life a medieval world brimming with marvel and mystery. Carefully observing the great diversity of civilizations that he encountered, Ibn Battuta exhibits an omnivorous interest in such matters as food and drink, religious differences (among Christians, Hindus and Shia Muslims), ideas about purity and impurity, disease, women and sex. Recounting the many miracles that its author claims to have experienced personally, his al-rihla or ‘Travelogue’ is a fascinating mosaic of mysticism and reportage offering a prototype magic realism. David Waines discusses the subtleties of the al-rihla, revealing all the wonders of Ibn Battuta’s world to the modern reader. This is a gripping treatment of the life and times of one of history’s most daring, and at the same time most human, discoverers","torrent":{"xt":"urn:btih:dda77acc0097d48bbe76b5542de0687e4d7aaea7","amp;dn":"The+Odyssey+of+Ibn+Battuta+-+David+Waines","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda77acc0097d48bbe76b5542de0687e4d7aaea7","infoHashBuffer":{"type":"Buffer","data":[221,167,122,204,0,151,212,139,190,118,181,84,45,224,104,126,77,122,174,167]},"announce":[],"urlList":[]}}