{"title":"The Columbia Guide to the Vietnam War","uid":11740526,"size":2918730,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de5f0b2dc694be2884b07834711fe544cb0b1fa2&amp;dn=The+Columbia+Guide+to+the+Vietnam+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425785169,"description":"More than a quarter of a century after the last Marine Corps Huey left the American embassy in Saigon, the lessons and legacies of the most divisive war in twentieth-century American history are as hotly debated as ever. Why did successive administrations choose little-known Vietnam as the &quot;test case&quot; of American commitment in the fight against communism? Why were the &quot;best and brightest&quot; apparently blind to the illegitimacy of the state of South Vietnam? Would Kennedy have pulled out had he lived? And what lessons regarding American foreign policy emerged from the war?\n\nThe Columbia Guide to the Vietnam War helps readers understand this tragic and complex conflict. The book contains both interpretive information and a wealth of facts in easy-to-find form. Part I provides a lucid narrative overview of contested issues and interpretations in Vietnam scholarship. Part II is a mini-encyclopedia with descriptions and analysis of individuals, events, groups, and military operations. Arranged alphabetically, this section enables readers to look up isolated facts and specialized terms. Part III is a chronology of key events. Part IV is an annotated guide to resources, including films, documentaries, CD-ROMs, and reliable Web sites. Part V contains excerpts from historical documents and statistical data","torrent":{"xt":"urn:btih:de5f0b2dc694be2884b07834711fe544cb0b1fa2","amp;dn":"The+Columbia+Guide+to+the+Vietnam+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de5f0b2dc694be2884b07834711fe544cb0b1fa2","infoHashBuffer":{"type":"Buffer","data":[222,95,11,45,198,148,190,40,132,176,120,52,113,31,229,68,203,11,31,162]},"announce":[],"urlList":[]}}