{"title":"Richard Matheson - What Dreams May Come","uid":7734641,"size":246866304,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:df06e00456a5c93a53c9024eabddc80633ad46bb&amp;dn=Richard+Matheson+-+What+Dreams+May+Come&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1350435143,"description":"Read by Robertson Dean. 64kbps CBR\n\n\nA classic novel of love after death, from one our greatest fantasy writers. The premise is deceptively simple: Chris Neilson has died in a car accident, but his life-force--his spirit--is still conscious of this plane of reality. And he is still too in love with his wife, Ann, to completely let go. She in turn does not want to go on living without him, as each regards the other as their soul mate. What Chris will do to get back with Ann after she dies makes for one of the most unusual love stories ever told. Even though the story can be enjoyed as pure fantasy, what makes What Dreams May Come unique is how the author spent years researching the subject of life after death. (An exhaustive bibliography is included to verify this.) And while Matheson admits that the characters are of course fictional, he also states that &quot;With few exceptions, every other detail is derived exclusively from research.&quot; Whether, after reading this novel, one believes in life after death is of course a matter of opinion. At least you'll entertain the possibility that, even though we may not live forever, true love can be eternal. --Stanley Wiater --This text refers to an out of print or unavailable edition of this title.\nReview\n&quot;Richard Matheson is worth our time, attention, and great affection.&quot;--Ray Bradbury","torrent":{"xt":"urn:btih:df06e00456a5c93a53c9024eabddc80633ad46bb","amp;dn":"Richard+Matheson+-+What+Dreams+May+Come","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df06e00456a5c93a53c9024eabddc80633ad46bb","infoHashBuffer":{"type":"Buffer","data":[223,6,224,4,86,165,201,58,83,201,2,78,171,221,200,6,51,173,70,187]},"announce":[],"urlList":[]}}