{"title":"Mom.S01E08-E11.HDTV.x264-LOL","uid":9344367,"size":554951936,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:dfc76c983a68b665bf602b2cb62847821e21c4ce&amp;dn=Mom.S01E08-E11.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":4,"time":1387001773,"description":"Mom\n\nGenre: Comedy\nYear: 2013\nCountry: USA\nRuntime: 22 min\nProducers: Gemma Baker, Eddie Gorodetsky, Chuck Lorre\nCast: Anna Faris, Allison Janney, Sadie Calvano\n\n.: Plot :.\nMom is a comedy from executive producer Chuck Lorre starring Anna Faris as a newly sober single mom raising two children in a world full of temptations and pitfalls, and multiple Emmy Award winner Allison Janney as her critical, estranged mother. Christy is a waitress at a posh Napa Valley establishment who is four months clean and doing her best to be a good mom and overcome a history of questionable choices. Her sobriety is tested when Bonnie, her recovering alcoholic mom, reappears chock-full of passive-aggressive insights into Christy's many mistakes. Bonnie joins Christy's already complicated circle of relationships: her handsome, married boss - and lover - Gabriel: the restaurant's hot-tempered chef, Rudy; her pretty, 16-going-on-25-year-old daughter, Violet: her sweet but overly honest son, Roscoe: her irresponsible ex-husband and Roscoe's father, Baxter; and Violet's clueless boyfriend, Luke. Christy tries to remain positive as she pursues her new path in life, but she faces an uphill battle, surrounded by a dubious support system - and a copious amount of dysfunction.\n","torrent":{"xt":"urn:btih:dfc76c983a68b665bf602b2cb62847821e21c4ce","amp;dn":"Mom.S01E08-E11.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc76c983a68b665bf602b2cb62847821e21c4ce","infoHashBuffer":{"type":"Buffer","data":[223,199,108,152,58,104,182,101,191,96,43,44,182,40,71,130,30,33,196,206]},"announce":[],"urlList":[]}}