{"title":"Street Kings 2008 DVDrip H264 MP4","uid":4669297,"size":1052215823,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dfd5b5453b2b0e0ce10302adcf68af374326d6d8&amp;dn=Street+Kings+2008+DVDrip+H264+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"volunteertas","files":4,"time":1232676119,"description":"Cast (Cast overview, first billed only)\n\nKeanu Reeves\t... \tDetective Tom Ludlow\nForest Whitaker\t... \tCaptain Jack Wander\nHugh Laurie\t... \tCaptain James Biggs\nChris Evans\t... \tDetective Paul Diskant\nCedric the Entertainer\t... \tScribble (as Cedric 'The Entertainer' Kyles)\nJay Mohr\t... \tSgt. Mike Clady\nTerry Crews\t... \tDetective Terrence Washington\nNaomie Harris\t... \tLinda Washington\nCommon\t... \tCoates\nThe Game\t... \tGrill\nMartha Higareda\t... \tGrace Garcia\nJohn Corbett\t... \tDetective Dante Demille\nAmaury Nolasco\t... \tDetective Cosmo Santos\nCle Shaheed Sloan\t... \tFremont (as Cle Sloan)\nNoel Gugliemi\t... \tQuicks (as Noel G.)\n\nRuntime: 109 min\nCountry: USA\nLanguage: English | Turkish\nColor: Color (Technicolor) \n\nPlot:\n\nTom Ludlow (Keanu Reeves) is a disillusioned L.A. Police Officer, rarely playing by the rules and haunted by the death of his wife. All of the cops in Ludlow's unit, including their captain, Jack Wander (Forest Whitaker), bend and break the rules of conduct on a regular basis. Their intention is often to deal with crime in a manner that they perceive to be more efficient, which leads them to routinely lie, falsify reports and manipulate evidence to cover up for their wrong-doings.\n\nThe movie opens with Tom Ludlow waking up, having been drinking the night before. Working undercover, he meets with two Korean gangsters in a parking lot, who are looking to buy a machine gun from him. After a vicious beatdown, the Koreans then proceed to steal Tom's car. Locating his car at the Korean's hideout, Tom storms in and kills all the people inside, and then locates the missing children. Using a pair of rubber gloves, he then proceeds to cover up what really happened. While the other officers in his unit congratulate him, he is confronted by his former partner, Terrence Washington (Terry Crews). Washington no longer approves of the corruption and deception and has gone straight, reporting the problems to Internal Affairs Captain James Biggs (Hugh Laurie), who starts an investigation against Ludlow. Upset at Washington for &quot;snitching&quot;, Ludlow follows him to a convenience store to confront him. However, Washington is executed in the store in an orchestrated hit, with Ludlow present. Though Ludlow is innocent, the circumstances heavily implicate him in the murder. DNA of two criminals known as Fremont and Coates is found at the scene, as well as drugs in Washington's car. It is assumed that Washington himself was corrupt, despite his seemingly changed attitude, and that he was stealing drugs from the department's evidence room and selling them to Fremont and Coates, who killed him over a bad deal. Ludlow convinces Detective Paul &quot;Disco&quot; Diskant (Chris Evans) who has been assigned to the case to pursue the case. Their search for the two involves some tough interrogation of other known criminals, which eventually leads them to a house in the hills where they discover the bodies of the real Fremont and Coates buried in a shallow grave. The decomposition of the bodies is so severe that it becomes apparent that they were killed well before Washington's murder.\n\nLudlow and Disco, posing as corrupt cops who are willing to take over Washington's activity of stealing and selling drugs, are able to set up a meeting with the two criminals masquerading as Fremont and Coates. The meeting goes bad when they recognize Ludlow from the convenience store and then realize he and Disco are off-duty and seeking revenge. One of the impostors, Coates (Common), shoots and kills Disco. Ludlow kills both Fremont and Coates and escapes back to his girlfriend's house, where a news report reveals the criminals were undercover Sheriff's Deputies.\n\nShortly afterward, Ludlow is captured at his girlfriend's house by Santos (Amaury Nolasco) and Demille (John Corbett), two fellow officers from his own unit who admit that they planted Fremont and Coates' DNA and the drugs in Washington's car at the scene of his murder, to prevent him from testifying against them in Biggs's investigation. The two cops take Ludlow out to the house where the two bodies were found earlier, for execution. However, Ludlow manages to escape and kills both of them. He then heads to Washington's house to take care of Clady (Jay Mohr), whom he later captures and places in the trunk of his car. Ludlow is also piecing together the puzzle as he goes; he eventually learns that he has been a pawn in a plan masterminded by Captain Wander. Ludlow shows up at Wander's house in order to kill him, when Wander reveals that he has incriminating evidence on just about everybody in the department, as well as judges and politicians. With so many people in Wander's pocket, he has been able to quickly move up the department ranks as well as bury his unit's corruptions. Wander tries to convince Ludlow that he is his friend and best officer, and bribes him with a large amount of stolen money and incriminating documents hidden in a wall of his home. However, Ludlow kills Wander anyway.\n\nInternal Affairs Officer Biggs, who was &quot;investigating&quot; Ludlow, arrives to the scene and reveals that he used Ludlow to bring down Wander and get access to his files by opening Ludlow's eyes to the real corruption going on within his unit. As he leaves, Biggs tells Ludlow that the department needs men like him; police officers who are willing to bend the rules, but are ultimately honest at heart.","torrent":{"xt":"urn:btih:dfd5b5453b2b0e0ce10302adcf68af374326d6d8","amp;dn":"Street+Kings+2008+DVDrip+H264+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfd5b5453b2b0e0ce10302adcf68af374326d6d8","infoHashBuffer":{"type":"Buffer","data":[223,213,181,69,59,43,14,12,225,3,2,173,207,104,175,55,67,38,214,216]},"announce":[],"urlList":[]}}