{"title":"Railworks TS2016 DTG   BR Class 58 Loco Add-On","uid":14288752,"size":116148664,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e044effdd8795fda3b7b409aa636ccfa44134f1a&amp;dn=Railworks+TS2016+DTG+++BR+Class+58+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TS2015","files":1,"time":1460417826,"description":"The distinctive Class 58, nicknamed the ‘Bone’ because of its unusual shape with a wide cab at either end, is now available to lend some serious hauling power in Train Simulator. \r\n\r\nThe Class 58 was built between 1983 and 1987 by BREL in Doncaster Works as British Rail wanted a new freight locomotive that would be lower in cost and maintenance whilst being able to cope with the potential growth in rail freight in the 1980s. It was in the 1970s when BR started looking for this new locomotive when they turned to the American design of a modular structure, meaning the loco would be made up of standardized sections that attach to the underframe, allowing for easy maintenance and lower building costs. \r\n\r\nFifty Class 58s were built in total and were initially used on coal trains, however that was short lived as they were entering service around the same time of the miner’s strikes of 1984/5 and so were used on a variety of freight services. Contrary to the claims made in the 1980s, the Class 58s proved less successful on various types of freight services when compared to the Class 56s due to an increase in the amount of wheelslip occurred, which was mainly caused by the design of the bogies. \r\n\r\nDespite being built for exclusively freight use, the Class 58s did haul various passenger services for example when a loco failed and a backup was required. They also played a key role in ‘Spin and Win’ charters, with 58017 being the only member of the class to have not hauled a charter service. Having started life in the BR RailFreight livery, the 58s have seen a variety of different liveries following sectorisation and privatisation including Coal Sector Triple Grey, Mainline Freight and EWS. \r\n\r\nThe Class 58s started to be withdrawn from service in in the late 1990s and by 2002, the last few finished operating in the UK. This wasn’t the end of the Class 58 though, in 2000 the Spanish infrastructure operator GIF hired eight Class 58s from EWS, where they have been constantly used up until today and other Class 58s were sent for work in France and the Netherlands. This cascade of Class 58s saw them in a unique set of liveries not usually found on British locos including GIF and ACTS. In the UK, one loco has survived into preservation, 58016 which was bought by the Class 58 Locomotive Group. \r\n\r\nThe BR Class 58 for Train Simulator, developed by Skyhook Games, includes both BR Railfreight and BR Coal Sector liveries, HAA hopper wagons and PGA wagons. The pack also includes a short Academy tutorial to introduce you to the Class 58’s controls. \r\n\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!","torrent":{"xt":"urn:btih:e044effdd8795fda3b7b409aa636ccfa44134f1a","amp;dn":"Railworks+TS2016+DTG+++BR+Class+58+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e044effdd8795fda3b7b409aa636ccfa44134f1a","infoHashBuffer":{"type":"Buffer","data":[224,68,239,253,216,121,95,218,59,123,64,154,166,54,204,250,68,19,79,26]},"announce":[],"urlList":[]}}