{"title":"Astrid Williamson - Pulse 2011","uid":6877807,"size":252692044,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e078d48c5fb4b0802547c9108c822a02b89a6ff7&amp;dn=Astrid+Williamson+-+Pulse+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1323522069,"description":"Astrid Williamson is a Shetland born musician and songwriter.\n\nIn the 1990s, Williamson obtained her degree in music from the Royal Scottish Academy and co-founded a band known as Goya Dress which consisted of Williamson, Terry de Castro, and Simon Pearson. Goya Dress dissolved in 1996, after which Willamson went on to release solo material with UK independent record label One Little Indian Records and founded her own record label, Incarnation Records. Pearson and de Castro went on to join Cinerama alongside David Gedge, frontman of The Wedding Present.\n\nIn addition to her solo career Williamson also worked in collaboration with various groups including Oskar and the experimental band, The Bilderberg Groop. Drawing on her expertise as a classically trained pianist she has also worked with Canadian Singer/Songwriter Tara Maclean and provided vocals for The Hope Blister and 1990s supergroup Electronic.\n\nIn May 2010, Astrid took to the road with Brendan Perry to play keyboards and sing backing vocals on stage 2 of his Ark tour.\n\nMost recently, Williamson has collaborated with many people including guitarist/ambient expert Leo Abrahams, who himself has worked with Brian Eno, Paul Simon and Jarvis Cocker. They met when Williamson saw Abrahams perform at Brian Eno's Pure Scenius project at the 2010 Brighton Festival. After seeing him play she sent him dozens of demos, which resulted them working together on her album Pulse, released in August 2011. (wikipedia)\n\n- - -\n\nWith Pulse, Astrid Williamson has moved into another dimension. Haunting, ethereal and magical, with a deep emotional undertow of unrequited love, the album nails everything people have always said about Astrid, a sublime, rich voice, song writing and musicianship, and original to boot. If Joni Mitchell had looked into the future when she was about to record Blue and absorbed the influence of Talk Talk, it might have sounded like Pulse. (exystence.net)\n\n- - -.\n\nAstrid Williamson - Pulse 2011 \n(One Little Indian)\n\n 1. Dance\n 2. Pour\n 3. Underwater\n 4. Cherry\n 5. Miracle\n 6. Connected\n 7. Pulse\n 8. Husk\n 9. Reservation\n10. Paperbacks\n","torrent":{"xt":"urn:btih:e078d48c5fb4b0802547c9108c822a02b89a6ff7","amp;dn":"Astrid+Williamson+-+Pulse+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e078d48c5fb4b0802547c9108c822a02b89a6ff7","infoHashBuffer":{"type":"Buffer","data":[224,120,212,140,95,180,176,128,37,71,201,16,140,130,42,2,184,154,111,247]},"announce":[],"urlList":[]}}