{"title":"Fast &amp; furious 5  (2011) [TS-Screener HQ][DUAL]","uid":6356087,"size":1728120832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e0ec4ee3808de33b355bbeef17e3ff99bfd7f863&amp;dn=Fast+%26+furious+5++%282011%29+%5BTS-Screener+HQ%5D%5BDUAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1304156318,"description":"Fast &amp; furious 5 - A todo gas 5 (2011) [TS-Screener HQ][DUAL][Eng-Spa]\n &lt;a href=&quot;\nhttp://www.fastfive.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastfive.es/&lt;/a&gt;\n\nEspaÃƒÂ±ol:\n------------\nCalidad: TS-Screner HQ\nIdioma: Ingles, EspaÃƒÂ±ol\nTÃƒÂ­tulo: Fast &amp; Furious 5\nTÃƒÂ­tulo original: Fast Five\nPaÃƒÂ­s: USA\nEstreno en USA: 29/04/2011\nEstreno en EspaÃƒÂ±a: 29/04/2011\nProductora: Universal Pictures\nDirector: Justin Lin\nGuiÃƒÂ³n: Chris Morgan\nReparto: Vin Diesel, Paul Walker, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Tego Calderon, Elsa Pataky, Joaquim de Almeida, Dwayne Johnson\nCalificaciÃƒÂ³n: No recomendada para menores de 16 aÃƒÂ±os\n\nSinopsis:\nVin Diesel y Paul Walker vuelven a reunirse en esta franquicia de velocidad explosiva. En esta ocasiÃƒÂ³n, el ex policÃƒÂ­a Brian O'Conner (Walker) se asociarÃƒÂ¡ con el ex convicto Dom Toretto (Diesel) en el lado opuesto de la ley. Ellos se reunirÃƒÂ¡n con Dwayne Johnson, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Matt Schulze, Tego Calderon y Don Omar para esta carrera de alto riesgo.\n\nDesde que Brian y Mia Toretto (Brewster) rompieron con Dom, ellos han cruzado muchas fronteras para huir de las autoridades. Ahora, acorralados en RÃƒÂ­o de Janeiro, tienen que realizar un ÃƒÂºltimo trabajo para ganar su libertad. MontarÃƒÂ¡n su equipo de corredores de ÃƒÂ©lite y tendrÃƒÂ¡n que enfrentarse a un hombre de negocios corrupto que los quiere muertos.\n\nEl duro agente federal Luke Hobbs (Johnson) nunca falla en su objetivo. Cuando se le asigna localizar a Dom y Brian, ÃƒÂ©l y su equipo se lanzarÃƒÂ¡n sin tregua para capturarlos. Pero a medida que la persecuciÃƒÂ³n va sucediendo, Hobbs se da cuenta que no puede hacer distinciÃƒÂ³n entre los buenos y los malos. Ahora ÃƒÂ©l tendrÃƒÂ¡ que confiar en sus instintos para arrinconar a su presa... antes de que otros los ejecuten en primer lugar.\n\nNotas de producciÃƒÂ³n:\nQuinta entrega de la saga 'Fast &amp; Furious'.\n\n\nEnglish:\n------------\nQuality: TS-scren HQ\nLanguage: English, Spanish\nTitle: Fast &amp; Furious 5\nOriginal title: Fast Five\nCountry: USA\nUSA release: 29/04/2011\nReleased in Spain: 29/04/2011\nStudio: Universal Pictures\nDirector: Justin Lin\nWriter: Chris Morgan\nCast: Vin Diesel, Paul Walker, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Tego Calderon, Elsa Pataky, Joaquim de Almeida, Dwayne Johnson\nRating: Not recommended for children under 16 years\n\nSynopsis:\nVin Diesel and Paul Walker re-teamed in this franchise explosive speed. On this occasion, the former cop Brian O'Conner (Walker) will partner with the ex-con Dom Toretto (Diesel) on the opposite side of the law. They will join Dwayne Johnson, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Matt Schulze, Tego Calderon and Don Omar for this career at risk.\n\nSince Brian and Mia Toretto (Brewster) broke with Sun, they have crossed many borders to escape the authorities. Now, holed up in Rio de Janeiro, have to do one last job to gain their freedom. Assembled his team of elite runners and will have to confront a corrupt businessman who wants them dead.\n\nThe tough federal agent Luke Hobbs (Johnson) never fails in its objective. When assigned to find Dom and Brian, he and his team launched tirelessly to capture them. But as persecution is happening, realize that Hobbs can not make distinction between good and bad. Now he must rely on their instincts to corner his prey ... before others run in the first place.\n\nProduction notes:\nFifth installment of the series' Fast &amp; Furious. &quot;","torrent":{"xt":"urn:btih:e0ec4ee3808de33b355bbeef17e3ff99bfd7f863","amp;dn":"Fast+%26+furious+5++%282011%29+%5BTS-Screener+HQ%5D%5BDUAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0ec4ee3808de33b355bbeef17e3ff99bfd7f863","infoHashBuffer":{"type":"Buffer","data":[224,236,78,227,128,141,227,59,53,91,190,239,23,227,255,153,191,215,248,99]},"announce":[],"urlList":[]}}