{"title":"Project Management (DK Publishing) (2015).pdf Gooner","uid":12114029,"size":7827388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e285fa1edb1757600328c9459db3715c7d18816a&amp;dn=Project+Management+%28DK+Publishing%29+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1436642415,"description":"Publisher: DK; Reprint edition (May 5, 2015)\nLanguage: English\nISBN-10: 1465435441\nISBN-13: 978-1465435446\n\nDK Essential Managers: Project Management is the visual guide that gives you all the know-how you need to be a more effective manager.\nNow newly updated with an all-new graphic approach to explaining key techniques and skills, the best-selling DK Essential Managers: Project Management features:\n\nA practical, &quot;how-to&quot; approach teaches you the project management skills you need to succeed.\nStep-by-step instructions, tips, checklists, and &quot;Ask yourself&quot; features show you how to initiate projects and manage budgets.\nTables, illustrations, &quot;in-focus&quot; panels, and real-life case studies show you how to delegate effectively and evaluate success.\nDK Essential Managers: Project Management not only shows you how to plan, run, and monitor a project but also explains what to do if things go wrong. Learn all you need to define project briefs, identify stakeholders, and build an effective project team with DK Essential Managers: Project Management.\n\nAbout DK Essential Managers: The DK Essential Managers series covers a range of business and management topics and have sold more than 1.9 million copies worldwide. Each guide is clearly presented for ease of reference, with visual pointers, tips, and graphics. The handy pocket format slips easily into a briefcase or portfolio","torrent":{"xt":"urn:btih:e285fa1edb1757600328c9459db3715c7d18816a","amp;dn":"Project+Management+%28DK+Publishing%29+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e285fa1edb1757600328c9459db3715c7d18816a","infoHashBuffer":{"type":"Buffer","data":[226,133,250,30,219,23,87,96,3,40,201,69,157,179,113,92,125,24,129,106]},"announce":[],"urlList":[]}}