{"title":"flt-cita","uid":8741743,"size":2269806704,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e310fe57c95369c82ef4cace60747d487adb6b61&amp;dn=flt-cita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"legamera","files":2,"time":1374808517,"description":"In Their 26th Year Of Glory, FairLight Released #1107\n\nCitadels (c) bitComposer Games: Supplied by: FAIRLIGHT: Release Date: 26/07/2013: Cracked by: FAIRLIGHT Game Type: Strategy\nPackaged by: FAIRLIGHT Image Format: ISO\nDISCS: 1 DVD Protection: Steam\n\nSystem Requirements: (S)-1-phenylpropan-2-amine\n\nGame information:\n\nEarly Britannia. King Arthur is ruling over the land. He is a great and\nwise ruler. His subjects treat him with respect and the Knights of the\nRound Table remain steadfastly at his side\n\nArthur's archenemies have joined forces with the Saxons and the\nNortherners and recruited a huge army. With it, they are now attacking\nCamelot. Arthur cannot stand at the sidelines and watch everything being\ndestroyed, that he has built from the scratch. So he makes one last and\ndesperate attempt to prevent the inevitable. To make the attack a success\nArthur has to make the maximal sacrifice\n\nDespite Arthur's effort only an uncertain stalemate between the two\nrivaling parties can be accomplished, an elusive period of rest. The final\nbattle is lying in remote future. But how did it come to that at all?\n\nTravel to a fantastic past and experience a new version of the saga of\nKing Arthur. Witness the most important events in the story of the\nlegendary king, until his selfless attempt to save his kingdom and\naccompany his loyal abiders on their way into an uncertain future. Can you\nrestore the honor, the glory and the reign of Camelot?\n\nFeatures:\n\n* Experience medieval England at the time of King Arthur and\nthe Knights of the Round Table with detailed graphics and\npainstakingly designed environments - and rewrite\nhistory in the process!\n* Good or evil? Decide for yourself whether you will fight\non the side of King Arthur or Mordred and his allies\nfrom the Northlands\n* Construct impregnable fortresses and fortify them with\nunits, moats, and spear walls. Your strategy will\ndetermine your success or failure\n* A castle alone does not ensure victory! The right\ncombination of defensive structures and units, as\nwell as resource extraction and production are\ndecisive for the outcome of a siege\n* Fight medieval battles with an army of all kinds of units\nand siege weapons. When assembling your army, you will\nhave access to archers, crossbowmen, swordsmen, mounted\nunits, ladder carriers, catapults, trebuchets, ballistae\nand siege towers\n* Realistic projectile ballistics enables a tactical\nadvantage for higher positions, and falling\nobjects and rubble cause damage\n* By fulfilling certain tasks, you can acquire\nlegendary characters that will give you a\nbonus for your missions\n\nInstallation Information:\n\n* Burn or mount\n* Install\n* Play the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n\nQUALITY, TRADITION AND PRIDE","torrent":{"xt":"urn:btih:e310fe57c95369c82ef4cace60747d487adb6b61","amp;dn":"flt-cita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e310fe57c95369c82ef4cace60747d487adb6b61","infoHashBuffer":{"type":"Buffer","data":[227,16,254,87,201,83,105,200,46,244,202,206,96,116,125,72,122,219,107,97]},"announce":[],"urlList":[]}}