{"title":"Securing SQL Server, 3rd Edition [2015] [PDF]","uid":13622643,"size":9996973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3b5c4adb19395de971b0e07b03a2babe909b957&amp;dn=Securing+SQL+Server%2C+3rd+Edition+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1455981718,"description":"Title: Securing SQL Server: Protecting Your Database from Attackers \r\nAuthor: Denny Cherry \r\nFormat: PDF \r\nHardcover: 462 pages \r\nPublisher: Syngress; 3 edition (May 7, 2015) \r\nLanguage: English \r\nISBN: 9780128012758 \r\n\r\n\r\nSQL server is the most widely-used database platform in the world, and a large percentage of these databases are not properly secured, exposing sensitive customer and business data to attack.\r\n\r\nIn Securing SQL Server, Third Edition, you will learn about the potential attack vectors that can be used to break into SQL server databases as well as how to protect databases from these attacks. In this book, Denny Cherry - a Microsoft SQL MVP and one of the biggest names in SQL server - will teach you how to properly secure an SQL server database from internal and external threats using best practices as well as specific tricks that the author employs in his role as a consultant for some of the largest SQL server deployments in the world.\r\n\r\nFully updated to cover the latest technology in SQL Server 2014, this new edition walks you through how to secure new features of the 2014 release. New topics in the book include vLANs, setting up RRAS, anti-virus installs, key management, moving from plaintext to encrypted values in an existing application, securing Analysis Services Objects, Managed Service Accounts, OS rights needed by the DBA, SQL Agent Security, Table Permissions, Views, Stored Procedures, Functions, Service Broker Objects, and much more.\r\n\r\n- Presents hands-on techniques for protecting your SQL Server database from intrusion and attack\r\n- Provides the most in-depth coverage of all aspects of SQL Server database security, including a wealth of new material on Microsoft SQL Server 2014.\r\n- Explains how to set up your database securely, how to determine when someone tries to break in, what the intruder has accessed or damaged, and how to respond and mitigate damage if an intrusion occurs","torrent":{"xt":"urn:btih:e3b5c4adb19395de971b0e07b03a2babe909b957","amp;dn":"Securing+SQL+Server%2C+3rd+Edition+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3b5c4adb19395de971b0e07b03a2babe909b957","infoHashBuffer":{"type":"Buffer","data":[227,181,196,173,177,147,149,222,151,27,14,7,176,58,43,171,233,9,185,87]},"announce":[],"urlList":[]}}