{"title":"How Designers Think,4th Edition{BBS}","uid":6807668,"size":6992025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4b0587a8a36a3a0244c114a0d1db8f28b6d57f4&amp;dn=How+Designers+Think%2C4th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320930072,"description":"How Designers Think is based on Bryan Lawson's many observations of designers at work, interviews with designers and their clients and collaborators. This extended work is the culmination of forty years' research and shows the belief that we all can, and do, design, and that we can learn to design better. The creative mind continues to have the power to surprise and this book aims to nurture and extend this creativity. Neither the earlier editions, nor this book, are intended as authoritative prescriptions of how designers should think but provide helpful advice on how to develop an understanding of design.\n\nIn this fourth edition, Bryan Lawson continues to try and understand how designers think, to explore how they might be better educated and to develop techniques to assist them in their task. Some chapters have been revised and three completely new chapters added. The book is now intended to be read in conjunction with What Designers Know which is a companion volume. Some of the ideas previously discussed in the third edition of How Designers Think are now explored more thoroughly in What Designers Know. For the first time this fourth edition works towards a model of designing and the skills that collectively constitute the design process.\n\n* A unique look at the psychology of the designer that provides a greater insight to the process of design\n* 'Demystifies' the complexity of the subject and uncovers new ways that design can be done\n* Conclusions are drawn from years of research and provide the very latest debate on the subject\n\n\n# Paperback: 320 pages\n# Publisher: Architectural Press; 4 edition (December 14, 2005)\n# Language: English\n# ISBN-10: 0750660775\n# ISBN-13: 978-0750660778","torrent":{"xt":"urn:btih:e4b0587a8a36a3a0244c114a0d1db8f28b6d57f4","amp;dn":"How+Designers+Think%2C4th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b0587a8a36a3a0244c114a0d1db8f28b6d57f4","infoHashBuffer":{"type":"Buffer","data":[228,176,88,122,138,54,163,160,36,76,17,74,13,29,184,242,139,109,87,244]},"announce":[],"urlList":[]}}