{"title":"AC/DC. If You Want Blood. Re-mastered@320","uid":3783793,"size":98673436,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e4b93e9e62238da7b76b3433911f985fc8c44661&amp;dn=AC%2FDC.+If+You+Want+Blood.+Re-mastered%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Philoo","files":12,"time":1188038011,"description":"Ac/Dc is a very rare breed of band that never lets you down...you always know what to expect,which is great blues based rock at a super high volume with some great guitar playing and some great screaming vocals...this live CD &quot;If You Want Blood&quot; is no exception to that.\nIt includes 10 great rock and roll classics played live,with lots of crowd participation. What sets this CD apart from their next live album recorded many years later on the &quot;Razor&amp;#039;s Edge&quot; tour,is that this feels much more intimate,like you were front row in a small arena right in the middle of the high volume onslaught. I like this,whenever you make a live album that feels like you were there it can be considered a success.The later live album feels much more thought out and commercial and it didn&amp;#039;t feel spontanious at all. I much prefer this one,&quot;If You Want Blood&quot;...the band was very hungry for success and was touring for the &quot;Powerage&quot; album...the only complaint I have is that they didn&amp;#039;t include a lot of songs that I think would have went over better...in particular Sin City,TnT,Dirty Deeds,and It&amp;#039;s A Long Way To The Top...this is a great CD to pop in the car and crank to 10 and imagine being there watching this classic band tearing through some awesome rock and roll...if you are a hard core ac/dc fan you should already have this,if not go out and grab it now...if you are new to the band,buy a few of the studio albums first,mainly Back In Black,Highway To hell,High Voltage,and even Powerage...once you know the songs in the studio versions you&amp;#039;ll be able to appreciate the live versions in a whole new way...one song in particular &quot;The Jack&quot; has completely new lyrics live as opposed to the studio version (I prefer the studio version but then again,I like being subtle,but the live version is great too)...this CD also includes the live version of &quot;Whole Lotta Rosie&quot; and one of my favorites &quot;Rock And Roll Damnation&quot;...this is another in a long line of triumphs for this great band and includes a GREAT guitar solo that shows what Angus can do and some great crowd interaction with the great Bon Scott\n\n\nThe Upside - very well produced live album,feels very intimate like you were there..includes some great classics like &quot;Whole Lotta Rosie&quot; &quot;Problem Child&quot; &quot;Rock And Roll Damnation&quot;,&quot;hell Ain&amp;#039;t A Bad Place To Be&quot;,&quot;High Voltage&quot; and more...great booklet also comes with the remaster version with lots of great pictures and some cool stories\n\nThe Downside - missing some obvious hits like &quot;TnT&quot; and &quot;Dirty Deeds&quot; (they included &amp;#039;Rocker&amp;#039; from the dirty deeds album but not the much more popular title track,not sure why) and &quot;Jailbreak&quot; which would have been a treat to hear Bon sing that one live..and again,no bonus tracks for the remaster version which would have been a nice treat to us fans\n\nThe Bottom Line - the best live collection of Ac/Dc songs so far...start with the studio versions and then crank this one up to 10 and relive a great concert...Ac/Dc is timeless and classic.\n\nLame mp3@320.","torrent":{"xt":"urn:btih:e4b93e9e62238da7b76b3433911f985fc8c44661","amp;dn":"AC%2FDC.+If+You+Want+Blood.+Re-mastered%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b93e9e62238da7b76b3433911f985fc8c44661","infoHashBuffer":{"type":"Buffer","data":[228,185,62,158,98,35,141,167,183,107,52,51,145,31,152,95,200,196,70,97]},"announce":[],"urlList":[]}}