{"title":"DDP Yoga with Extreme","uid":12074863,"size":3306686830,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e522755225bfbd0ae4f6a3ee5bf24c652a7ceb30&amp;dn=DDP+Yoga+with+Extreme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MrTVGuy","files":32,"time":1435611453,"description":"NO RUNNING, NO JUMPING, NO LIFTING. You Can Do This!\n\nDiamond Dallas Page originally developed DDP YOGA for athletes like himself who had suffered years of injuries due to high impact sports. For the first 42 years of his life, Dallas was a guy who &quot;wouldn't be caught dead&quot; doing Yoga, or anything like it.\n\nWhen he ruptured his L4 and L5 discs in his back during the height of his professional wrestling career, he was so desperate to keep his childhood dream alive, he was willing to try anything. So he tried Yoga for the first time in his life.\n\nBecause Dallas (DDP) had so much experience in many other areas of fitness all his life, he quickly learned how different Yoga was to his traditional training, and he started mixing the best parts (in his opinion) of Yoga, with his rehab as well as his traditional workout principles. For almost a decade, DDP has refined his workout and has become a master at teaching it to others, as well as motivating individuals to believe that anything is possible with dedication and hard work.\n\nAlong the way, Dallas learned that very deconditioned men and women could do DDP YOGA as well -- even though he had never struggled with weight himself, he was amazed to see stories of people doing DDP YOGA losing literally hundreds of pounds! As Dallas puts it, &quot;weight loss just happens to be a really AWESOME side effect of DDP YOGA!&quot;\n\nDDP YOGA combines the very best of Yoga, Traditional Fitness, Sports Therapy and Dynamic Resistance to create one of the most effective fitness plans in existence today. It allows anyone to get an amazing cardio workout while improving muscular strength, dramatically increasing flexibility and strengthening the core in a single workout... all with minimal joint impact!\nThe main benefits are body fat loss, lean muscle growth, and improved cardio levels all without placing undue stress on the joints. DDP YOGA is currently used by professional football players, over 40 professional wrestlers, MMA fighters, and regular everyday people who want to perform at optimum levels and want to place themselves in the best position to see career and life changing results and improve their quality of life. At the same time, morbidly obese individuals have inspired us with their own DDP YOGA success stories!","torrent":{"xt":"urn:btih:e522755225bfbd0ae4f6a3ee5bf24c652a7ceb30","amp;dn":"DDP+Yoga+with+Extreme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e522755225bfbd0ae4f6a3ee5bf24c652a7ceb30","infoHashBuffer":{"type":"Buffer","data":[229,34,117,82,37,191,189,10,228,246,163,238,91,242,76,101,42,124,235,48]},"announce":[],"urlList":[]}}