{"title":"Avril Lavigne (2013) [FLAC]","uid":9137012,"size":354923179,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e52b2eba04b0c6e7685c4a1bbb89f90f81b98899&amp;dn=Avril+Lavigne+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1383431227,"description":"\n  Avril Lavigne (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative\n  Source: Scene CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz  \n\n  01 Rock N Roll\n  02 Here's To Never Growing Up\n  03 17\n  04 Bitchin' Summer\n  05 Let Me Go (feat. Chad Kroeger)\n  06 Give You What You Like\n  07 Bad Girl (feat. Marilyn Manson)\n  08 Hello Kitty\n  09 You Ain't Seen Nothin' Yet\n  10 Sippin' on Sunshine\n  11 Hello Heartache\n  12 Falling Fast\n  13 Hush Hush\n\n  Avril Lavigne first appeared in summer 2002, touting an addictive debut single (the spunky pop/rock gem &quot;Complicated&quot;) and a skatepunk image that purposely clashed with the polished glamour of mainstream pop. Lavigne, who was 17 at the time, quickly rose to teen idol status, selling several million copies of her debut album, Let Go (the best-selling album by a female artist in 2002), while inspiring a genuine fashion craze with her penchant for tank tops and neckties. As the decade progressed, so did Lavigne's marketable sound, which took a contemplative turn on the sophomore effort Under My Skin before reaching an aggressively upbeat tone for 2007's The Best Damn Thing.\n\n  Born into a devout Christian household in the small town of Napanee, Ontario, Lavigne sharpened her vocal talents in church choirs, local festivals, and county fairs. She began playing guitar and writing songs in her early teens, focusing her early efforts on country music and contributing vocals to several albums by local folk musician Steve Medd. Arista Records caught wind of the singer and brought her aboard at the age of 16, with CEO Antonio &quot;L.A.&quot; Reid personally taking Lavigne under his wing. She quit high school, relocated to Manhattan, and set to work with a handful of prime songwriters and producers, but the partnerships only produced country songs, not the rock music in which Lavigne had become increasingly interested. Arista relented and instead sent Lavigne to Los Angeles, where she fashioned her melodic, edgy debut alongside such writing teams as the Matrix. Released in 2002, Let Go was the polished product, and its four high-charting singles -- &quot;Complicated,&quot; &quot;Sk8er Boi,&quot; &quot;I'm with You,&quot; and &quot;Losing Grip&quot; -- led the album to multi-platinum status within its second month of release. Lavigne became the youngest female musician ever to have a number one album in the U.K., and she supported the wildly popular disc (which eventually gained eight Grammy nominations) with a tour of Europe, Asia, North America, and Australia.\n\n  Compared with the skin-bearing antics of other teen idols -- Britney Spears chief among them -- Lavigne was a new kind of superstar, one whose appeal didn't rely on sexy videos or suggestive music. She further distinguished herself by bypassing the assistance of professional writing teams during the creation of her second album, choosing instead to collaborate with singer/songwriter Chantal Kreviazuk, Evanescence's Ben Moody, and Evan Taubenfeld (who had previously worked with Lavigne as her touring guitarist). Released in May 2004, Under My Skin was more serious than its predecessor, dealing with such issues as premarital sex (&quot;Don't Tell Me&quot;), depression (&quot;Nobody's Home&quot;), and the death of Lavigne's grandfather (&quot;Slipped Away&quot;). The album debuted at number one in more than ten countries, went platinum within one month, and further established Lavigne as a pop icon. Incidentally, a song that was co-written by Lavigne and ultimately cut from the final track list -- &quot;Breakaway&quot; -- was later given to Kelly Clarkson, who used it as the title track and lead-off single for her Grammy-winning sophomore album.\n\n  Lavigne married her boyfriend of two years, Sum 41's Deryck Whibley, in July 2006, just one month after the animated film Over the Hedge announced her cinematic debut (Lavigne voiced the part of Heather, a hungry opossum). She also appeared in Richard Linklater's fictional adaptation of Fast Food Nation, which was released that November. Nevertheless, she spent most of the year working on her third album, enlisting former blink-182 drummer Travis Barker to play drums, and cherry-picking a variety of producers (including her husband) to helm the recording sessions. The Best Damn Thing appeared in April 2007, and its lead-off single, &quot;Girlfriend,&quot; marked a return to the bratty, spunky, punk-pop of her first album. &quot;Girlfriend&quot; soon became the subject of controversy as the '70s power pop band the Rubinoos sued Lavigne, claiming that her tune reworked their 1979 song &quot;I Wanna Be Your Boyfriend.&quot; No amount of bad publicity could hurt the singer, however, as &quot;Girlfriend&quot; became her biggest U.S. single ever and The Best Damn Thing topped album charts worldwide.\n\n  Lavigne filed for divorce from Whibley in October of 2009. The dissolution of their union featured heavily on her next album, 2011's Goodbye Lullaby, which included tracks produced by Whibley.\n\n  Lavigne returned to the studio just weeks after the release of Goodbye Lullaby and begun work on her fifth album. In 2012 she started working on new material with Nickelback frontman Chad Kroeger and eventually the pair began dating; she married Kroeger on July 1, 2013. By that point, she had released &quot;Here's to Never Growing Up,&quot; the first single from her eponymous fifth album. Released in October, Avril Lavigne featured eight songs co-written by Kroeger, who also duetted with Avril on the record's third single, &quot;Let Me Go.&quot;","torrent":{"xt":"urn:btih:e52b2eba04b0c6e7685c4a1bbb89f90f81b98899","amp;dn":"Avril+Lavigne+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e52b2eba04b0c6e7685c4a1bbb89f90f81b98899","infoHashBuffer":{"type":"Buffer","data":[229,43,46,186,4,176,198,231,104,92,74,27,187,137,249,15,129,185,136,153]},"announce":[],"urlList":[]}}