{"title":"The World of Ice and Fire (one file per chapter)","uid":12537202,"size":307681758,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e568a9be2a5b74bcf9489f1bf900845d1cdf0e3d&amp;dn=The+World+of+Ice+and+Fire+%28one+file+per+chapter%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"acaduco","files":113,"time":1444336498,"description":"The World of Ice &amp; Fire: The Untold History of Westeros and the Game of Thrones [Audiobook] by George R. R. Martin, Elio Garcia, Linda Antonsson\r\nEnglish | October 28, 2014 | ASIN: B00M4KQ83C |    kbps | 21 hrs 22 mins | 292 MB\r\nNarrators: Roy Dotrice, Nicholas Guy Smith \r\n\r\nThe never-before-seen history of Westeros and The Lands Beyond with hundreds of pages of all-new material from George R.R. Martin.\r\n\r\nIf the past is prologue, then George R. R. Martin's masterwork - the most inventive and entertaining fantasy saga of our time - warrants one hell of an introduction. At long last, it has arrived with The World of Ice &amp; Fire.\r\n\r\nThis volume is a comprehensive history of the Seven Kingdoms, providing vividly constructed accounts of the epic battles, bitter rivalries, and daring rebellions that lead to the events of A Song of Ice and Fire and HBO's Game of Thrones. In a collaboration that's been years in the making, Martin has teamed with Elio M. García, Jr., and Linda Antonsson, the founders of the renowned fan site Westeros.org - perhaps the only people who know this world almost as well as its visionary creator.\r\n\r\nCollected here is all the accumulated knowledge, scholarly speculation, and inherited folk tales of maesters and septons, maegi and singers, including:\r\n\r\nIn-depth explorations of the history and culture of Westeros\r\n100% all-new material, more than half of which Martin wrote specifically for this book\r\n\r\nThe definitive companion piece to George R. R. Martin's dazzlingly conceived universe, The World of Ice &amp; Fire is indeed proof that the pen is mightier than a storm of swords","torrent":{"xt":"urn:btih:e568a9be2a5b74bcf9489f1bf900845d1cdf0e3d","amp;dn":"The+World+of+Ice+and+Fire+%28one+file+per+chapter%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e568a9be2a5b74bcf9489f1bf900845d1cdf0e3d","infoHashBuffer":{"type":"Buffer","data":[229,104,169,190,42,91,116,188,249,72,159,27,249,0,132,93,28,223,14,61]},"announce":[],"urlList":[]}}