{"title":"PRE-CRACKED winrar 3.80 Ita.exe","uid":4434551,"size":1426028,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e581548f0b4d6ae4351a30803646d548aac32d03&amp;dn=PRE-CRACKED+winrar+3.80+Ita.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jsph69","files":1,"time":1223477582,"description":"NovitÃƒÂ  di WinRAR Versione 3.80\n\n1.  Aggiunto il supporto per gli archivi in formato ZIP contenenti file con il nome in formato Unicode UTF-8. Quando vengono creati archivi in formato ZIP, WinRAR memorizza i nomi dei file in formato Unicode solo se non possono essere memorizzati correttamente utilizzando l&amp;#039;attuale codifica dei caratteri ad 1 byte.\n   2. Aggiunto il supporto per la scompattazione di archivi in formato ZIP creati con l&amp;#039;algoritmo di crittografazione AES di WinZIP.\n   3. Migliorato il supporto dei nomi in formato Unicode per archivi in formato RAR e ZIP.\n   4. Sono ora disponibili due nuove opzioni &quot;Chiedi prima di sovrascrivere&quot; e &quot;Salta i file esistenti&quot; nel pannello di archiviazione. Queste possono modificare il comportamento di WinRAR durante l&amp;#039;aggiornamento di file giÃƒÂ  esistenti in un archivio.\n      Diversamente da &quot;Aggiorna solo i file esistenti&quot; e &quot;Aggiungi ed aggiorna i file&quot; queste due nuove modalitÃƒÂ  ignorano la data di modifica dei file e comparano solo i nomi dei file.\n      Le opzioni da linea di comando equivalenti sono:\n         1. -o abilita la modalitÃƒÂ  &quot;Chiedi prima di sovrascrivere&quot;;\n         2. -o- abilita la modalitÃƒÂ  &quot;Salta i file esistenti&quot;;\n         3. -o+ abilita la modalitÃƒÂ  &quot;Aggiungi e sostituisci i file&quot; (che ÃƒÂ¨ quella predefinita per l&amp;#039;archiviazione).\n   5. Nuova opzione &quot;Aggiungi al menu contestuale&quot; nel pannello &quot;Parametri del profilo&quot;. Se questa opzione ÃƒÂ¨ attiva, il nome del profilo verrÃƒÂ  visualizzato nel menu contestuale di Esplora Risorse permettendo di attivarlo direttamente.\n   6. Nuova opzione -cp&lt;nome_profilo&gt; che permette di selezionare un profilo di compressione dalla linea di comando. ÃƒË† disponibile solo dal programma &amp;#039;WinRAR.exe&amp;#039; e non da &amp;#039;rar.exe&amp;#039;.\n   7. Nuova pagina &quot;Opzioni&quot; nel pannello &quot;Nome archivio e parametri&quot; contenente un gruppo di opzioni che modifica il comportamento dell&amp;#039;opzione &quot;Elimina i file dopo l&amp;#039;archiviazione&quot; presente nella pagina &quot;Generali&quot;. Queste opzioni sono:\n         1. Elimina file - elimina i file normalmente come nelle versioni precedenti di WinRAR.\n         2. Sposta i file nel Cestino - i file eliminati vengono spostati nel Cestino di Windows.\n            L&amp;#039;equivalente da linea di comando ÃƒÂ¨ l&amp;#039;opzione &amp;#039;-dr&amp;#039;.\n         3. Pulisci lo spazio file - prima di essere eliminati i file vengono sovrascritti da tanti byte con valore 0 per prevenire il recupero del loro contenuto.\n      L&amp;#039;equivalente da linea di comando ÃƒÂ¨ l&amp;#039;opzione &amp;#039;-dw&amp;#039;.\n      Tutte queste opzioni hanno effetto solo se ÃƒÂ¨ attiva l&amp;#039;opzione &quot;Elimina i file dopo l&amp;#039;archiviazione&quot;. Potete selezionare una di queste opzioni nel profilo di compressione predefinito per cambiare il comportamento predefinito dell&amp;#039;opzione &quot;Elimina i file dopo l&amp;#039;archiviazione&quot;.\n   8. La finestra di WinRAR &quot;Percorso d&amp;#039;estrazione ed opzioni&quot; ÃƒÂ¨ ora ridimensionabile. Potete utilizzare il mouse per trascinare il bordo della finestra ad una dimensione desiderata in modo da ottenere un albero delle cartelle piÃƒÂ¹ ampio. WinRAR memorizzerÃƒÂ  la nuova dimensione di questa finestra.\n   9. Nuovo comando &quot;Update&quot; per gli script dei moduli auto-estraenti e nuovo gruppo di opzioni &quot;ModalitÃƒÂ  aggiornamento&quot; nella nuova pagina &quot;Aggiornamento&quot; del pannello delle &quot;Opzioni avanzate del modulo auto-estraente&quot;. Questo comando e queste opzioni permettono di implementare un aggiornamento basato sulla data e l&amp;#039;orario dei file.\n  10.\n  11. Il comando &quot;Shortcut&quot; degli script dei moduli auto-estraenti e la finestra &quot;Aggiungi scorciatoie&quot; del pannello &quot;Opzioni avanzate del modulo auto-estraente&quot; permettono ora di specificare un&amp;#039;icona associata alla scorciatoia.\n  12. La nuova opzione &quot;Pulisci lo spazio occupato dai file temporanei&quot; nel pannello &quot;Configurazione / Sicurezza&quot; fornisce una modalitÃƒÂ  piÃƒÂ¹ sicura, anche se piÃƒÂ¹ lenta, di eliminare i file temporanei di WinRAR.\n  13. WinRAR e RAR visualizzano la barra di progressione totale quando viene compattato un archivio multi-volume se tutti i volumi sono presenti nella stessa cartella.\n  14. WinRAR e RAR espandono automaticamente le variabili d&amp;#039;ambiente nelle liste di file. Ad esempio, se una lista di file contiene delle linee come:\n\n      %windir%*.exe\n      %USERPROFILE%Desktop\n\n      le variabili d&amp;#039;ambiente %windir% e %USERPROFILE% vengono sostituite con i valori specifici del vostro sistema (usate il comando SET dal &quot;Prompt dei comandi&quot; per visualizzare il valore attuale).\n      Questa prestazione ÃƒÂ¨ disponibile solo in WinRAR e nella versione di RAR per Windows.\n  15. Aggiunto il supporto per gli archivi in formato TAR con un valore non-zero in &quot;extra field&quot;.\n  16. Aggiunto il supporto per gli archivi in formato TAR che non contengono il marcatore delle fine dell&amp;#039;archivio che consiste in 512 byte a 0.\n  17. Migliorato il supporto per i nomi Unicode quando trascinate i file nella finestra di WinRAR.\n  18. La combinazione di tasti Maius+Tab puÃƒÂ² essere utilizzata nella finestra principale di WinRAR per spostare l&amp;#039;operativitÃƒÂ  sui vari elementi dell&amp;#039;interfaccia (elenco file, commenti, ramificazione cartelle, barra indirizzi) in ordine inverso. Nelle precedenti versioni la combinazione Maius+Tab si comportava come per il tasto Tab.\n  19. Corretto un possibile blocco di WinRAR durante l&amp;#039;apertura di un file UDF ISO troncato.\n  20. ÃƒË† ora possibile includere le doppie-virgolette nei parametri della linea di comando per il modulo auto-estraente di WinRAR in modalitÃƒÂ  grafica. Utilizzate due doppie-virgolette consecutive se avete questa necessitÃƒÂ .\n  21. WinRAR visualizza la barra di progresso totale quando scompatta degli archivi in formato TAR.\n  22. RAR da linea di comando visualizza ora la percentuale della ricompressione quando aggiorna i file in un archivio solido.\n      Le versioni precedenti la percentuale di ricompressione era disponibile solo in WinRAR grafico.\n\n\n","torrent":{"xt":"urn:btih:e581548f0b4d6ae4351a30803646d548aac32d03","amp;dn":"PRE-CRACKED+winrar+3.80+Ita.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e581548f0b4d6ae4351a30803646d548aac32d03","infoHashBuffer":{"type":"Buffer","data":[229,129,84,143,11,77,106,228,53,26,48,128,54,70,213,72,170,195,45,3]},"announce":[],"urlList":[]}}