{"title":"Coast to Coast AM December 15 2012","uid":7929201,"size":57932579,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e5dac9229985bdbe5cf404ff36209dacab3ae85d&amp;dn=Coast+to+Coast+AM+December+15+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1355675878,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-15-12\nHost: \tJohn B. Wells\nGuests: \tSteve Quayle, Michael Osborne\n\nIn the first half, author and researcher, Steve Quayle, discussed the coming worst-case scenarios approaching the world and how they are all interrelated. &quot;We're in a time period like no other in the history of the world,&quot; he declared, warning that the proverbial 'end game' of the global elite, as foretold in the Bible, has arrived. He cited the amplified violence in society, manipulation of the world's economy, and extreme weather being controlled by HAARP as indicators of this agenda to take over the planet. According to Quayle, &quot;UN globalists&quot; see gun control in America as a key step towards fulfilling their plan and he claimed that &quot;four star, active duty generals in special operations&quot; have told him that there are nearly 400,000 NATO troops already in the United States.\n\nQuayle also shared chilling details about the secret plans for FEMA camps in America. He cited a whistle blower from the EPA who told him &quot;the real purpose of a lot of it.&quot; Quayle explained that there is a &quot;red list&quot; of people who are &quot;deemed incorrigible&quot; and includes talk show hosts, gun owners, veterans, and &quot;people who are outspoken.&quot; These unfortunate souls, he said, are to be &quot;terminated within the first 30 days&quot; and, thus, will not end up in FEMA camps. The &quot;blue list&quot; are law enforcement and military personnel who carry out the plans for the people on the &quot;red list.&quot; Finally, there are those on the &quot;green list,&quot; who will reside in FEMA camps and are reeducated to be turned into &quot;techno-serfs&quot; for the global elite.\n\n----------------------------------------------------\n\nDirector of Generation Anthropocene, Michael Osborne, talked about how humankind's planetary impact is accelerating now that the global population has crossed seven billion. Should Earth's population continue to grow, he said, &quot;we are going to witness a complete transformation of the planet.&quot; That said, Osborne emphasized that the change could be good or bad, depending on how the human race reacts to the challenges of a greater population. One potential difficulty in this future scenario is finding a way to generate enough food for the planet while dealing with the uncertainty of climate change and the limits of usable land. These two factors, Osborne surmised, could also lead to &quot;environmental refugees&quot; as sea levels rise and space for humans becomes even more scarce.\n\nHe detailed how the scientific community has now begun to theorize that, due to the influence of the growing human population, Earth is in the midst of transitioning into a new geologic age. Where, in history, this boundary exists is the subject of considerable debate. One school of thought posits that the Industrial Revolution is the threshold, because that is when humans &quot;unlocked the potential of the natural world to work in our favor.&quot; Other candidates are the Agricultural Revolution, since that was when control over the food supply was attained, or even the Nuclear Age of the 1950's as there are exponential increases in numerous global trends like population, extinctions, and the spread of diseases. Ultimately, Osborne said, some experts believe that the intertwining of humans and technology may lead to another epoch where &quot;we will have a synthetic planet.&quot;\nWebsite(s):\n\n    stevequayle.com\n    Generation Anthropocene\n\nBook(s):\n\n    Angel Wars\n    Long Walkers: Return of the Nephilim\n\n","torrent":{"xt":"urn:btih:e5dac9229985bdbe5cf404ff36209dacab3ae85d","amp;dn":"Coast+to+Coast+AM+December+15+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5dac9229985bdbe5cf404ff36209dacab3ae85d","infoHashBuffer":{"type":"Buffer","data":[229,218,201,34,153,133,189,190,92,244,4,255,54,32,157,172,171,58,232,93]},"announce":[],"urlList":[]}}