{"title":"THE BIG BOOK OF BUFFY BITES 2008","uid":6496880,"size":960900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6fec00d4f925ee7fff32bf09714608c3c300f59&amp;dn=THE+BIG+BOOK+OF+BUFFY+BITES+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"emidius","files":2,"time":1309106384,"description":"Are you a Buffy fan? Are you just a little fanatical? If so, then this is the book for you.\n\nHave you ever watched an episode and caught a mistake by the cast or crew? This book includes a huge list of such mistakes. Included is Buffy trivia galore. Also included is information about where to find those easter eggs for special DVD extras. A full detailed episode list, up to date cast biographies, and a huge detailed list of characters. As a special bonus, inside you will find memorable quotes from the show listed by character, as well as a dictionary of Buffy slang!\n\nAnd there is more...\n\nHow about a time line showing the events from the first slayer all the way to Buffy! Can't remember the name of a certain villain we have you covered with a full listing of those Buffy villains. Last but not least by any means, is a full listing of the writers, directors, and crew...what would the show have been without them?\n\nCustomer Review\n\n&quot;I received the book as a gift and was surprised at the amount of information in this book. As a die hard Buffy fan I thought I knew all the ins and outs of the show. BUT this book pointed out so many things I missed it made me feel like a new viewer, not someone who has seen each episode at least 10 times. I also liked the time line from the first slayer to today. It fills in alot of blanks for the Buffy fan. Awesome book, highly recommended.&quot; - DharmaQueen","torrent":{"xt":"urn:btih:e6fec00d4f925ee7fff32bf09714608c3c300f59","amp;dn":"THE+BIG+BOOK+OF+BUFFY+BITES+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6fec00d4f925ee7fff32bf09714608c3c300f59","infoHashBuffer":{"type":"Buffer","data":[230,254,192,13,79,146,94,231,255,243,43,240,151,20,96,140,60,48,15,89]},"announce":[],"urlList":[]}}