{"title":"Brightblack Morning Light - Motion to Rejoin [2008][EAC,log,cue.","uid":8609140,"size":231619791,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e807605aa82906e0f1f5ff065e25b8dcab1420d6&amp;dn=Brightblack+Morning+Light+-+Motion+to+Rejoin+%5B2008%5D%5BEAC%2Clog%2Ccue.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":11,"time":1372090927,"description":"Artist:Brightblack Morning Light\nRelease:Motion to Rejoin\nReleased: 2008\nLabel: Matador\nCatalog#: OLE 786-2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:Folk Rock,folk, psychedelic\n\n01. Introduction 0:42 \n02. Hologram Buffalo 5:14\n03. Gathered Years 7:58\n04. Oppressions Each 3:24 \n05. Another Reclaimation 7:03\n06. A Rainbow Aims 9:43\n07. Summer Hoof 5:27 \n08. Past a Weatherbeaten Fencepost 6:40\n09. When Beads Spell Power Leaf 2:43\n\nAndrew Gaerig on Pitchfork, September 22, 2008 wrote:\n\n\n8.3/10\n\nIt's tempting to consider the title of Brightblack Morning Light's third album, Motion to Rejoin, a plea to return to a society they've left behind. The notoriously itinerant duo called Alabama and California home, but since their eponymous sophomore album for Matador put them on the map in 2006, they've moved off the grid to a New Mexico hut powered by a few solar panels. One listen to the ritually narcotic Motion to Rejoin, however, signals that all manner of shaman/hippie/Bohemian trappings are still very much the order of the day.\n\nThough it's easy to think of Brightblack as texturally homogeneous purveyors of mood music, revisiting Brightblack Morning Light reminds that Naybob Shineywater and Rachael Hughes have a defter sonic touch than they're often given credit for: songs experience movements, buoyed by the odd piano or horn section, and contain actual riffs. On Motion to Rejoin, Brightblack's compositional subtlety manifests itself in overt nods to American musics: shades of gospel, soul, and even funk are all marinated in Brightblack's low, flat tones. Hughes' thumbing Rhodes lines and Shineywater's cattail guitar remain the dominant elements of every song, but Motion to Rejoin is more tremulous than its predecessor, the same way a high-zoom photo might be blurred with a slight shake of the camera.\n\nMake whatever ha-ha-stoner jokes you will, but it takes no small amount of discipline to unravel music as consistently slow as that of Hughes and Shineywater. Brightblack have now released over 140 minutes of music without showing even a cursory interest in acceleration or haste. At this point their style seems less likely to be framed by medicinal sleepiness or amateur craftsmanship and more likely the intriguing notion that the pace of these records represents the speed at which Brightblack's world moves.\n\nMotion to Rejoin's songs therefore aren't &quot;drug&quot; or &quot;hippie&quot; music, and they don't develop so much as accumulate. On &quot;Gathered Years&quot; horns gain prominence over the course of dozens of bars and only after the vocals dissipate, as if snowballing too many elements at once might generate the type of momentum Brightblack avoid so meticulously. &quot;Summer Hoof&quot; treads wordlessly for over five minutes, slowly gathering the album's sunniest and most optimistic tones.\n","torrent":{"xt":"urn:btih:e807605aa82906e0f1f5ff065e25b8dcab1420d6","amp;dn":"Brightblack+Morning+Light+-+Motion+to+Rejoin+%5B2008%5D%5BEAC%2Clog%2Ccue.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e807605aa82906e0f1f5ff065e25b8dcab1420d6","infoHashBuffer":{"type":"Buffer","data":[232,7,96,90,168,41,6,224,241,245,255,6,94,37,184,220,171,20,32,214]},"announce":[],"urlList":[]}}