{"title":"Journal of Catalysis 1962-2012","uid":13539183,"size":10059395459,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e98575d922969958755a8627e1bc82fffb19384b&amp;dn=Journal+of+Catalysis+1962-2012&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":287,"time":1455469437,"description":"Journal of Catalysis is the premier scholarly publication in the field of catalysis and an indispensable source of information for chemists and chemical engineers in both industrial and academic fields. Over the last decade, Journal of Catalysis has been ranked among the top five chemical engineering journals in terms of impact and relevance. During this period, it has published some of the most important contributions to physical chemistry and the science and applications of catalysis.\r\n\r\nJournal of Catalysis publishes original, rigorous, and scholarly contributions in the fields of heterogeneous catalysis and homogeneous catalysis. These include studies that relate catalytic function to fundamental chemical processes at surfaces and in metal complexes, novel concepts in surface chemistry, the synthesis and catalytic function of novel inorganic solids and complexes, spectroscopic methods for structural characterization, and theoretical methods of direct interest and impact in the science and applications of catalysts and catalytic processes.\r\n\r\nJournal of Catalysis publishes manuscripts of archival value because of their significant fundamental and conceptual contributions to our understanding and practice of catalytic chemistries. The journal features authoritative articles, priority communications, research notes, and letters to the Editors.\r\n\r\nJournal of Catalysis also publishes Priority Communications and Research Notes. Priority Communications contain unique, exciting, and novel results that provide compelling evidence for rapid publication; while results in such communications may be of a preliminary nature, experimental details must be fully documented and the results reliably reproduced. Research Notes typically contain data and concepts that resolve in a concise but rigorous manner issues raised in previous publications","torrent":{"xt":"urn:btih:e98575d922969958755a8627e1bc82fffb19384b","amp;dn":"Journal+of+Catalysis+1962-2012","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e98575d922969958755a8627e1bc82fffb19384b","infoHashBuffer":{"type":"Buffer","data":[233,133,117,217,34,150,153,88,117,90,134,39,225,188,130,255,251,25,56,75]},"announce":[],"urlList":[]}}