{"title":"Solving Problems with NMR Spectroscopy 2nd ed","uid":15479408,"size":52723585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9ba71ae878a72df239db84e74e5881079f15588&amp;dn=Solving+Problems+with+NMR+Spectroscopy+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470228342,"description":"Solving Problems with NMR Spectroscopy 2nd ed - Atta-ur-Rahman et al. (AP, 2016).pdf\r\n\r\nSolving Problems with NMR Spectroscopy, Second Edition, is a fully updated and revised version of the best-selling book. This new edition still clearly presents the basic principles and applications of NMR spectroscopy with only as much math as is necessary. It shows how to solve chemical structures with NMR by giving many new, clear examples for readers to understand and try, with new solutions provided in the text.\r\n\r\nIt also explains new developments and concepts in NMR spectroscopy, including sensitivity problems (hardware and software solutions) and an extension of the multidimensional coverage to 3D NMR. The book also includes a series of applications showing how NMR is used in real life to solve advanced problems beyond simple small-molecule chemical analysis.\r\n\r\nThis new text enables organic chemistry students to choose the most appropriate NMR techniques to solve specific structures. The problems provided by the authors help readers understand the discussion more clearly and the solution and interpretation of spectra help readers become proficient in the application of important, modern 1D, 2D, and 3D NMR techniques to structural studies.\r\n\r\n\r\n\r\nExplains and presents the most important NMR techniques used for structural determinations\r\nOffers a unique problem-solving approach for readers to understand how to solve structure problems\r\nUses questions and problems, including discussions of their solutions and interpretations, to help readers understand the fundamentals and applications of NMR\r\nAvoids use of extensive mathematical formulas and clearly explains how to implement NMR structure analysis\r\nForeword by Nobel Prize winner Richard R. Ernst\r\nNew to This Edition\r\n\r\n\r\nKey developments in the field of NMR spectroscopy since the First Edition in 1996\r\nNew chapter on sensitivity enhancement, a key driver of development in NMR spectroscopy\r\nNew concepts such as Pulse Field Gradients, shaped pulses, and DOSY (Diffusion Order Spectroscopy) in relevant chapters\r\nMore emphasis on practical aspects of NMR spectroscopy, such as the use of Shigemi tubes and various types of cryogenic probes\r\nOver 100 new problems and questions addressing the key concepts in NMR spectroscopy\r\nImproved figures and diagrams\r\nMore than 180 example problems to solve, with detailed solutions provided at the end of each chapter","torrent":{"xt":"urn:btih:e9ba71ae878a72df239db84e74e5881079f15588","amp;dn":"Solving+Problems+with+NMR+Spectroscopy+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9ba71ae878a72df239db84e74e5881079f15588","infoHashBuffer":{"type":"Buffer","data":[233,186,113,174,135,138,114,223,35,157,184,78,116,229,136,16,121,241,85,136]},"announce":[],"urlList":[]}}