{"title":"Buzz the Music Quiz Ps2","uid":4402031,"size":2809218683,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e9d7fcaedcd67e2509e995bd55608e993e69f2d9&amp;dn=Buzz+the+Music+Quiz+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bochelboy","files":77,"time":1221750911,"description":"Manufacturer&amp;#039;s Description\nIf you&amp;#039;ve listened to the radio in the last fifty years and you know how to buzz, then you&amp;#039;re all set to be the next contestant on Buzz: The Music Quiz\nBuzz brings the music game-show to your living room, testing your music trivia and buzzer skills. Included with the game are a set of four bespoke buzzers which lets four people play right away, and provides an interface that even a techno-zero would understand.\n\n&amp;#039;Buzz&amp;#039; is your host, complete with an all-knowing smile, a catchphrase, a glamorous assistant called &amp;#039;Rose&amp;#039; and his very own theme tune. You can select a playable contestant to suit your personal music taste, choose from 16 different characters including a pop diva, a rocker, a punk, an Elvis and a disco dude.\n\nThere are over 1,000 music clips--all international chart-toppers from the 1950s through to 2005--and over 5,000 questions to test your knowledge, either by playing solo in a fast paced single-player mode or with your friends in the multiplayer game. You can choose to play in short bursts, or over a longer period if you want to. All wins and losses can be saved to memory cards if you need to refer to them at a later date! \n\nThere are eight different rounds that will give you the opportunity to prove your music muscle:\n\nPoint Builder: A nice simple round to start off with which lets you build up some points to lose or build on - in later rounds.\nSnap: If you see the right answer appear onscreen, then Buzz in as fast as you can. Beware though; you&amp;#039;ll need lightning reactions to beat your competitors.\nFastest Finger: The quicker you buzz, the more points you&amp;#039;ll see.\nOffloader: Whether you know the answer or not is irrelevant. More importantly, who do you think doesn&amp;#039;t know? This is your opportunity to get your rivals to answer the questions you don&amp;#039;t want to.\nPass the Bomb: Answer the question correctly to pass the bomb to the next contestant, but don&amp;#039;t get caught holding it as it goes off.\nPoint Stealer:Time to seek revenge on those that have crossed you in the past.\nBuzz Stop: Good hand-eye co-ordination and an aptitude for inane trivia are all that&amp;#039;s required for this round. This is a pass or play round, so Buzz in if you want no-one else to have the chance to answer the question if you know it, and pass if you don&amp;#039;t.\nLook Before You Leap:The final round, so there is everything to play for here. Buzz in as soon as you know the answer, but watch out as hastiness could be a bad move: if you don&amp;#039;t know the answer, you&amp;#039;ll lose points.\nTie-Breaker: And finally, a game-show would not be a game-show without the ubiquitous Tie-Breaker \n\n\nNOTE: THIS IS FOR THE PLAYSZTADION 2 AND YOU NEED A BUZZER FOR THIS GAME!!!!\n\nfor more check \nwww.worldofsouthpark.nl","torrent":{"xt":"urn:btih:e9d7fcaedcd67e2509e995bd55608e993e69f2d9","amp;dn":"Buzz+the+Music+Quiz+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9d7fcaedcd67e2509e995bd55608e993e69f2d9","infoHashBuffer":{"type":"Buffer","data":[233,215,252,174,220,214,126,37,9,233,149,189,85,96,142,153,62,105,242,217]},"announce":[],"urlList":[]}}