{"title":"James Patterson &amp; Michael Ledwidge - Zoo (ePub/mobi)","uid":7597940,"size":1132191,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea601118cc79d52cb0912d323dd068e4669af728&amp;dn=James+Patterson+%26amp%3B+Michael+Ledwidge+-+Zoo+%28ePub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xemius","files":-1,"time":1346744469,"description":"Request by olmosfamily and jm24.\nFol\nSummary\nOnce in a lifetime, a writer puts it all together. This is James Patterson's best book ever.\nFor 36 years, James Patterson has written unputdownable, pulse-racing novels. Now, he has written a book that surpasses all of them. ZOO is the thriller he was born to write.\n\nAll over the world, brutal attacks are crippling entire cities. Jackson Oz, a young biologist, watches the escalating events with an increasing sense of dread. When he witnesses a coordinated lion ambush in Africa, the enormity of the violence to come becomes terrifyingly clear.\n\nWith the help of ecologist Chloe Tousignant, Oz races to warn world leaders before it's too late. The attacks are growing in ferocity, cunning, and planning, and soon there will be no place left for humans to hide. With wildly inventive imagination and white-knuckle suspense that rivals Stephen King at his very best, James Patterson's ZOO is an epic, non-stop thrill-ride from &quot;One of the best of the best.&quot; (TIME)\n\nFormats provided are:\n.ePub -\nCompatible with most eReaders including the Apple iPad. If you wish to read .ePub doucuments on a Mac/PC I would recommend downloading Adobe Digital Editions. (Just google it and follow the instructions on the Adobe website.)\n.mobi -\nFor the Amazon kindle. Kindle for PC may also be available depending on your region.\n\nIf you like the book, support the author and buy it!","torrent":{"xt":"urn:btih:ea601118cc79d52cb0912d323dd068e4669af728","amp;dn":"James+Patterson+%26amp%3B+Michael+Ledwidge+-+Zoo+%28ePub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea601118cc79d52cb0912d323dd068e4669af728","infoHashBuffer":{"type":"Buffer","data":[234,96,17,24,204,121,213,44,176,145,45,50,61,208,104,228,102,154,247,40]},"announce":[],"urlList":[]}}