{"title":"Hilary Duff - Beat Of My Heart","uid":4623988,"size":110202884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eab7a592f462f42a6f7d3c4127e59fd328292323&amp;dn=Hilary+Duff+-+Beat+Of+My+Heart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1231147817,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Beat of My Heart&quot; is a song co-written by American singer Hilary Duff, Joel Madden and Benji Madden, and co-produced by the Maddens for Duff's fourth album, Most Wanted (2005). It was released as the album's second single in late 2005.\n\nThe &quot;Beat of My Heart&quot; music video was shot in Los Angeles, California by director Phil Harder in the week beginning September 26, 2005, and it pays homage to Bond girls. A representative for Duff's record label said, &quot;She's always been a huge James Bond fan. She watched those movies with her sister growing up, and she loved the Bond girls, because they were always so stylish, and she's stylish.&quot; She also said the video would contain &quot;that hip sensibility&quot; of Bond films and present a &quot;more mature&quot; image of Duff.\n\nThe video begins with a graphic produced by an electrocardiograph accompanying the heartbeats in the song, until a beating heart appears as if seen through an X-ray machine. The format of the video is a series of vignettes, each influenced by the opening title sequences of James Bond films (from the silhouettes featured in the 1960s films to the 3D graphics in the then-recent films); in them Duff, who is often presented performing the song with her band and into a microphone (which is sometimes silhoetted and placed where a gun would be), sports different looks inspired by the different eras of the Bond films. As in the Bond film opening title sequences, the video often moves from one shot to another not through cuts, but with shapes in one shot transforming to form elements of the next shot, and the editing is matched to the beat of the song.\n\nThe video premiered on MTV's Total Request Live on November 9. It entered the TRL top ten countdown the following day and ascended to number one on November 14. It remained on the countdown for twenty days, until December 19. The FOX sketch show MADtv did a parody of the song and music video, &quot;For the Sake of My Fame&quot;, which featured Arden Myrin as Duff. The parody was centered on young female celebrities such as Paris Hilton, Lindsay Lohan and Duff herself allegedly becoming anorexic to stay thin and popular.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:eab7a592f462f42a6f7d3c4127e59fd328292323","amp;dn":"Hilary+Duff+-+Beat+Of+My+Heart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eab7a592f462f42a6f7d3c4127e59fd328292323","infoHashBuffer":{"type":"Buffer","data":[234,183,165,146,244,98,244,42,111,125,60,65,39,229,159,211,40,41,35,35]},"announce":[],"urlList":[]}}