{"title":"TSF Shell v1.9.9.5.2.Full","uid":8575855,"size":8601755,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ec016b8b199b2c8c5e5d2b7dd9d4f14f5635d0b7&amp;dn=TSF+Shell+v1.9.9.5.2.Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"saifi2649","files":2,"time":1371272052,"description":"TSF Shell is a unique graphical user interface experience for Android\n\nOS. This premium home screen replacement allows for endless possibilities\n\nas you personalize your widgets and home screens. Say goodbye to the\n\nboring, traditional Android interface!\n\nFor more information about TSF Shell release history and to view the demo\n\nof all versions please visit the following link:\n &lt;a href=&quot;\nhttp://www.tsfui.com/shell/release_history.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsfui.com/shell/release_history.html&lt;/a&gt; You really do need to see\n\nthis product in action to truly understand its unique capabilities!\n\nFeatures:\n\n========================\n\n*Multiple operations such as auto-arrangement, multi-item selection, adding\n\nto folder, and multi-deleting can be quickly done by only one finger\n\ngesture.\n\n*Folders can be utilitized in various ways.\n\n*TSF Shell has an APP page (drawer) in addition to 4 home screens. You can\n\nswitch between homescreens by traditional swiping, or by utilizing the one\n\nclick switcher in the lower corner. When mastered, this gesture-like\n\nhomescreen switching becomes natural, and is much faster than swiping\n\nacross screens.\n\n*Quickly create multiple app shortcuts and drag them to any page at once.\n\nYou can then distribute the app icons freely on the page, and can even\n\nchange the angles of the shortcuts. The arrangement and design is up to\n\nyour imagination!\n\n*The side column provides access to most of TSF Shell's widgets, folders,\n\ncontacts, weater, settings, and other app shortcuts of your choice.\n\n*Side column can be completely personalized with your own shortcuts, it can\n\nalso be auto-hidden (viewable by swipe gesture).\n\n*Powerful theme function. In addition to stylistic changes, themes can even\n\nallow for transistion animation changes. \n\nWhats New in this version:\n\nVersion 1.9.9.5.2\n\nFixed the issue that shortcut missing at folder.\n\nFixed some Android widgets abnormally display issue (such as DashClock).\n\nFixed the issue that some third-party themes cannot use.\n\nFixed the issue of SMS widget display size.\n\nFixed some crash issue.\n","torrent":{"xt":"urn:btih:ec016b8b199b2c8c5e5d2b7dd9d4f14f5635d0b7","amp;dn":"TSF+Shell+v1.9.9.5.2.Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec016b8b199b2c8c5e5d2b7dd9d4f14f5635d0b7","infoHashBuffer":{"type":"Buffer","data":[236,1,107,139,25,155,44,140,94,93,43,125,217,212,241,79,86,53,208,183]},"announce":[],"urlList":[]}}