{"title":"The Le Wood Anal Hazing Crew 2 XviD-PORNOLATiON","uid":7861367,"size":1414480001,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ec7174e35a3a89cc1fb69656f49fcdf3682ab96c&amp;dn=The+Le+Wood+Anal+Hazing+Crew+2+XviD-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1353940713,"description":"Category Anal, Threesomes &amp; More \n  \nDirector Francesca Le, Mark Wood \n\nStarring Francesca Le, Sheena Shaw, Penny Pax, Mark Wood, Veruca James, Kimmy Olsen \n\n\nDescription\n\nNow That's What I Call Anal Hazing!\n\nGorgeous MILF Francesca Le and well-hung Mark Wood's LeWood Productions is known for rough, filthy action and brutal anal dominance delivered with a natural, familiar charm owing to their status as a real life married couple. 'The Le Wood Anal Hazing Crew #2' is their new four-scene roller coaster of vicious ass play from the Buttman Choice line of kinky specialty videos. In each of four vignettes, Mark and Francesca portray evil swingers who get off on making young ladies submit to their perverted lust - they mete out anal punishment and inflict rectal gaping, face slapping, rim jobs and spanking to break their victims' spirit. Sexy Sheena Shaw gets caught snooping through the cache of sex toys in Francesca's closet. So Mistress fills Sheena's mouth and harshly stretches her asshole with an inflatable butt plug.\n\nMark relentlessly butt-fucks the leggy beauty in a nasty threesome. Neighborhood slut Penny Pax attempts to seduce Mark, but the pretty blonde has crossed the wrong household. Penny gets a fierce ass banging flavored with LeWood-style humiliation. Sexually active cutie Kimmy Olsen undergoes a session of counseling from the older couple... if face fucking, intense buggery and ass-to-mouth discipline count as counseling. When Mark and Francesca find out that frisky employee Veruca James has been blowing random dudes behind the store, the price for keeping her job is sadistic rectal ravishment. Don't fuck around with the LeWood crew or they might fuck around with you! \n\n\n\nDuration                                 : 2h 36mn\nBit rate                                 : 1 078 Kbps\nMaximum bit rate                         : 2 987 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 404 pixels\n\n\n\n\n &lt;a href=&quot;\nhttp://tippic.eu/?v=postergzg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tippic.eu/?v=postergzg.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://tippic.eu/?v=pltlwahc2m.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tippic.eu/?v=pltlwahc2m.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ec7174e35a3a89cc1fb69656f49fcdf3682ab96c","amp;dn":"The+Le+Wood+Anal+Hazing+Crew+2+XviD-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec7174e35a3a89cc1fb69656f49fcdf3682ab96c","infoHashBuffer":{"type":"Buffer","data":[236,113,116,227,90,58,137,204,31,182,150,86,244,159,205,243,104,42,185,108]},"announce":[],"urlList":[]}}