{"title":"Grateful Dead - Shakedown Street (1978) 2013 HDTracks 24-96-FLAC","uid":11156342,"size":844714211,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ec7af56375afa44b468c58c2878950c3e5c81183&amp;dn=Grateful+Dead+-+Shakedown+Street+%281978%29+2013+HDTracks+24-96-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hal4000","files":-1,"time":1412433968,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nSince the Grateful Dead were notorious for recording awkward studio albums, it always seemed that the answer to their problem was simply getting the right producer to coax magic out of the band -- and nobody would seem better suited for the position than Little Feat leader Lowell George, whose own band shared the Dead's tendency to wander and jam in a live setting, yet made almost nothing but good studio records. But 1978 was not a great year for either camp, as the Dead were drifting in their attempts to score a crossover hit for Clive Davis' Arista Records, while George was pushing Little Feat toward disbandment as he was inching closer to his premature death in 1979. Add to that the Dead's sudden, inexplicable fascination with disco, a desire to have Donna Jean Godchaux be an integral part of the record, plus no new songs ready to go at the beginning of the sessions, and it's little surprise that Shakedown Street wound up as a mess. It rambles and wanders all over the place, as the Dead cover the Rascals' &quot;Good Lovin'&quot; before they revive &quot;New Minglewood Blues&quot; (which they originally cut for their debut), as Jerry Garcia and Robert Hunter write their own &quot;Stagger Lee&quot; while Mickey Hart and Bill Kreutzmann get a percussion workout on the brief instrumental &quot;Serengetti&quot; and Bob Weir affects a bluesy growl on &quot;I Need a Miracle.&quot; In George's hands, this is all given a smooth gloss not all that far removed from such latter-day Feat LPs as The Last Record Album, but since the Dead favor hazy, lazy grooves to Feat's laid-back but tight New Orleans funk -- and since George didn't produce so much as he created an appropriate atmosphere in the studio -- Shakedown Street meanders mercilessly, and its indulgences wind up overwhelming the album as a whole. And there isn't just one kind of indulgence here; there's a plethora of them, ranging from the disco pulse of the title track to the fuzziness of the two songs sung by Donna Jean. This can make Shakedown Street a bit of a difficult, dated listen, since even the good songs boast bad arrangements (&quot;Shakedown Street&quot; and &quot;Fire on the Mountain&quot; were later reworked and revitalized in concert), yet it falls short of flat-out disaster, partially because it's a fascinating listen due to the very things that make it a severely flawed record. The disco flirtations, subdued funk, misguided commercial concessions, and overarching Californian slickness do make Shakedown Street fascinating for at least one spin, even if they'll keep even hardcore Deadheads -- maybe especially hardcore Deadheads -- from coming back to the record more than once every decade or so.\n\nHDTracks PCM-24Bit-96Khz-FLAC.","torrent":{"xt":"urn:btih:ec7af56375afa44b468c58c2878950c3e5c81183","amp;dn":"Grateful+Dead+-+Shakedown+Street+%281978%29+2013+HDTracks+24-96-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec7af56375afa44b468c58c2878950c3e5c81183","infoHashBuffer":{"type":"Buffer","data":[236,122,245,99,117,175,164,75,70,140,88,194,135,137,80,195,229,200,17,131]},"announce":[],"urlList":[]}}