{"title":"New York Year by Year: A Chronology of the Great Metropolis","uid":8517749,"size":1446739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed518c3193deac0cd741b329c580e275357dc410&amp;dn=New+York+Year+by+Year%3A+A+Chronology+of+the+Great+Metropolis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1369804284,"description":"New York Year by Year:\nA Chronology of the Great Metropolis\nJeffrey A. Kroessler\n\n\n\nNYU Press, 2002\nPDF: 367 pages\n\n\nIf any city deserves a complete chronology, it is surely New York. New York, Year by Year is a cornucopia of the familiar and the forgotten, the historic and the ephemeral, the heroic and the banal. In this handy reference work, Jeffrey A. Kroessler takes us from Verrazano's arrival in 1524 into the new millennium, highlighting the strikes and strikeouts, tunnels and towers, personalities and parades which not only made history in New York, but also proved to be defining moments for the nation.\n\nNew York, Year by Year features events such as Mark Twain's first lecture at Cooper Union, and the letter he later wrote when the Brooklyn Public Library tried to restrict access to Huckleberry Finn. In contrast, we are reminded of the publication in the 1950s of Eloise, A Book for Precocious Grown-Ups, Kay Thompson's fanciful tale of a little girl's adventures in the Plaza Hotel, the appearance of the Beat Generation, and the flight (literally) of the Dodgers and Giants to California. New York, Year by Year chronicles the opening of Shea Stadium in April 1964 and the performance by the Beatles there that August. The Sixties also saw the opening of The Fantastiks, which is still running on Sullivan Street, and the closing of Steeplechase, the last of the great amusement parks at Coney Island. And this chronology makes sure we don't forget when Kitty Genovese was murdered in Kew Gardens and her cries for help were left unanswered because her neighbors &quot;didn't want to get involved.&quot; Kroessler leads us on a tour of the city from its first settlers until the November 2001 election of a new mayor for the new millennium.\n\nFrom the colonial era and the Revolution through the Gilded Age and the Roaring Twenties, Kroessler has compiled a record of cultural, economic, political, and social events. Some are of transient importance, others of lasting significance, but all illuminate the city's fascinating history.","torrent":{"xt":"urn:btih:ed518c3193deac0cd741b329c580e275357dc410","amp;dn":"New+York+Year+by+Year%3A+A+Chronology+of+the+Great+Metropolis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed518c3193deac0cd741b329c580e275357dc410","infoHashBuffer":{"type":"Buffer","data":[237,81,140,49,147,222,172,12,215,65,179,41,197,128,226,117,53,125,196,16]},"announce":[],"urlList":[]}}