{"title":"After The Fall - Charity Norman.epub","uid":9087345,"size":464670,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edbad93b55b85e943db76c9b7a96b421d7d4a302&amp;dn=After+The+Fall+-+Charity+Norman.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1382520453,"description":"What do you do when your family's dream becomes a nightmare? Combining the skill of Jodi Picoult with the warmth of Anita Shreve, Charity Norman explores - with heart-thumping tension - a fresh start which goes very badly wrong.\n\nIn the quiet of a New Zealand winter's night, a rescue helicopter is sent to airlift a five-year-old boy with severe internal injuries. He's fallen from the upstairs veranda of an isolated farmhouse, and his condition is critical. At first, Finn's fall looks like a horrible accident; after all, he's prone to sleepwalking. Only his frantic mother, Martha McNamara, knows how it happened. And she isn't telling. Not yet. Maybe not ever.\n\nTragedy isn't what the McNamara family expected when they moved to New Zealand. For Martha, it was an escape. For her artist husband Kit, it was a dream. For their small twin boys, it was an adventure. For sixteen-year-old Sacha, it was the start of a nightmare.\n\nThey end up on the isolated east coast of the North Island, seemingly in the middle of a New Zealand tourism campaign. But their peaceful idyll is soon shattered as the choices Sacha makes lead the family down a path which threatens to destroy them all.\n\nMartha finds herself facing a series of impossible decisions, each with devastating consequences for her family.","torrent":{"xt":"urn:btih:edbad93b55b85e943db76c9b7a96b421d7d4a302","amp;dn":"After+The+Fall+-+Charity+Norman.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edbad93b55b85e943db76c9b7a96b421d7d4a302","infoHashBuffer":{"type":"Buffer","data":[237,186,217,59,85,184,94,148,61,183,108,155,122,150,180,33,215,212,163,2]},"announce":[],"urlList":[]}}