{"title":"05 Trials of Death - Darren Shan-viny","uid":6426734,"size":374352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee1535afd2fe112b581ed6b101f6d346e7c4cbfc&amp;dn=05+Trials+of+Death+-+Darren+Shan-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306456797,"description":"05 Trials of Death - Darren Shan-viny\n\nThe Hall of Flames and Blooded Boars await Darren Shan -- and Cirque du Freak fans -- in this fifth installment of the author's popular vampire series.\n\n\n\nNow that Darren is at Vampire Mountain, he's out to prove himself a worthy vampire by undergoing the five Trials of Death. After the boy escapes his first run-in with death in the Aquatic Maze, he faces a bloody journey through the Path of Needles and almost scorches himself in the Hall of Flames. But when the Blooded Boars -- his fourth trial -- are ready to take his life for good, a surprising rescue by a friend means almost certain execution at the hands of the Vampire Princes. That is, until he comes face to face with a traitor he thought was his friend.\n\n\n\nWith loads of bone-chilling action and near-death battles, Shan takes Cirque du Freak to an even scarier level in this fifth book. Scenes of Darren being gashed with stalactites and savagely burned are gruesome and cool, while the story provides surprises that will make your jaw drop. Trials of Death will definitely keep you on the edge of your seat -- and maybe even holding your stomach.","torrent":{"xt":"urn:btih:ee1535afd2fe112b581ed6b101f6d346e7c4cbfc","amp;dn":"05+Trials+of+Death+-+Darren+Shan-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee1535afd2fe112b581ed6b101f6d346e7c4cbfc","infoHashBuffer":{"type":"Buffer","data":[238,21,53,175,210,254,17,43,88,30,214,177,1,246,211,70,231,196,203,252]},"announce":[],"urlList":[]}}