{"title":"Time Out of Mind The Lives of Bob Dylan by Ian Bell (The Lives o","uid":9178485,"size":3393317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee1f7dfce27cfd67e9b00d8a6e64dd266ea6857b&amp;dn=Time+Out+of+Mind+The+Lives+of+Bob+Dylan+by+Ian+Bell+%28The+Lives+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1384193559,"description":"By the middle of the 1970s, Bob Dylan's position as the pre-eminent artist of his generation was assured. The 1975 album &quot;Blood on the Tracks&quot; seemed to prove, finally, that an uncertain age had found its poet. Perverse or driven, Dylan refused the role. By the decade's end, the counter-culture's poster child had embraced conservative, evangelical Christianity. Fans and critics alike were confused; many were aghast. Still the hits kept coming. Then Dylan faltered. His instincts, formerly unerring, deserted him. In the 1980s, what had once appeared unthinkable came to pass: the 'voice of a generation' began to sound irrelevant, a tale told to grandchildren. Yet in the autumn of 1997 something remarkable happened. Having failed to release a single new song in seven long years, Dylan put out the equivalent of two albums in a single package. He called it &quot;Time Out of Mind&quot;. So began the renaissance, artistic and personal, that culminated in 2012's acclaimed &quot;Tempest&quot;. In the concluding volume of his groundbreaking study, Ian Bell explores the unparalleled second act in a quintessentially American career. It is a tale of redemption, of an act of creative will against the odds, and of a writer who refused to fade away. &quot;Time Out of Mind&quot; is the story of the latest, perhaps the last, of the many Bob Dylans. This one might yet turn out to have been the most important of them all. \nGenre: Non-Fiction &gt; Biographies\n","torrent":{"xt":"urn:btih:ee1f7dfce27cfd67e9b00d8a6e64dd266ea6857b","amp;dn":"Time+Out+of+Mind+The+Lives+of+Bob+Dylan+by+Ian+Bell+%28The+Lives+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee1f7dfce27cfd67e9b00d8a6e64dd266ea6857b","infoHashBuffer":{"type":"Buffer","data":[238,31,125,252,226,124,253,103,233,176,13,138,110,100,221,38,110,166,133,123]},"announce":[],"urlList":[]}}