{"title":"Thoria-based Nuclear Fuels","uid":12744311,"size":11404968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee3e6b0492aafd835748f6cc0244bcbcd1d5ae1e&amp;dn=Thoria-based+Nuclear+Fuels&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1447281879,"description":"Thoria-based Nuclear Fuels (Springer, 2013).pdf\r\n\r\nISBN 9781447155881\r\n\r\nThis book presents the state of the art on thermophysical and thermochemical properties, fabrication methodologies, irradiation behaviours, fuel reprocessing procedures, and aspects of waste management for oxide fuels in general and for thoria-based fuels in particular. The book covers all the essential features involved in the development of and working with nuclear technology. With the help of key databases, many of which were created by the authors, information is presented in the form of tables, figures, schematic diagrams and flow sheets, and photographs. This information will be useful for scientists and engineers working in the nuclear field, particularly for design and simulation, and for establishing the technology. One special feature is the inclusion of the latest information on thoria-based fuels, especially on the use of thorium in power generation, as it has less proliferation potential for nuclear weapons. Given its natural abundance, thorium offers a future alternative to uranium fuels in nuclear technology. In closing, the latest information on conventional uranium and plutonium fuels is also provided","torrent":{"xt":"urn:btih:ee3e6b0492aafd835748f6cc0244bcbcd1d5ae1e","amp;dn":"Thoria-based+Nuclear+Fuels","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee3e6b0492aafd835748f6cc0244bcbcd1d5ae1e","infoHashBuffer":{"type":"Buffer","data":[238,62,107,4,146,170,253,131,87,72,246,204,2,68,188,188,209,213,174,30]},"announce":[],"urlList":[]}}