{"title":"Functional Ingredients from Algae for Foods and Nutraceuticals","uid":15316591,"size":11110175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee616883f7e6e1343af334ff70873e97502261f6&amp;dn=Functional+Ingredients+from+Algae+for+Foods+and+Nutraceuticals&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468616591,"description":"Functional Ingredients from Algae for Foods and Nutraceuticals - Herminia Domínguez (WP, 2013).pdf\r\n\r\nISBN 978-0-85709-512-1\r\n\r\nAlgae have a long history of use as foods and for the production of food ingredients. There is also increasing interest in their exploitation as sources of bioactive compounds for use in functional foods and nutraceuticals. Functional ingredients from algae for foods and nutraceuticals reviews key topics in these areas, encompassing both macroalgae (seaweeds) and microalgae.\r\n\r\nAfter a chapter introducing the concept of algae as a source of biologically active ingredients for the formulation of functional foods and nutraceuticals, part one explores the structure and occurrence of the major algal components. Chapters discuss the chemical structures of algal polysaccharides, algal lipids, fatty acids and sterols, algal proteins, phlorotannins, and pigments and minor compounds. Part two highlights biological properties of algae and algal components and includes chapters on the antioxidant properties of algal components, anticancer agents derived from marine algae, anti-obesity and anti-diabetic activities of algae, and algae and cardiovascular health. Chapters in part three focus on the extraction of compounds and fractions from algae and cover conventional and alternative technologies for the production of algal polysaccharides. Further chapters discuss enzymatic extraction, subcritical water extraction and supercritical CO2 extraction of bioactives from algae, and ultrasonic- and microwave-assisted extraction and modification of algal components. Finally, chapters in part four explore applications of algae and algal components in foods, functional foods and nutraceuticals including the design of healthier foods and beverages containing whole algae, prebiotic properties of algae and algae-supplemented products, algal hydrocolloids for the production and delivery of probiotic bacteria, and cosmeceuticals from algae.\r\n\r\nFunctional ingredients from algae for foods and nutraceuticals is a comprehensive resource for chemists, chemical engineers and medical researchers with an interest in algae and those in the algaculture, food and nutraceutical industries interested in the commercialisation of products made from algae.\r\n\r\nProvides an overview of the major compounds in algae, considering both macroalgae (seaweeds) and microalgae\r\nDiscusses methods for the extraction of bioactives from algae\r\nDescribes the use of algae and products derived from them in the food and nutraceutical industries","torrent":{"xt":"urn:btih:ee616883f7e6e1343af334ff70873e97502261f6","amp;dn":"Functional+Ingredients+from+Algae+for+Foods+and+Nutraceuticals","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee616883f7e6e1343af334ff70873e97502261f6","infoHashBuffer":{"type":"Buffer","data":[238,97,104,131,247,230,225,52,58,243,52,255,112,135,62,151,80,34,97,246]},"announce":[],"urlList":[]}}