{"title":"David T. Courtwright - Forces of Habit. Drugs and the Making of ","uid":10131058,"size":2686706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee6438136f40b7b2df1833e0170d0ed009b07a00&amp;dn=David+T.+Courtwright+-+Forces+of+Habit.+Drugs+and+the+Making+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1399883702,"description":"Description\nProduct Details\nBook Title: Forces of Habit: Drugs and the Making of the Modern World\t\nBook Author: David T. Courtwright\nHardcover: 288 pages\nPublisher: Harvard University Press; 1 edition (March 23, 2001)\nLanguage: English\nISBN-10: 0674004582\nISBN-13: 978-0674004580\n\n===================================================================================\nBook Description\nPublication Date: March 23, 2001 | ISBN-10: 0674004582 | ISBN-13: 978-0674004580 | Edition: 1\nWhat drives the drug trade, and how has it come to be what it is today? A global history of the acquisition of progressively more potent means of altering ordinary waking consciousness, this book is the first to provide the big picture of the discovery, interchange, and exploitation of the planet's psychoactive resources, from tea and kola to opiates and amphetamines.\n\n===================================================================================\nEditorial Reviews\nFrom Library Journal\nHistorian Courtwright (Violent Land) ranges widely across more than four centuries and the world to chart the &quot;psychoactive revolution&quot; that made ever more potent drugs available to all classes of people and redefined the meaning and means of consciousness, and even social conscience. As pleasure came to matter more, drugs of all kinds found ready takers. Courtwright gathers up historical, scientific, literary, artistic, and public policy references on psychoactive substances, legal and illegal, to show how drug usage was as much an outgrowth of market forces as cultural habits. Drugs were commerce and currency and moved from geographically limited areas of cultivation to worldwide consumption, with ever more efficient means of production and supply driving down prices and thereby opening markets to the poorest. Efforts by governments over the past century to outlaw particular drugs, while regulating others, have proved uneven and erratic. Always intelligent and informed, witty and wise, Courtwright's book is the best way to get a fix on why getting drugs out of our systems would require more than abstinence; it would take another revolution in handling social and personal pain. An essential acquisition.DRandall M. Miller, Saint Joseph's Univ., Philadelphia\nCopyright 2001 Reed Business Information, Inc.\n\nFrom The New England Journal of Medicine\nSet on a world stage, this book is about the ``psychoactive revolution'' of the past 500 years. Courtwright, well known for his work concerning the history of drug addiction and, more generally, social history, observes that in wealthy societies in the 20th century a cornucopia of drugs, illicit and licit, became available and popular. How did this situation arise, he asks, and how have societies and governments coped with it, and especially, why have some drugs posed more of a problem than others? The main story relates to the expansion of European oceangoing commerce in early modern times and the resulting discoveries of new commercial opportunities. In the drug trade, the three big items eventually became alcohol, tobacco, and caffeine, to the exclusion of other possibilities derived from the plant world. These three drugs remain abundant and profitable commodities, eliciting various responses in different societies.\nThus, this book is not about medicine itself or about the changing practices of physicians over the centuries. Although the author mentions those practices from time to time, he is concerned with the broader story of the sweeping changes in the markets, and thereby in the uses, of a range of substances. And he explains how governments have responded differently in different ages to the growing commodification and popularity of psychoactive substances. Alcohol and caffeine were, of course, Old World products whose spread became enormously wider as a result of European expansion and European technology. Tobacco was a New World plant that conquered the Old World after Europeans discovered its psychoactive (and addictive) properties. At about the same time, advances in distilling techniques and the spread of information about them through the printed word created opportunities for making and selling alcohol. After their conquest of South America, some Europeans began cultivating coffee on that continent, while elsewhere other Europeans were expanding the tea trade. Alcohol, tobacco, and caffeine soon became important trade commodities, the taxation of which was a mainstay of government finances.\nCourtwright does not confine his story to the big three in the drug world. He also writes about cannabis, opium, coca and cocaine, and synthetic products. None of these substances or their derivatives became commodified in quite the same way as did the big three, although there were important regional exceptions, such as the infamous opium dens of the Chinese. Part of the story of the lesser-used drugs is the relative absence of their commercialization. For example, until well into the 20th century, smoking marijuana was a practice of particular -- and relatively small -- populations in certain regions. Nor is Courtwright's analysis entirely commercial. To the Christian Europeans, the Amerindians' use of plant hallucinogens such as peyote was reprehensible.\nOne essential difference with respect to alcohol, tobacco, and caffeine was the skill of entrepreneurs and their resulting profits and power in promoting these products. Courtwright's approach is to paint a large picture, while occasionally delving in some depth into particulars. He writes about James Duke and the growth of the cigarette trade after the late 19th century. The industry that Duke's ingenuity and acumen fostered became very powerful, and it remains so today, able to fight off efforts to restrict it severely or even to eradicate it, however steep is the mountain of evidence about the ill effects of tobacco use.\nHerein lies the story of a sea change in social approaches to drug use and the drug trades. With the advance of industrialized societies, concern mounted about the effects of psychoactive substances. Altered states of consciousness do not mix well with the needs of a technologically complex civilization. Europeans sometimes tolerated altered states of consciousness among peasants and workers as a means of easing the pain of their often miserable lives, especially in early modern times. Views changed with advancing industrialization in the 19th century, however. Even so, efforts to control the use of tobacco and alcohol detract from their potential as objects of taxation (and contradict the realities of their use). The enormous power of the tobacco and alcohol industries has overcome efforts to ban or restrict their products. When the United States, for instance, prohibited the liquor trades in 1920, wealthy Americans eventually engineered the law's repeal by arguing that it would promote an economic revival (repeal occurred in 1933, the nadir of the Great Depression) and pointing out the benefits of having alcohol taxes.\nIn the case of other drugs that were declared illicit during the industrial age in some places, there are ongoing efforts to eradicate their use. Courtwright is known for his use of historical knowledge to argue against the legalization of ``drugs,'' and he does so again in a concluding chapter dealing with dangerous psychoactive substances in the 21st century.\nCourtwright writes with felicity, gracefully constructing his narrative in a clearly organized fashion, eschewing jargon and technical language. This is an engaging book that deserves a wide audience among general readers.\nK. Austin Kerr, Ph.D.\nCopyright Â© 2001 Massachusetts Medical Society. All rights reserved. The New England Journal of Medicine is a registered trademark of the MMS.\n\nFrom Booklist\nCourtwright examines the historic tolerance of such psychoactives as coffee, tobacco, and alcohol vis-a-vis the prohibitions of such others as marijuana, cocaine, and opiates, and he delineates the history of various drugs from their first known appearance in written records to their rise as popular medical or recreational substances to, in far too many cases, their prohibition. Consider the progress of the opiates. Originally hailed as a godsend, opium and its derivatives were widely used, more or less medicinally, but fell from favor because of their addictiveness and other side effects. Nevertheless, the British created a lucrative market for the stuff in China, even going to war to keep the supply flowing and the money coming in. Eventually, the Chinese were heavily identified with opium smoking, and fear of opium dens and concomitant iniquitous behavior was used to justify discrimination and worse against Chinese in America. Reasoned and informative, Courtwright's book is a cogent source of dispassionate information on drugs and their role in society. Mike Tribby\nCopyright Â© American Library Association. All rights reserved\n\n===================================================================================\nReviews\nIn this engaging study, [Courtwright] shows how body-and mind-altering plants and their byproducts, as well as synthetic compounds, have also radically changed agriculture, commerce, religion, law and government as 'drug cultivation and manufacturing' have become big business. His argument is founded on an intriguing and encyclopedic array of information...In his discussions of the attempts and failures to do away with these substances...Courtwright's exhaustive details cohere in a complex portrait of how psychoactive substances are not only part of human experience but, in many ways, fundamental to our view of civilization. (Publishers Weekly 2001-01-01)\n\nA penetrating study of what the author deems one of the most significant events in world history: the 'psychoactive revolution'...Courtwright traces the origins of [psychoactive] substances, showing how political and economic forces have combined to 'transform the everyday consciousness of billions of people and, eventually, the environment itself.' His tale is endlessly fascinating, with oddments enough to enliven a thousand dissertations and cocktail parties...He has succeeded admirably in a book likely to become a standard. (Kirkus Reviews 2001-01-15)\n\n[With] entertaining details...[Courtwright's] lively writing spices up a serious take on a grave subject. While Courtwright sees licit substances like tea and illegal heavy-hitters like cocaine as two ends of the same spectrum, he's by no means trying to minimize the dangers of drugs. Rather, he wants to lay out the history clearly--perhaps partly hoping that if policy setters understand how drug use spread so widely and deeply, they'll be better equipped to fight it. (Polly Shulman Newsday 2001-03-18)\n\n[Courtwright's] clearly written, thoughtful book...is unique in its broad scope...There is a lot to keep straight in this readable account. Though not a comprehensive history of drugs, it is good at identifying the trends and patterns from about the sixteenth century that have brought about Courtwright's 'psychoactive revolution.' This is the book to go to when planning an assault on Jeopardy! (Barbara Liss Houston Chronicle 2001-04-01)\n\nWhy is tobacco legal and marijuana illegal? What is the difference between nations using alcohol to lure natives into questionable transactions, and drug dealers selling their products in dark corners (or broad daylight)? David Courtwright's illuminating history of drugs in the modern world will shock and surprise readers who still believe that only criminals use--and want--drugs. (Lee Milazzo Dallas Morning News)\n\nAlcohol joins caffeine and tobacco to round out what Courtwright calls the &quot;big three&quot; of currently legal psychoactive drugs. As he sees it, modern civilization is practically unthinkable without this trio. But why have they fared so well while equally intoxicating substances--like, say, marijuana--are banned and stigmatized, and others--like kava, khat and betel--are popular only in distinct geographic areas? And why is tobacco currently falling in popularity, while alcohol and caffeine are holding their grip on us? These questions are only partly answered in Courtwright's otherwise excellent book, but that's not really his fault. Drugs are as deceptive and multifaceted as the human beings whose metabolisms they mess with; a history of drugs may be possible, but an analysis of their role in culture is bound to be incomplete and provisional. There are simply too many ways to tell the story...Courtwright's historical investigation is solid and fascinating. (Maria Russo Salon.com)\n\nA compact yet exhaustive look at the history of drug use and production. Its pace is swift, and its evenhanded approach offers much to enlighten those on all sides of the drug debate...[This book] couldn't be more timely, arriving amid challenges to the national drug policy...[It's] refreshingly evenhanded, potentially enlightening both to legalization proponents and those who consider tough anti-drug laws a moral imperative...[Courtwright's] sources range from anthropologists to tobacco industry executives. Compact, quick-paced and witty, the book is sprinkled with small startling details, such as the fact that East African lions have learned to prey upon drunks staggering home from roadside bars. Forces of Habit is a thorough chronicle of a vast, complicated problem. (Katy Read Minneapolis Star Tribune)\n\nWhile we are very used to thinking of illegal drugs as destructive, historian David Courtwright vividly demonstrates...that most of these psychoactive substances have exacted and still exact a heavy toll...Courtwright, a historian who has written earlier admired books examining illegal drugs and the nature of violence in America, describes the rise of the global drug trade, discusses why some drugs are more popular than others, and then considers the intersection of drugs and political and economic power...What then caused the commercial and political leaders of the western world, who were profiting so wonderfully from the psychoactive revolution to reconsider their avid promotion of these products? In a phrase: the industrial revolution. As Courtwright so succinctly puts it, &quot;A drunken field hand was one thing, a drunken railroad brakeman quite another.&quot; (Jill Jonnes Baltimore Sun 2001-04-22)\n\n[This book] couldn't be more timely arriving amid challenges to national drug policy...[It] is refreshingly evenhanded, potentially enlightening both to legalization proponents and those who consider tough anti-drug laws a moral imperative. Compact, quick-paced and witty...Forces of Habit is a thorough chronicle of a vast, complicated problem. Readers who think they know the solution to the drug dilemma are likely to come away with a better understanding of what a mess it really is. (Katy Read Minneapolis Star Tribune 2001-05-15)\n\nThis book offers a fascinating, entertaining, and perceptive account of how politics, profit, and pleasure have shaped contemporary attitudes about psychoactive substances...In Forces of Habit [Courtwright] reviews, with calm reason and humor, histories of the use and abuse of a complete spectrum of psychoactive substances including alcohol, tobacco, caffeine, opiates, cannabis, cocaine, and hallucinogens...Courtwright presents a fresh and discerning discussion of contemporary issues and problems surrounding both illicit and legalized drugs. (Jack H. Mendelson Science 2001-06-01)\n\nA global history of the acquisition of progressively more potent means of altering ordinary waking consciousness, this book is the first to provide the big picture of the discovery, interchange, and exploitation of the planet's psychoactive resources, from tea and kola to opiates and amphetamines. (African Sun Times 2001-07-12)\n\n===================================================================================\nAbout the Author\nDavid T. Courtwright is John A. Delaney Presidential Professor at the University of North Florida.\n===================================================================================","torrent":{"xt":"urn:btih:ee6438136f40b7b2df1833e0170d0ed009b07a00","amp;dn":"David+T.+Courtwright+-+Forces+of+Habit.+Drugs+and+the+Making+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee6438136f40b7b2df1833e0170d0ed009b07a00","infoHashBuffer":{"type":"Buffer","data":[238,100,56,19,111,64,183,178,223,24,51,224,23,13,14,208,9,176,122,0]},"announce":[],"urlList":[]}}