{"title":"Blissful - The Blissful Orchestra (1995)","uid":6907762,"size":323750352,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef92be7a13fd654e9f14a1fb18b26af71a076f60&amp;dn=Blissful+-+The+Blissful+Orchestra+%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1324663092,"description":"`The Blissful Orchestra' - hard to get a hold of this band but the music is truly memorable. Sweet but not sugary; melodic but not too poppy. \n\nGreat combination of vocals, hooks and understated backing make this a CD a treasure worth having. \n\nThe Blissful Orchestra&quot; starts off with &quot;To The Bachelors&quot; which sounds like The Wannadies or Eggstone mixed with (here`s an old fave for some of you) The Supernaturals, The Cardigans and The Grass Show. And most of the other 12 songs that follow fall inside this sound. This was released during the height of mid 90`s Brit-Pop Explosion and it fits nicely as a timepiece in the movement, but Swedish pop bands always had their own take on the movement, the sound making it distincitively their own. Such is the case with this CD. This one flew under the radar then, too much coming out at the time---a lot of great releases had the same problem. Even Swede-pop fans, have been looking for this one for a long time as it`s no where to be found. Until now. Again. \n\nBlissful effortlessly sound fresh and familiar with catchy hooks that stick deep enough that you think they have always been there. A refreshing display of nice jangling guitars, solid rhythms and sugar-sweet harmonies lighting the fuse on a tasty box of Swedish styled chocolates. \n\nBlissful by the Blissful Orchestra -Imported from Sweden by Listening Post Music","torrent":{"xt":"urn:btih:ef92be7a13fd654e9f14a1fb18b26af71a076f60","amp;dn":"Blissful+-+The+Blissful+Orchestra+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef92be7a13fd654e9f14a1fb18b26af71a076f60","infoHashBuffer":{"type":"Buffer","data":[239,146,190,122,19,253,101,78,159,20,161,251,24,178,106,247,26,7,111,96]},"announce":[],"urlList":[]}}