{"title":"Linux Format UK - Summer 2014","uid":10564975,"size":60275950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f18b354ef3ef8395151c7c341db1aa7afec505ac&amp;dn=Linux+Format+UK+-+Summer+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1405510827,"description":"Linux Format UK - Summer 2014\n English| 100 Pages | HQ PDF | 57.50 Mb\n\nLinux Format was the UK's first Linux-specific magazine, and as of 2013 was the best-selling Linux title in the UK. It is also exported to many countries worldwide. It is published by Future plc (which produces PC Plus, .net and many other computer magazines). Linux Format is commonly abbreviated to LXF, and issues are referred to with LXF as a prefix followed by the issue number (for example LXF102 refers to the 102nd issue).\n\nIt began as a one-issue pilot in 1999 called Linux Answers, and began full publication as Linux Format in May 2000 after being launched and produced by a small team consisting of Editor Nick Veitch, Art Editor Chris Crookes and staff writer Richard Drummond, who together created the magazines core values and initial design appearance.[1][2]\n\nCurrently Linux Format has translated editions available in Italy, Greece and Russia.[3] A large number of magazines are exported across the world, principally to the USA where they are sold in Barnes &amp; Noble stores, as well as other large book stores.\n\nArticles within Linux Format regularly feature at-length series and practical tutorials to teach and allow users to expand their skills in using the Linux operating system and its associated software applications. Contributions are encouraged to be submitted by readers.\n\nLinux Format shares the UK market place with an English-language version of Linux Magazine as well as Linux User and Developer\n","torrent":{"xt":"urn:btih:f18b354ef3ef8395151c7c341db1aa7afec505ac","amp;dn":"Linux+Format+UK+-+Summer+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f18b354ef3ef8395151c7c341db1aa7afec505ac","infoHashBuffer":{"type":"Buffer","data":[241,139,53,78,243,239,131,149,21,28,124,52,29,177,170,122,254,197,5,172]},"announce":[],"urlList":[]}}