{"title":"Frank Zappa - You Can't Do That On The Stage Anymore, Vol.1 T","uid":5156466,"size":948458872,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f194ea6e072e5fab0779fbf1aed47d76700200a7&amp;dn=Frank+Zappa+-+You+Can%5C%27t+Do+That+On+The+Stage+Anymore%2C+Vol.1+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":54,"time":1257879873,"description":"While most of the other volumes in the You Can't Do That on Stage Anymore series would be compiled around loose themes (whether topical or historical), this first volume contained a little of everything for everyone. The material spans most of Frank Zappa's career, from 1969 live recordings by the original Mothers of Invention (the medley &quot;Let's Make the Water Turn Black/Harry, You're a Beast/The Orange County Lumber Truck&quot; constitutes a highlight) up to the 1984 tour, with about every incarnation of his group in-between. The music is also quite varied, but focuses mainly on songs, with a few instrumentals and moments of live craziness thrown in for good measure. Special points of interest include &quot;Once Upon a Time,&quot; a segment from the lost 1970-1971 &quot;Sofa Suite,&quot; which provides important elements of conceptual continuity; a performance of &quot;The Groupie Routine&quot; from the same period, which when compared to the previously available version of this Flo &amp; Eddie comedy routine (as &quot;Do You Like My New Car?&quot; on Fillmore East, June 1971) shows how much improvisation the singers poured in their parts; and examples of stage humor (&quot;Ruthie-Ruthie,&quot; &quot;Diseases of the Band&quot;). But the real treat is the complete performance of the suite &quot;Don't Eat the Yellow Snow&quot; from 1979, replete with audience participation (spontaneous poetry!) and the finale &quot;Rollo,&quot; not officially released before. You Can't Do That on Stage Anymore, Vol. 1 addresses both the dedicated fan and the casual listener. \n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                          &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:f194ea6e072e5fab0779fbf1aed47d76700200a7","amp;dn":"Frank+Zappa+-+You+Can%5C%27t+Do+That+On+The+Stage+Anymore%2C+Vol.1+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f194ea6e072e5fab0779fbf1aed47d76700200a7","infoHashBuffer":{"type":"Buffer","data":[241,148,234,110,7,46,95,171,7,121,251,241,174,212,125,118,112,2,0,167]},"announce":[],"urlList":[]}}