{"title":"Belly Vol 1 Isolations with Sandra Bellydance DVD Rip","uid":8321143,"size":843245568,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f1a211f496c12149315fe997fb911c6b86bb4f30&amp;dn=Belly+Vol+1+Isolations+with+Sandra+Bellydance+DVD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sara_melika","files":1,"time":1364675046,"description":"'Belly By Sandra' is a brand new DVD series from international performing sensation Sandra that explores the concepts, techniques, and exercises that are critical to learning the ancient art of bellydance. In this first volume, 'Isolations,' Sandra takes you on a guided tour of the core movements that are often overlooked and ignored and can become weaknesses that frustrate and limit your true potential as a dancer. Isolations are a very special part of Middle Eastern dance; the emphasis is on patience, slowness, and control. If mastered, they become the building blocks of a strong, smooth, and sensual dance. This comprehensive 90 minute DVD is designed to help you master these core bellydance principles. More than just an instructional and exercise video, you will learn how to see, feel, and reproduce the primary movements that make bellydance so beautiful. Sandra explains not just the techniques, but also their grounding in anatomy, muscle control, and internal visualization. By breaking down complex movements into simple transitions, Sandra demystifies isolations and makes them accessible to the widest possible range of dancers. This DVD is not just a tool for beginners; dancers struggling to overcome obstacles in their development can use Isolations as a key to break through to the next level of their art. The concepts and exercise in this video can also help instructors communicate more effectively with their students.","torrent":{"xt":"urn:btih:f1a211f496c12149315fe997fb911c6b86bb4f30","amp;dn":"Belly+Vol+1+Isolations+with+Sandra+Bellydance+DVD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a211f496c12149315fe997fb911c6b86bb4f30","infoHashBuffer":{"type":"Buffer","data":[241,162,17,244,150,193,33,73,49,95,233,151,251,145,28,107,134,187,79,48]},"announce":[],"urlList":[]}}