{"title":"Super Dinosaur issues 1-20 including fcbd origin issue","uid":9260654,"size":602589080,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f46c86e8f341a18dd53b01b5512874c51f77ebe6&amp;dn=Super+Dinosaur+issues+1-20+including+fcbd+origin+issue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"azawrath","files":-1,"time":1385620247,"description":"Super Dinosaur is an American comic book series published by Image Comics' Skybound imprint beginning in 2011. The comic was created by writer Robert Kirkman and artist Jason Howard, who had previously worked together on Image's The Astounding Wolf-Man.\n\nScientists Doctor Dynamo and Max Maximus together discovered a hole in the Earth that led to Inner Earth, a place where dinosaurs live. In addition to dinosaurs, Inner Earth is home to DynOre, a valuable deposit of solar power contained in a rock.[4] While conducting experiments there, Maximus genetically altered a Tyrannosaurus, with which he tried to take over the world. Doctor Dynamo and his son, Derek, stopped him and formed a team with the Super Dinosaur to protect Inner Earth from Maximus.[3] As Kirkman explains:\n\n&quot;In the falling out between Max Maximus and the Dynamos, Doctor Dynamo was injured to the point where he can't really think as much as he could before. His brain isn't really working right but he doesn't know it, so Derek has to go behind him and finish his equations for him, correcting his work and doing whatever he can to make sure that his father doesn't realize that he has this ailment now. It's also so the government overseers don't see that their operation is being run by a 10-year-old kid, so it's to make his dad look good and make sure that he can keep working.&quot;\n\nPretty Cool Series.  This is complete as of this moment.  Issues 1-20(including the special fcbd origin book).\n\nAll thanks goes to the scanners and groups that make these available!\n\nRemember, if you like it buy it!  Support the comic industry!\n\nI will seed as much as possible until this torrent has a decent amount of seeders!","torrent":{"xt":"urn:btih:f46c86e8f341a18dd53b01b5512874c51f77ebe6","amp;dn":"Super+Dinosaur+issues+1-20+including+fcbd+origin+issue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f46c86e8f341a18dd53b01b5512874c51f77ebe6","infoHashBuffer":{"type":"Buffer","data":[244,108,134,232,243,65,161,141,213,59,1,181,81,40,116,197,31,119,235,230]},"announce":[],"urlList":[]}}