{"title":"DeviceBondage---DB-23781 Katharine Cane and Jack Hammer","uid":7521650,"size":2007518467,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f491ec07e018c11c1713a800bc6d248f8b833054&amp;dn=DeviceBondage---DB-23781+Katharine+Cane+and+Jack+Hammer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1344648088,"description":"Katharine Cane vs Jack Hammer\n\nAug 10, 2012 - Performers: Jack Hammer and Katharine Cane \n  \n\nMP4 + Pics.  \n        \n\nCreamy alabaster skinned Katharine Cane finally makes her debut at Device Bondage. She is tough as nails and her pretty eyes get so wide when we subject her to the hellish torments that await her. In the first scene she is strapped into a crucifixion hogtie with leather straps on a metal pole. She is face planted onto an extremely uncomfortable metal grid cage. Jack takes his time working her over, letting the weight of the poles on her back and the hard bite of the cage underneath sink in. Just when she can't continue to endure, she is suspended and installed into an upright version of her predicament. Her weight slowly sinks down as the leather bites into her skin. Stripped of her dignity, the day is off to a great start. \n\nIn scene two, Claire intricately crafted a metal ebi position where Katharine is strapped in a sitting position almost &quot;indian style&quot; with custom fittings fresh out of the shop. Her feet are trapped together with metal toe cuffs. In her mouth is a cruel metal gag secured both behind her and in front of her. Her legs are pried open and her wrists are bound behind her at the waist with the metal stock system. She can only look down and can barely see what Jack has in store for her. Can we say cattle prod? \n\nIn the final position, Katharine is brought back to the crucifixion style that she started the day in with her hands bolted to the floor in metal restraints. Her neck and knees are fitted with metal and bound together so that if she struggles, she will jerk her head around. Her feet are placed in tight metal fittings and hoisted in the air, available for so many things. A nice big butt plug stretches her asshole wide... open... available. \n\nJack expertly Dominates Katharine through the entire shoot. Pushing her limits, testing her trust, and terrorizing her. I would tell you what happens, but...\n\nScreens &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=23781&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=23781&lt;/a&gt;\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-) \n\n","torrent":{"xt":"urn:btih:f491ec07e018c11c1713a800bc6d248f8b833054","amp;dn":"DeviceBondage---DB-23781+Katharine+Cane+and+Jack+Hammer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f491ec07e018c11c1713a800bc6d248f8b833054","infoHashBuffer":{"type":"Buffer","data":[244,145,236,7,224,24,193,28,23,19,168,0,188,109,36,143,139,131,48,84]},"announce":[],"urlList":[]}}