{"title":"Stan Kenton And His Orchestra - 1950-1951 (2002) [EAC-FLAC]","uid":12502897,"size":398876185,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f4bae6999e51d114dd837642111e76e1f1124786&amp;dn=Stan+Kenton+And+His+Orchestra+-+1950-1951+%282002%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pucholoco","files":32,"time":1443396096,"description":"Stan Kenton And His Orchestra - 1950-1951 (2002)\r\n          EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 374 Mb \r\n                  Full Artwork @ 300 dpi (jpg) -&gt; 6 Mb \r\n\r\n\r\nIllness, exhaustion and a national recording ban imposed by executives heading the American Federation of Musicians forced Stan Kenton to disband and withdraw from the music scene in December 1948. \r\n\r\nThe hiatus lasted until February 1950, when he resumed making records for the Capitol label (see Classics 1185, Stan Kenton &amp; His Orchestra 1950). Classics 1255, 1950-1951, which is the seventh volume in the Classics Kenton chronology, contains all of the recordings he made with his big band between May 18 1950 and March 20 1951. \r\n\r\nBy and large, Kenton's music sounded better than ever during this period. His 37-piece Innovations Orchestra, which nearly bankrupted him when he took it on a national tour that set him back something like two hundred grand, performed attention-getting music using ambitiously conceived &quot;progressive&quot; arrangements. Kenton shared composing and arranging duties with Laurindo Almeida, Shorty Rogers and the ever-imaginative Pete Rugolo. \r\n\r\nIn addition to dynamic studies focusing upon the brass and string sections, as well as the cello department in particular, a series of pieces were created as portraits of bandmembers June Christy, Art Pepper, Maynard Ferguson and Shelly Manne. \r\n\r\nTwo tracks cut on August 16 1950 feature pianist and vocalist Nat King Cole, who maintained his composure amid blasts from the brass and shouts from the band during &quot;Orange Colored Sky&quot; -- note that the vocal routine used by the band is a precise word-for-word imitation of the famously rowdy version by that &quot;Incendiary Blonde&quot; Betty Hutton. Kenton bowed to convention by employing a resonant crooner and Billy Eckstine impersonator by the name of Jay Johnson; there is also a wistful band vocal on &quot;September Song.&quot; \r\n\r\nKenton continued to employ Latin American percussionists to spice up his Caribbean-style arrangements; Cole Porter's &quot;Love for Sale&quot; works very nicely under the influence of Miguel Ramon Rivera's conga drumming. \r\n\r\nLest anyone should complain that this band didn't play enough melodies that could be whistled or hummed, Kenton's old chum Vido Musso's tenor sax was featured on the familiar &quot;Santa Lucia&quot; and a dramatic rendering of &quot;Vesti la Giubba,&quot; the famous aria from Ruggero Leoncavallo's opera Pagliacci. \r\n\r\nAfter capping all of this with the delightful &quot;Artistry in Tango&quot; and savoring Bud Shank's graceful solo on Pete Rugolo's &quot;Theme for Alto,&quot; one can begin to understand how and why Kenton's early-'50s band enjoyed increasing popularity in its day. Much of what he'd recorded during the previous decade pales by comparison.\r\n\r\n\r\n--------------------------------------------------------------------------------\r\nTracklist:\r\n--------------------------------------------------------------------------------\r\n\r\n01. Cello-Logy \r\n02. Art Pepper \r\n03. Halls Of Brass \r\n04. Maynard Fergusson \r\n05. Shelly Manne \r\n06. Orange Colored Sky \r\n07. Jam-Bo \r\n08. Be Easy, Be Tender \r\n09. But Then You Kissed Me \r\n10. Easy Go \r\n11. June Christy \r\n12. House Of Strings \r\n13. Love For Sale \r\n14. Viva Prado \r\n15. I'm So In The Mood \r\n16. Round Robin \r\n17. Santa Lucia \r\n18. Pagliacci \r\n19. Something New \r\n20. Artistry In Tango \r\n21. September Song \r\n22. Theme For Alto\r\n\r\n* 2002 Classics Records | Catalog.#: 1255 \r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:f4bae6999e51d114dd837642111e76e1f1124786","amp;dn":"Stan+Kenton+And+His+Orchestra+-+1950-1951+%282002%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4bae6999e51d114dd837642111e76e1f1124786","infoHashBuffer":{"type":"Buffer","data":[244,186,230,153,158,81,209,20,221,131,118,66,17,30,118,225,241,18,71,134]},"announce":[],"urlList":[]}}