{"title":"999 - 29 Tales of Horror and Suspense By Various Authors","uid":8700529,"size":1949111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5992c148662de13e70d2b2b7444d7761dd85970&amp;dn=999+-+29+Tales+of+Horror+and+Suspense+By+Various+Authors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maxdesolate","files":4,"time":1374057308,"description":"A ward-winning writer and editor Al Sarrantonio gathers together twenty-nine original stories from masters of the macabre. From dark fantasy and pure suspense to classic horror tales of vampires and zombies, 999 showcases the extraordinary scope of fantastical fright fiction. The stories in this anthology are a relentless tour de force of fear, which will haunt you, terrify you, and keep the adrenaline rushing all through the night.\n\nThis colossal collection of truly original horror and nonsupernatural suspense proves that the contemporary horror genre is alive and kicking--with enough talented heirs to keep it breathing for many years to come. Here the well-known masters of the macabre--Stephen King, Bentley Little, Ramsey Campbell--join up with those who deserve to be: P.D. Cacek, who chills us to the bone with her disturbing story, &quot;The Grave&quot;; and Michael Marshall Smith, author of a one-of-a-kind mathematical horror story, &quot;The Book of Irrational Numbers.&quot;\n\nExceptionally different in style, the common denominator of these 29 never-before-published short stories is their ability to haunt and terrify. As editor Al Sarrantonio states in his introduction, &quot;if it scares you, that's it.&quot; Worthy stand-outs in this massive fear factory are Joyce Carol Oates's quasi-gothic tale, &quot;The Ruins of Contracoeur,&quot; the sorrowful tale of a family forced into exile because of the patriarch's fall from grace. &quot;Not ten days following the upheaval of our lives, ... Father, disgraced and defeated, uprooted his family from the state capital to live in the ruin of Cross Hill, his grandfather's estate in the foothills of the Chautauqua Mountains.&quot; Despite its classic horror style, Oates's contribution is very much set in the contemporary world of computers and high technology, and for 13-year-old Graeme Matheson, losing access to the Internet is almost as disturbing as the faceless man who haunts him at night.\n\nF. Paul Wilson (The Barrens and Others, The Tomb) contributes the book's most traditional vampire story, &quot;Good Friday.&quot; Vampires have taken over Europe, and America seems about to suffer the same fate. The nuns of a New Jersey Catholic school quickly realize that no amount of holy water can save them from the undead.\n\nOver 650 pages, a quarter of a million words, and enough adrenaline rushes to keep the average horror reader up for nights, 999 is dark decadence indeed.\n\nEPUB AND MOBI. ENJOY AND SEED! ","torrent":{"xt":"urn:btih:f5992c148662de13e70d2b2b7444d7761dd85970","amp;dn":"999+-+29+Tales+of+Horror+and+Suspense+By+Various+Authors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5992c148662de13e70d2b2b7444d7761dd85970","infoHashBuffer":{"type":"Buffer","data":[245,153,44,20,134,98,222,19,231,13,43,43,116,68,215,118,29,216,89,112]},"announce":[],"urlList":[]}}