{"title":"Democracy Now - 17 feb 2012","uid":7040116,"size":455155599,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f5ac10dbf0153e6180d0f9fcf131fe4399b27d07&amp;dn=Democracy+Now+-+17+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1329509104,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 17, 2012\n\n- U.N. Assembly Condemns Syria Crackdown\n- Syria: 63 Killed, Activists Arrested in Raids\n- Top U.S. Intel Official: al-Qaeda Infiltrating Syrian Opposition\n- U.S.: Iran Unlikely to Start Military Conflict\n- &quot;Underwear Bomber&quot; Gets Life Sentence for Failed Attack\n- Payroll Deal Shortens Jobless Aid, Allows Drug Tests\n- Consumer Agency to Monitor Debt Collectors, Credit Reporters\n- NJ Same-Sex Marriage Bill Faces Veto Threat\n- Chinese VP Faces Tibet Protests in California Visit\n- Willie Nelson Joins Suit Against Agro Giant Monsanto\n- Middle East Reporter Anthony Shadid Dies in Syria\n\n\nSpecial reports\n\n- &quot;Where Are the Women?&quot;: Lawmakers Walk Out on Contraception Rule Hearing After Female Witness Barred\n\nIn a dramatic scene on Capitol Hill, several Democrats walked out of a congressional hearing on the Obama administration's rule that would require health insurance plans, including those provided by Catholic-affiliated hospitals and universities, to offer free contraceptives for health-related issues and birth control. The lawmakers took action after the committee chair blocked testimony from a female witness who supports the mandate. We're joined by D.C. Congresswoman Eleanor Holmes Norton, who walked out of the hearing, and the witness who was barred from testifying, Georgetown University law student Sandra Fluke. Georgetown is a Catholic university whose health plan does not cover contraception.\n\n\n- Anthony Shadid (1968-2012): Incomparable, Pulitzer-Winning Middle East Correspondent Dies in Syria\n\nThe Pulitzer Prize-winning New York Times foreign correspondent Anthony Shadid has died at the age of 43. Shadid died of an apparent asthma attack on Thursday while covering the conflict in Syria. An American of Lebanese descent who spoke fluent Arabic, Shadid captured dimensions of life in the Middle East that many others failed to see. His exceptional coverage won him a Pulitzer Prize in 2004 and 2010 for international reporting while covering the U.S. occupation of Iraq. Shadid has been a guest on Democracy Now! several times over the past decade reporting on Libya, Tunisia, Iraq and Lebanon. We air excerpts from our last interview with Shadid in April 2011, just after he returned home following his six-day capture in Libya by Col. Muammar Gaddafi's forces.\n\n\n- Florida Lawmakers Defeat Prison Privatization amid National Push for For-Profit Jails\n\nThe Florida State Senate has defeated a measure to privatize at least 27 prisons, which would have created the largest corporate-run prison system in the country. Despite the vote, Republican Gov. Rick Scott could still privatize the prisons through executive authority. According to the U.S. Department of Justice, the number of prisoners being added to privately run jails is outpacing the overall prison population by 17 percent compared to 4 percent. The nation's largest operator of for-profit prisons, Corrections Corporation of America, recently sent letters to 48 states offering to buy up their prisons in exchange for a 20-year management contract, plus an assurance that the prison would remain at at least 90 percent capacity. We discuss prison privatization with two guests: Florida Republican State Senator Mike Fasano, who led the charge against the bill to handover South Florida's state prisons to private companies, and ACLU of Ohio spokesperson Mike Brickner, co-author of the report, &quot;Prisons for Profit: A Look at Prison Privatization.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f5ac10dbf0153e6180d0f9fcf131fe4399b27d07","amp;dn":"Democracy+Now+-+17+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5ac10dbf0153e6180d0f9fcf131fe4399b27d07","infoHashBuffer":{"type":"Buffer","data":[245,172,16,219,240,21,62,97,128,208,249,252,241,49,254,67,153,178,125,7]},"announce":[],"urlList":[]}}