{"title":"The Escape - David Baldacci","uid":13042032,"size":548126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6aa80d7d368bcabf8fbf557bf16b4c8d0eaf688&amp;dn=The+Escape+-+David+Baldacci&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450542067,"description":"The Escape - David Baldacci\r\n\r\n\r\nDavid Baldacci is one of the world's most popular, widely read storytellers. In his blockbuster thrillers Zero Day and The Forgotten, he enthralled readers with John Puller. A combat veteran and special agent with the U.S. Army, Puller is the man they call to investigate the toughest crimes facing the nation. But all his training, all his experience, all his skills will not prepare him for his newest case, one that will force him to hunt down the most formidable and brilliant prey he has ever tracked: his own brother.\r\nTHE ESCAPE\r\nIt's a prison unlike any other. Military discipline rules. Its security systems are unmatched. None of its prisoners dream of escaping. They know it's impossible . . . until now.\r\nJohn Puller's older brother, Robert, was convicted of treason and national security crimes. His inexplicable escape from prison makes him the most wanted criminal in the country. Some in the government believe that John Puller represents their best chance at capturing Robert alive, and so Puller must bring in his brother to face justice.\r\nBut Puller quickly discovers that his brother is pursued by others who don't want him to survive. Puller is in turn pushed into an uneasy, fraught partnership with another agent, who may have an agenda of her own.\r\nThey dig more deeply into the case together, and Puller finds that not only are her allegiances unclear, but there are troubling details about his brother's conviction . . . and someone out there doesn't want the truth to ever come to light. As the nationwide manhunt for Robert grows more urgent, Puller's masterful skills as an investigator and strengths as a fighter may not be enough to save his brother-or himself.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:f6aa80d7d368bcabf8fbf557bf16b4c8d0eaf688","amp;dn":"The+Escape+-+David+Baldacci","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6aa80d7d368bcabf8fbf557bf16b4c8d0eaf688","infoHashBuffer":{"type":"Buffer","data":[246,170,128,215,211,104,188,171,248,251,245,87,191,22,180,200,208,234,246,136]},"announce":[],"urlList":[]}}