{"title":"What the Hell Was I Thinking!!' Confessions of the World's Most ","uid":9378418,"size":6354194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7bdf5e416d466f4ff16386a6c88f3523fa7e561&amp;dn=What+the+Hell+Was+I+Thinking%21%21%27+Confessions+of+the+World%27s+Most+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":5,"time":1387665529,"description":"Overview: Howard Stern's Highest Rated and Favorite Adult Film Star Guest with a record 19 appearances on his Radio Show! &quot;We're talking about creating a brand-name from nothing, and where it normally takes years and years and years, within a year and a half Jasmin was a known brand name in porn.&quot; - CHARLIE FRY, FORMER MANAGER &quot;Love her or hate her, there is only one Jasmin.&quot; &quot;Within the porn community especially, Jasmin will always hold a certain distinct notoriety. Jasmin was very smart with the gang-bang, because she was the first one to make it a career move. She saw how it had put Annabelle Chong into the lime light, and Jasmin did her own gangbang in a much more calculating way to launch herself into stardom - from the advertising to all the press she got out of it, because of the crowd that was there to witness it, to everything else it led to for her professionally. So everyone that went after her more or less followed the Jasmin St. Claire guidelines and technique, and the model she had set. What made Jasmin so special - and always will-is that when she did anything, whether it be porn, or wrestling, or whatever else, she stands out.&quot; - RON JEREMY &quot;She's one of the most beautiful women I've ever seen. Obviously she's talented enough to succeed outside of porn, she had her wrestling career, and I think could have done anything she wanted.&quot; - MOTORHEAD FRONTMAN LEMMY KILMISTER\n","torrent":{"xt":"urn:btih:f7bdf5e416d466f4ff16386a6c88f3523fa7e561","amp;dn":"What+the+Hell+Was+I+Thinking%21%21%27+Confessions+of+the+World%27s+Most+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7bdf5e416d466f4ff16386a6c88f3523fa7e561","infoHashBuffer":{"type":"Buffer","data":[247,189,245,228,22,212,102,244,255,22,56,106,108,136,243,82,63,167,229,97]},"announce":[],"urlList":[]}}