{"title":"Shanghai Ghetto [documentary.WW2 European.Jews escape to China][","uid":4360304,"size":1476426248,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f8082651579b7ce7d97df679ef6ebdc94da916e0&amp;dn=Shanghai+Ghetto+%5Bdocumentary.WW2+European.Jews+escape+to+China%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kibbles5757","files":13,"time":1219614335,"description":"From The New Yorker:\n\n&quot;A little-known and amazing chapter of Holocaust history-the plight of European \n\nJewish refugees who fled to Japanese-occupied Shanghai in the late \n\nnineteen-thirties-gets an emotional documentary retelling. Five of the survivors \n\nof the impoverished Jewish community are interviewed with great care, and the \n\nfilmmakers round out their tale with archival footage, letters, and photographs. \n\nAll in all, a miraculous revival of the rich cultural life that developed amidst \n\nthe squalor of a foreign, hostile land.&quot; -Bruce Diones \n\nCopyright Ã‚Â© 2006 The New Yorker\n\n-------------------------------\n\nActors: Martin Landau, David Kranzler, Buzeng Xu, I. Betty Grebenschikoff, Harold Janklowicz\nDirectors: Dana Janklowicz-Mann, Amir Mann\nFormat: Black &amp; White, Closed-captioned, Color, Dolby, DVD-Video, Subtitled, NTSC\nLanguage: English, German\nSubtitles: English, Hebrew\n\nAspect Ratio: 1.33:1\nStudio: New Video Group\nDVD Release Date: January 25, 2005\nRun Time: 95 minutes\n\n-------------------------------\n\nThree Amazon.com customer reviews:\n\n24 of 25 people found the following review helpful:\n\nSHANGHAI HAVEN..., September 6, 2005\n\nBy Lawyeraau (Balmoral Castle)\n\nThis is a fascinating documentary that takes a fresh look at the holocaust. In the mid to late nineteen thirties, Jews were allowed to leave Germany, provided that they could get a country to take them in. Therein lay the rub. Many Jews were willing to leave Germany at the time but could find no country that would open its doors to them. Then, some of them discovered that China was an option. It seemed that Shanghai would accept Jewish refugees, and eventually about twenty thousand desperate refugees decided that going to Shanghai would be a more viable option to staying in Germany and German occupied lands, where life for the Jewish population was becoming a slow descent into hell. \n\nTraveling by ocean liner, the refugees would disembark in Shanghai, where part of the city was segregated into an international settlement, filled with western foreigners. By the time that the Jewish refugees began arriving, the Japanese occupied that part of Shanghai that included the international settlement, although the Japanese had a hands off policy with respect to the international settlement. So, even though Japan was one of the Axis powers, which included Germany, the Jewish refugees were allowed to settle in Shanghai without incident. Moreover, the Japanese, having criticized the treatment of Asians by Germans, were now constrained to treat the Jewish refugees well in order to be consistent. \n\nIn fact, there were already two distinct Jewish groups ensconced and well established in Shanghai, the Baghdadi Jews, who were business people and the wealthier of these two groups, and the Russian Jews. Each had their own communities in the international settlement. As the European Jews began pouring into Shanghai, the Baghdadi, who were Sephardic Jews, helped them, providing financial assistance and support. The Jewish refugees came from Germany, Poland, and Lithuania. \n\nThese refugees would band together and form a thriving community with cafes, schools, newspapers, theatres, and sport and social clubs, creating a bustling community with a vibrant cultural life. Still, they were now a poor people living in difficult conditions, as Shanghai was a port city that was teeming with people, many of whom were living in squalid conditions, with poor sanitation and rampant disease. Still, the Jewish refugees felt safe living among the Chinese people with their Japanese captors, never experiencing anti-Semitism from their Asian neighbors. No matter how bad it got in Shanghai, where living conditions were deplorable, it was far worse in Europe for those Jews who remained behind. \n\nThen, after the Japanese bombed Pearl Harbor and the Americans entered the war, the Japanese went into the International settlement and interned the Americans and British, who were pronounced to be enemy aliens. This included the Baghdadi Jews, as they carried British passports. This brought great hardship upon the Jewish refugees, who had been dependent upon the largesse of the Baghdadi Jews for their survival. The responsibility of the Jewish refugees now fell upon the Russian Jewish community. \n\nIn 1943, the Japanese, succumbing to pressure from their German allies, issued a proclamation that all stateless refugees, who came to Shanghai after 1937, were to be resettled in a segregated area and have curfews. This created, in effect, a ghetto of Jews, as they had previously lived side by side with the Chinese. It was not, however, anything like the European ghettos of Jews that the Germans had constructed, as there were no walls separating them from the community at large. \n\nThe filmmakers of this documentary tell the little known story of the Jewish settlements in Shanghai through the moving reminiscences of a number of survivors, archival footage, still photographs, and letters written at the time. The filmmakers also obtained input from historians in order to ground the story in the historical context out of which it arose, creating a historical backdrop for the events and situations described by the survivors. They then traveled to Shanghai with two of the survivors to revisit the city and the ghetto where these survivors had spent so many of their early years and to film the places where they had lived. Remarkably, the buildings still existed, virtually unchanged, very much as they had been so many years ago when Jewish refugees had occupied them. \n\nWinner of the Santa Barbara Film Festival Audience Choice Award, this is a fascinating documentary. It is one that will keep the viewer riveted to the screen. Those who enjoy historical documentaries, as well as those with an interest in the holocaust and World War II, will very much like this well-made documentary, which is narrated by Academy Award winner, Martin Landau. \n\n----------------------------------\n\n16 of 18 people found the following review helpful:\n\nLost Story of Painful Escape - A Good Cinematic Experience, March 9, 2005\n\nBy Kim Anehall &quot;www.cinematica.org&quot; (Chicago, IL USA)\n\nA couple of years before World War II, Europe and the United States turned their back on millions Jews in Europe that tried to escape an increasing persecution. Nations closed their borders after a political meeting between several nations with Germany in the center that led nowhere. Hitler used the result of the meeting as an invitation to increase the intensity of the Jewish persecution. Some Jews were fortunate enough to escape to neighboring countries while many were escorted back to the German border and handed to the Gestapo. However, far away on the other side of the world some fortunate Jews that had the financial means to escape found a loophole - Shanghai. \n\nJapan and China had been in war, which led to the occupation of Shanghai. The Japanese forces were not checking passports, as people arrived to Shanghai by ships. The Chinese government had been abandoned, as was the passport control. Thus, Jews could leave Germany, even though their passports had been restricted or revoked, to peacefully enter Shanghai. A pleasurable four-week voyage through the Suez Canal and the Indian Ocean led the escaping Jews to their destination, Shanghai. \n\nArrivals were initially shocked by the environment to which they arrived. This culture crash had its foundation in several new experiences such as the extreme humidity, high temperature, different written and spoken language, and new food among many other things. Yet, the 20,000 Jews that arrived found a way to cope in the new society. This is much thanks to the British Jews that had lived in Shanghai since the beginning of the century who had acquired much wealth. In the years before World War II and in the beginning of the war the newcomers basically founded their own miniature society within Shanghai. Coffee shops, newspapers, sports events, and much more offered an outlet where the Jews could live a life much like in Europe. \n\nAs the war increasingly intensified the Germans who were allies with Japan pressured the Japanese to create a ghetto in Shanghai for the Jews. The Japanese slowly established this ghetto, but it was very unlike the ghetto in Warsaw, Poland. Nonetheless, food became scarce while starvation and disease made life much more difficult, which even cost several people their lives. Despite the difficulties in Shanghai, the Jews never learned how lucky they were until the end of the war. When the terribly tragic news of the death camps in Europe reached them in Shanghai this moment brought them a heavy sadness, as they realized how lucky they were while reflecting on their relatives and family members&amp;#039; horrific fate. \n\nShanghai Ghetto offers an interesting cinematic journey, as a number of people offer first hand accounts of what it was like to live in the Shanghai Ghetto. One man tells how traumatic it was to experience the bombing of Shanghai at the end of the war. A woman also expresses her contempt for Germany and how she now has no surviving relatives, which is very hard to hear, as one cannot even imagine the pain she must feel. These stories that the audience experiences through film provides and reinforces an important notion - let this never happen again. \n\n-----------------------------\n\n3 of 3 people found the following review helpful: \n\nA little-known story, March 29, 2007\n\nBy Anyechka (Rensselaer, NY United States)\n\nThis film, inspired by director-producer Dana Janklowicz-Mann&amp;#039;s own family history (her grandmother and stepgrandfather fled Germany for Shanghai in 1938, along with her then-eight year old father), tells the story of a little-known chapter of WWII. When the world closed its doors to untold amounts of people desperately trying to escape Europe before the Nazis devoured them, or played the rules and regulations game as though bureaucratic red tape and ridiculously small yearly immigration quotas that were never even filled should have mattered when lives were at stake, Shanghai gave them shelter. This was the only place in the world at the time that didn&amp;#039;t require an exit visa, and it was also just before WWII, when the Jews of Germany and Austria were still allowed to leave instead of having even their own borders closed to them. Though there was a thriving thousand year old Jewish community in China, Shanghai was largely made up of three rather recent groups. The first were the wealthy Iraqis, who had come with the British in the 19th century; the second were the Russians who had fled after the Revolution and Civil War; and the third were the Germans and Austrians (later joined by some Poles who managed to escape through Siberia; as it&amp;#039;s pointed out in the audio commentary, the story of the Shanghai Poles was left out due to time considerations and because the main story was already built around the experience of these Germans, not because it was deemed unimportant or because the producers didn&amp;#039;t know about it). \n\nShanghai was an international city, with a thriving multicultural community; this wasn&amp;#039;t a place where the refugees found themselves the only non-Chinese around for miles. And with rare exceptions like the powerful bureaucrat Goya, all of the Chinese were so nice to them. Though most of them had never met any Jews before, there wasn&amp;#039;t a whiff of anti-Semitism in the air. They saw them as people who were suffering just as they were, who had been forced to leave their homes and families behind. And though the native Chinese did have it even harder, the Germans too had to go through hunger, disease, poverty, crowding (though the ghetto referred to in the title wasn&amp;#039;t anything like the Warsaw Ghetto or Lodz Ghetto; it was more like a Medieval ghetto, just a small segregated area of a city), and the Japanese occupation. However, they actually fared much better than the Chinese under the Japanese occupation, because the Japanese were operating under the anti-Semitic stereotype of Jews being powerful and controlling the world, and didn&amp;#039;t want to make this large new segment of the population angry, for fear there would be far-reaching repurcussions. They also treated the Russians well because they had fled from the Bolsheviks, whom Japan was at war with, holding true to the old line &quot;The enemy of my enemy is my friend.&quot; At first the Germans had been being taken care of by the Iraqis, but after Pearl Harbor they were sent to internment camps (being British subjects) along with all of the other citizens of the Allied forces living in Shanghai. The Russian community stepped to the fore to take care of them, though they weren&amp;#039;t quite as well-off as the Iraqis. They were also taken care of by Laura Margolis, a social worker with the JDC, even though she had to get money from local businesses and government agents to afford these services after Pearl Harbor, when America stopped giving financial aid to this land controlled by an enemy force. Yet from these harsh living conditions they managed to make a thriving community for themselves, with schools, athletic associations, religious life, cultural programming, newspapers, and literary magazines. And though things were really rough for them, as they found out after the war, they had been living in a paradise compared to the people left behind in Europe. \n\nExtras include audio commentary by producer-directors Dana Janklowicz-Mann and her husband Amir Mann, film-maker bios, a trailer, and three additional interviews. Overall, it&amp;#039;s a powerful and fascinating look into a little-known saga of WWII.","torrent":{"xt":"urn:btih:f8082651579b7ce7d97df679ef6ebdc94da916e0","amp;dn":"Shanghai+Ghetto+%5Bdocumentary.WW2+European.Jews+escape+to+China%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8082651579b7ce7d97df679ef6ebdc94da916e0","infoHashBuffer":{"type":"Buffer","data":[248,8,38,81,87,155,124,231,217,125,246,121,239,110,189,201,77,169,22,224]},"announce":[],"urlList":[]}}