{"title":"Cinema FV-5 v1.13(AnDrOid).apk","uid":10071926,"size":5827868,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f8dca265a7c743a405c75be6164ff018a802ce9a&amp;dn=Cinema+FV-5+v1.13%28AnDrOid%29.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Evil_Amdis","files":1,"time":1398867180,"description":"Cinema FV-5 \n\nReleased Date: Apr 28, 2014\n\nFor More Info ; https://play.google.com/store/apps/details?id=com.flavionet.android.cinema.pro\n\nCinema FV-5 is a professional video camera application for mobile devices, that puts professional manual controls in your fingertips. Tailored to enthusiast and professional videographers and filmmakers, with this video camera application you can capture the best footage with top-of-the-line controls for perfect postproduction purposes. The only limit is your imagination and creativity!\n\nFeatures\nAdjust all the image sensor parameters that you only thought pro-videocameras had: exposure compensation, ISO, light metering mode (matrix/center/spot), focus mode and white balance.\nChange sensor parameters (like ISO, exposure compensation or white balance) also during recording.\nZoom after and while recording. Set specific focal lengths thanks to the 35mm equivalent-based focal length display.\nFocus adjustments during recording: lock focus on your subject before recording and change focus planes while recording.\nProfessional viewfinder: 10+ compositing grids, 10+ crop guides available, safe areas display and much more.\nThe most advanced electronic viewfinder on a video camera: live RGB and luminance histogram are available also during recording.\nProfessional sound metering options: display audio peaks and sound clipping warnings during recording.\nChoose video and audio codec, adjust the bitrates, audio sampling rates and number of channels.\nAll camera functions assignable to volume keys. You can adjust EV, ISO, color temperature, zoom and more using volume keys (including those in cable-headsets) as well as focusing and recording. Devices with hardware camera shutter keys are also supported.\nVideo geotagging support.\nAutofocus, macro, touch focus and infinity focus modes, plus a focus lock switch (AF-L).\nAutoexposure (AE-L) and auto white balance (AWB-L) locks in Android 4.0+. You can also lock exposure and white balance during clip recording automatically.\nPowerful video clips organization options: different storage locations and fully customizable file names (even with variables).\nCinema FV-5 is the perfect app for producing the best footage for any short- to medium-sized production. With it you can record the best material possible with any medium- to high-end device. Cinema FV-5 specially supports Android-based compact cameras, so you can even leverage a high-quality, optically stabilized zoom. The footage captured with Cinema FV-5 can be easily edited on any NLE like Apple Final Cut Pro, Adobe Premiere, Sony Vegas or DaVinci Resolve.\n\nWhat's New\nNew languages available: Danish, Czech and Polish. You can change the app's language preferences on Settings / About.\nNow custom video frame rates works on most devices, specially on the range from 15 to 30 FPS. Now the available frame rate should be better detected.\nFixed an issue with certain video resolutions where the viewfinder won't fill the screen.\nFixed start-up ISO and metering being reverted to auto on many devices.\n\n\nPLEASE SEED AS LONG AS POSSIBLE, IT WILL HELPS ME TO RELEASE NEW TORRENTS","torrent":{"xt":"urn:btih:f8dca265a7c743a405c75be6164ff018a802ce9a","amp;dn":"Cinema+FV-5+v1.13%28AnDrOid%29.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8dca265a7c743a405c75be6164ff018a802ce9a","infoHashBuffer":{"type":"Buffer","data":[248,220,162,101,167,199,67,164,5,199,91,230,22,79,240,24,168,2,206,154]},"announce":[],"urlList":[]}}