{"title":"Tomorrow - Tomorrow 1968 (Psychedelic Rock)","uid":4879474,"size":83131719,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f8eda37b6cfd30b56ba388ed0ec455d155d52a4d&amp;dn=Tomorrow+-+Tomorrow+1968+%28Psychedelic+Rock%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":15,"time":1241302464,"description":"Tomorrow - Tomorrow 1968 (Psychedelic Rock)\nLP To Mp3 256 mbit/s\nIncluded: LP Front Cover and this Info &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Tomorrow_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Tomorrow_(album)&lt;/a&gt;\nTomorrow is a 1968 album by the English psychedelic rock group Tomorrow. It was originally released by EMI Parlophone in the U.K. in a black and white sleeve. A slightly different version of the album was also released in the U.S. in 1968 as Sire Records SES 97012, one of the first releases on that label. Although it was not a success when first released it is now widely regarded as one of the best psychedelic rock albums ever made.\n\nThe lack of commercial success can be explained by the long delay between initial recording sessions in spring 1967 and final release in February 1968. By the time the album arrived in record stores the psychedelic trend had already started to die out. EMI provided a very small recording budget and would not allow prints of a colour album cover to be made, although some later re-issues were printed with a modified colour cover.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Tomorrow_(band)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Tomorrow_(band)&lt;/a&gt;\nTomorrow's September 1967 single &quot;Revolution&quot; was likely the primary inspiration for the John Lennon song of the same name which was released a year later. Tomorrow's lyric &quot;Have your own little revolution, NOW!&quot; sounds like it prompted Lennon's response &quot;You say you want a revolution.&quot; Although Tomorrow's song was not a hit the group was well known to insiders of the London music scene. Tomorrow also released a version of Lennon's &quot;Strawberry Fields Forever&quot; in February 1968, so there is little doubt that Lennon was already familiar with the group before writing his own &quot;Revolution&quot; in May 1968.\n\nTomorrow (previously known as The In Crowd and before that as Four Plus One) were a 1960s psychedelic rock band. Despite critical acclaim and support from DJ John Peel who featured them on his &quot;Perfumed Garden&quot; radio show, the band was not a great success in commercial terms. They were among the first psychedelic bands in England along with Pink Floyd and Soft Machine. Tomorrow recorded the first ever John Peel show session on BBC Radio 1 on 21 September 1967. \n\nHistory\nFilm director Michelangelo Antonioni intended to feature the band in his 1966 film Blowup, but instead used The Yardbirds. However Tomorrow did appear in the 'Swinging London' film Smashing Time under the name of The Snarks. John &quot;Junior&quot; Wood was ill and was replaced by John Pearce, a clothes dealer. Again their music was not used in the film. The rock group sounds used in the film are by Skip Bifferty.\n\nThe band released two singles, one of which, &quot;My White Bicycle&quot; was later covered by heavy rock act Nazareth, and as a novelty record by 'Neil the Hippy' (Nigel Planer) of The Young Ones TV series. According to drummer John 'Twink' Alder, the song was actually inspired by the Dutch Provos, an anarchist group in Amsterdam which reportedly instituted a community bicycle program: they had white bicycles in Amsterdam and they used to leave them around the town. And if you were going somewhere and you needed to use a bike, you'd just take the bike and you'd go somewhere and just leave it. Whoever needed the bikes would take them and leave them when they were done.\n\nTomorrow's September 1967 single &quot;Revolution&quot; was likely the primary inspiration for the John Lennon song Revolution which was released a year later Tomorrow's lyric &quot;Have your own little revolution, NOW!&quot; sounds like it prompted Lennon's response &quot;You say you want a revolution.&quot;Though Tomorrow's song was not a hit the group was well known to insiders of the London music scene. Frank Zappa met the group on his first trip to England in 1967 and praised Steve Howe's guitar solo on the song Claramount Lake. Zappa later chose to play Claramount Lake during a radio guest DJ appearance in the 1980's.\n\nTomorrow singer Keith West is perhaps better known as a participant in Mark Wirtz's Teenage Opera project that gave him a solo hit single &quot;Excerpt from a Teenage Opera (Grocer Jack)&quot; and brief commercial success. Guitarist Steve Howe later joined progressive rock band Yes, whilst Twink joined The Pretty Things on their concept album, S.F. Sorrow, before forming The Pink Fairies.  \n\nLineup:\nSteve Howe - electric and acoustic guitars\nKeith West - vocals\nJohn &quot;Junior&quot; Wood - bass guitar\nJohn 'Twink' Alder -  drums\n\nTracklist:\n01. My White Bicycle\n02. Colonel Brown\n03. Real Life Permanent Dream\n04. Shy Boy\n05. Revolution\n06. The Incredible Journey Of Timothy\n07. Auntie Marie's Dress Shop\n08. Strawberry Fields Forever\n09. Three Jolly Little Dwarfs\n10. Now Your Time Has Come\n11. Hallucinations\n12. Claramount Lake\n13. Why","torrent":{"xt":"urn:btih:f8eda37b6cfd30b56ba388ed0ec455d155d52a4d","amp;dn":"Tomorrow+-+Tomorrow+1968+%28Psychedelic+Rock%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8eda37b6cfd30b56ba388ed0ec455d155d52a4d","infoHashBuffer":{"type":"Buffer","data":[248,237,163,123,108,253,48,181,107,163,136,237,14,196,85,209,85,213,42,77]},"announce":[],"urlList":[]}}