{"title":"Foxygen - We Are the 21st Century... [24 bit FLAC] vinyl","uid":8200567,"size":795678352,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f98908fa9c89ba35b26cd148a2449c40914b7476&amp;dn=Foxygen+-+We+Are+the+21st+Century...+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1362005564,"description":"  Foxygen - We Are the 21st Century Ambassadors of Peace &amp; Magic (2013) [24 bit FLAC] vinyl\n\n  Released: 2013\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,800 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. In The Darkness\n  02. No Destruction\n  03. On Blue Mountain\n  04. San Francisco\n  05. Bowling Trophies\n  06. Shuggie\n  07. Oh Yeah\n  08. We Are the 21st Century Ambassadors of Peace &amp; Magic\n  09. Oh No 2\n\n  With their album-length 2012 EP Take the Kids Off Broadway, backwards-looking concept rockers Foxygen arrived with so many classic rock reference points you could have made a bingo card out of the various nods to various heroes contained in their still somehow undeniably hooky songs. Proper full-length We Are the 21st Century Ambassadors of Peace and Magic is even more stuffed full of familiar sound cues and convincing '60s and '70s pop star mimicry, this time with heightened production from Richard Swift taking the album out of the lo-fi realm, and more personal lyrics adding some character to the artifice. Picking apart the blatant, intentional references to different classic songs that cycle verse-to-verse throughout the album is a fun game for record collector types; from the nod to the intro of Sgt. Pepper's on album-opener &quot;In the Darkness&quot; to the bold-faced Dylanisms (and less overt but equally strong Al Stewart-isms) of the incredible, big city lament &quot;No Destruction.&quot; Bowie, Lou Reed, all eras of Mick Jagger, specific doo wop songs, and even moments of the Band; no oldies are safe from Foxygen's pure-hearted appropriation. Their reconstructive surgery of various influences is an interesting approach for a band made up of kids in their early twenties circa 2013, but it isn't the entire formula for what makes this record so great. Lots of bands before Foxygen have dealt with quick changes and sonic patchworks of older influences, but few have managed to craft songs as moving and catchy as these. The thick accents and psychedelic swirl of &quot;San Francisco&quot; walk the line of being patronizingly nostalgic until the hook-heavy chorus comes in, distant guest vocals from Jessie Baylin and Sarah Versprille answering singer Sam France's &quot;I left my love in San Francisco&quot; with refrains of &quot;That's okay, I was bored anyway&quot; and &quot;That's okay, I was born in L.A.&quot; This one move disarms any cloying elements of the song and reminds the listener that Foxygen are in complete songwriting control, not just throwing back-dated pop culture references at the wall and hoping something sticks. In their earliest days, Of Montreal had a similar knack for updating their favorite records with their own personalities, as did many artists of the Elephant 6 collective, but WAT21CAOPAM is more tuned in, clear-headed, and full of intent than any of Foxygen's more immediate predecessors. It's a gorgeous and non-stop convergence of ideas, some borrowed, some original, some refurbished, and some outright stolen. In the end, however, the album's coherence comes in its incredible architecture of all these ideas, and the way the band sells them with everything they've got, taking what could be incredibly obtuse music back into the realm of pop from which it was born.","torrent":{"xt":"urn:btih:f98908fa9c89ba35b26cd148a2449c40914b7476","amp;dn":"Foxygen+-+We+Are+the+21st+Century...+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f98908fa9c89ba35b26cd148a2449c40914b7476","infoHashBuffer":{"type":"Buffer","data":[249,137,8,250,156,137,186,53,178,108,209,72,162,68,156,64,145,75,116,118]},"announce":[],"urlList":[]}}