{"title":"Violent Femmes - Hallowed Ground [1984][EAC,log,cue. FLAC]","uid":8148591,"size":254186596,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9c80ba375ffb017028adb8ea8256c3a2367a7fb&amp;dn=Violent+Femmes+-+Hallowed+Ground+%5B1984%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":12,"time":1360984165,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Violent Femmes\nRelease: Hallowed Ground\nDiscogs: 1697344\nReleased: 1984\nLabel: Slash Records\nCatalog#: 1-25094 / 422-828 273-2\nFormat: FLAC / Lossless / Log (100%) / Cue / CD, Reissue\nCountry: US\nStyle: Rock, Indie Rock\n\nTracklisting:\n\n01. Country Death Song (5:02)\n02. I Hear The Rain (1:30)\n03. Never Tell (7:06)\n04. Jesus Walking On The Water (3:04)\n05. I Know It's True But I'm Sorry To Say (5:05)\n06. Hallowed Ground (4:12)\n07. Sweet Misery Blues (2:43)\n08. Black Girls (5:38)\n09. It's Gonna Rain (4:12)\n\nReleased a year after the Femmes eponymously titled classic first album this 1984 offering ranks as their most difficult but ultimately most rewarding album. The Femmes trademark country-punk and savage wit is expanded on here with a more layered sound evoking a much darker heart and at times they sound genuinely sinister and unsettling as on the raging fury of 'Never Tell' and the apocalyptic 'Hallowed Ground'. Although this album finds the Femmes digging deep into such dark territory as the bizarre murder ballad 'Country Death Song' there are enough moments of sweet melodic beauty to colour this outstanding album with light and shade. The downhome gospel/folk of 'Jesus Walking' sounds like a joyous glimpse inside a Shaker's Revival hall and the swinging jazz of 'Sweet Misery Blues' is sublime as too the gospel simplicity of the infectious 'It's Gonna Rain' which closes this album on a high. Elsewhere the Femmes delve into art-jazz experimentalism on the fantastic 'Black Girls', which at first listen may be a bit hard to digest but makes a perfect foil to the bittersweet elegy of 'I Know It's True But I'm Sorry To Say' a truly heartrending ballad of exquisite beauty and one of Gordan Gano's finest songs.\n\nEpic, dark, angst-fuelled, and sorrowful yet also sweet, uplifting humourous and soulful with some art-rock weirdness thrown in, few artists have made such a varied and challenging album as 'Hallowed Ground' and it ranks as a milestone in alternative-rock. Yes at times it's a difficult listen but it's a real grower and given time you will come to love the Femmes and their incredible ability to frighten you, disturb you, make you cry and then laugh and finally have you singing aloud at the goofy wonderfulness of life in all it's many colours. Truly a monumental album I can't think of many others I can listen to 20 years on that can so exhilerate and still move me in so many ways. The Femmes would change again for the marvellously upbeat 'Blind Leading the Naked' another superb album well worth checking out, but 'Hallowed Ground' is truly their finest hour.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:f9c80ba375ffb017028adb8ea8256c3a2367a7fb","amp;dn":"Violent+Femmes+-+Hallowed+Ground+%5B1984%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9c80ba375ffb017028adb8ea8256c3a2367a7fb","infoHashBuffer":{"type":"Buffer","data":[249,200,11,163,117,255,176,23,2,138,219,142,168,37,108,58,35,103,167,251]},"announce":[],"urlList":[]}}