{"title":"The British North-American Act...In The Beginning(1969)[FLAC]","uid":7135092,"size":175983371,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9f05450a8500c4d0c496db0a3252f0f6040b0a2&amp;dn=The+British+North-American+Act...In+The+Beginning%281969%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":17,"time":1332831625,"description":"01. See How Free (2:04)\n02. Baby Jane Days And Nights (2:43)\n03. Only A Dream (2:53)\n04. Joe Cool (2:23)\n05. The World Would Understand (2:36)\n06. I'll Find A Way (2:00)\n07. Just How You Feel (2:41)\n08. Corduroy Coat (2:05)\n09. Give Yourself A Ride (2:00)\n10. If You're Looking For Honey (2:09)\n11. Don't Run Away (2:29)\n12. All The World Is In Your Eyes (2:11)\n\nNamed for an act of British Parliament that helped establish the Canadian constitution, the British North-American Act were, fittingly enough, comprised of musicians from both Canada and the U.K. (though in the true spirit of internationalism, keyboard man Andy Bator was born in Hungary), and their sole album, originally released in 1969, is a gentle and likable fusion of folk-rock and psychedelia, with a bit of garage rock creeping in around the edges. &quot;Joe Cool&quot; is a swaggering tale of a self-styled ladies' man that wouldn't seem at all out of place on a vintage garage rock playlist (especially with Bob Allen's primal guitar work), and &quot;If You're Looking for Honey&quot; covers similar musical ground, but most of the album follows a gentler and trippier path, especially the sunny &quot;Corduroy Coat,&quot; the languid and low-key &quot;The World Would Understand,&quot; the baroque pop exercise &quot;Just How Do You Feel&quot; (complete with harpsichord), the moody and Farfisa-driven &quot;Don't Run Away,&quot; and the bittersweet &quot;Only a Dream.&quot; The light, poppy touch of many of these songs makes the British North-American Act sound just a bit behind the times for 1969 -- while most of their peers were cranking up their amps and dropping acid, these guys were seemingly following more benign pursuits, both musically and recreationally, but the songs are well crafted, the band plays them with strength and taste, and the 12 tunes are just varied enough to give the performances a broad musical palette without losing sight of the group's identity. And at a time when bands were beginning to stretch their albums out to epic scale, In the Beginning... offers plenty of entertainment in an efficient 29 minutes. There's little that's visionary and life-changing about the British North-American Act, but they produced engaging and likable pop that deserves a wider hearing among fans of the music of the era.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:f9f05450a8500c4d0c496db0a3252f0f6040b0a2","amp;dn":"The+British+North-American+Act...In+The+Beginning%281969%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9f05450a8500c4d0c496db0a3252f0f6040b0a2","infoHashBuffer":{"type":"Buffer","data":[249,240,84,80,168,80,12,77,12,73,109,176,163,37,47,15,96,64,176,162]},"announce":[],"urlList":[]}}