{"title":"Democracy Now - 17 jan 2012","uid":6963822,"size":455463571,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fb3db5417e7bf459835d6b37fb1af9c530a0bf39&amp;dn=Democracy+Now+-+17+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1326848141,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 17, 2012\n\n- Romney Comes Under Fire at Republican Debate in South Carolina\n- Romney: I Oppose Negotiating With the Taliban\n- Christian Right Leaders Back Rick Santorum\n- Homeland Security Hired Contractor to Monitor Websites\n- Report: U.S. Concerned Israel Is Preparing to Attack Iran\n- Report: Israelis Recruited Militants to Carry Out Covert Ops in Iran\n- Nigerian Unions Call for Strike to End\n- Guatemala's New President Tied to Human Rights Atrocities\n- 700,000 Seek Gov. Walker Recall in Wisconsin\n- Tucson School District Releases List of Banned Ethnic Studies Books, Includes Shakespeare\n- Occupy Protesters Mark Martin Luther King, Jr. Day\n\n\nSpecial reports\n\n- Wikipedia, Reddit To Shut Down Sites Wednesday To Protest Proposed Stop Online Piracy Act\n\nWikipedia, the online encyclopedia and sixth most visited site in the world, will join websites like the content aggregator Reddit, to &quot;go dark&quot; on Wednesday in opposition to the Stop Online Piracy Act (SOPA), and its companion bill, the Protect IP Act (PIPA), which are currently being debated in Congress. &quot;What these bills propose are new powers for the government - and also for private actors - to create effectively blacklists of sites that allegedly are engaging in some form of online infringement and then force service providers to block access to those sites,&quot; says Corynne McSherry, Intellectual Property Director at the Electronic Frontier Foundation. &quot;What we would have is a situation where the government and private actors could censor the net.&quot; Chief technology officials in the Obama administration have expressed concern about any &quot;legislation that ... undermines the dynamic, innovative global Internet.&quot; But the bill's main backers, Hollywood movie studios and music publishers, want to stop the theft of their creative content and the bills have widespread bipartisan support. A vote on SOPA is on hold in the House now, as the Senate is still scheduled vote on PIPA next Tuesday.\n\n\n- &quot;Internet Censorship Affects Everybody&quot;: Rebecca MacKinnon on the Global Struggle For Online Freedom\n\nAs protests mount against two controversial internet anti-piracy bills moving through Congress, we speak with Rebecca MacKinnon, author of the forthcoming book, &quot;Consent of the Networked: The Worldwide Struggle for Internet Freedom.&quot; &quot;If we want democracy to survive in the internet age, we really need to work to make sure that the internet evolves in a manner that is compatible with democracy,&quot; MacKinnon says, &quot;And that means exercising our power, not only as consumers and Internet users and investors, but also as voters to make sure that our digital lives contain the same kind of protections of our rights that we expect in physical space.&quot; She argues that for every empowering story of the internet's role, there are many more about the quiet corrosion of civil liberties by companies and governments.\n\n\n- Journalist Chris Hedges Sues Obama Admin Over Indefinite Detention of U.S. Citizens Approved in NDAA\n\nPulitzer Prize-winning journalist Chris Hedges has filed suit against President Obama and Secretary of Defense Leon Panetta to challenge the legality of the National Defense Authorization Act, which includes controversial provisions authorizing the military to jail anyone it considers a terrorism suspect anywhere in the world, without charge or trial. Sections of the bill are written so broadly that critics say they could encompass journalists who report on terror-related issues, such as Hedges, for supporting enemy forces. &quot;It is clearly unconstitutional,&quot; Hedges says of the bill. &quot;It is a huge and egregious assault against our democracy. It overturns over 200 years of law, which has kept the military out of domestic policing.&quot; We speak with Hedges, now a senior fellow at the Nation Institute, and former New York Times foreign correspondent who was part of a team of reporters that was awarded the Pulitzer Prize in 2002 for the paper's coverage of global terrorism. We are also joined by Hedges' attorney Carl Mayer, who filed the litigation on his behalf in the U.S. District Court for the Southern District of New York.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fb3db5417e7bf459835d6b37fb1af9c530a0bf39","amp;dn":"Democracy+Now+-+17+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb3db5417e7bf459835d6b37fb1af9c530a0bf39","infoHashBuffer":{"type":"Buffer","data":[251,61,181,65,126,123,244,89,131,93,107,55,251,26,249,197,48,160,191,57]},"announce":[],"urlList":[]}}