{"title":"Chicory Tip - What's Your Name (Disco 1972)","uid":4676471,"size":30178528,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fb428ef35f59bf127ef82ce392eccdc723b985d9&amp;dn=Chicory+Tip+-+What%5C%27s+Your+Name+%28Disco+1972%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":2,"time":1232916143,"description":"Chicory Tip - What's Your Name (Disco 1972)\nFirst Aired: 27 May 1972 / Type: MPEG File \nLenght: 02:53 min / Video Size: 352 x 288 (4:3) / Quality: VG\n\nChicory Tip were a British pop group from Maidstone, Kent, comprising Peter Hewson (vocals), Rick Foster (guitar), Barry Mayger (bass guitar), Brian Shearer (drums) and Rod Cloutt (guitar, keyboard.\n\nThey formed around 1969, and signed to CBS Records. Their first few singles flopped, although &quot;Excuse Me Baby&quot; in 1971 secured them their first appearance on the BBC Television pop music programme, Top of the Pops. Their finest moment came after studio manager Roger Easterby came across an advance copy of &quot;Son of my Father&quot;, a song written by Giorgio Moroder and Pete Bellotte. Convinced of its potential, he secured them the option to rush record their own cover version in competition with the original. The result was a Number One hit in the UK Singles Chart for three weeks in February 1972. it was one of the first hit singles to prominently feature a moog synthesizer (in this case played by studio engineer and record producer, Chris Thomas).\nTwo further Top 20 hits in similar vein followed, &quot;What's Your Name&quot;, and &quot;Good Grief Christina&quot;. Another release, &quot;Cigarettes, Women and Wine&quot; was heavily played on Radio Luxembourg but failed to chart, probably due to a BBC Radio 1 ban because of its references to smoking.\n\nThe group released one album, also entitled Son Of My Father.\n\nAlthough it brought them success, they resented their image as a pure pop band, and on stage their sound was much closer to heavy rock, and they claimed they were more like Deep Purple. However they never succeeded in broadening their appeal to an older audience. They disbanded in 1975, but later reformed to play gigs on the 1970s revival nostalgia circuit.\n\nDisco was a pop music program that aired in Germany on the ZDF network from 1971 to 1982. It generally aired each Saturday night at 7:30PM, running 45 minutes each week. 133 shows were produced. The show was hosted by German actor and comedian Ilja Richter. Its lesser known predecessor on ZDF, 4-3-2-1 Hot &amp; Sweet was aired between 1966 and 1970, presenters included Richter and Suzanne Doucet. Disco generally served a younger pop-oriented audience compared to ZDF's Hitparade, and until 1972, its main competitor was Beat-Club (originally patterned after the pure live-act show Ready Steady Go! in the UK, from the late-1960s turning more and more into psychedelic music videos made especially for the invited acts), followed by Musikladen, both on ARD.\n\nRepeats of Disco have been aired since 1984 on ZDF Musikkanal, after its closedown in 1989 on 3sat. Since 2004, the digital ZDF Theaterkanal aired repeats of the entire series. In 2007, ZDF Dokukanal began to air reruns, starting with episodes from 1975.\n\nThe show focussed on chart hits current at the time of airing, giving about equal airtime to international pop music and German Schlager. Despite its name, it did not particularly focus on disco music although it featured many disco hits as long as they were chart relevant. (The name of the show was devised before disco as a musical style existed).  From Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:fb428ef35f59bf127ef82ce392eccdc723b985d9","amp;dn":"Chicory+Tip+-+What%5C%27s+Your+Name+%28Disco+1972%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb428ef35f59bf127ef82ce392eccdc723b985d9","infoHashBuffer":{"type":"Buffer","data":[251,66,142,243,95,89,191,18,126,248,44,227,146,236,205,199,35,185,133,217]},"announce":[],"urlList":[]}}