{"title":"Folder Lock v7.1.5 + Serials [ChattChitto RG]","uid":7710837,"size":13511744,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fb5f25b373e6aa8eaeaa15c9dd08c42f6389c06a&amp;dn=Folder+Lock+v7.1.5+%2B+Serials+%5BChattChitto+RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChattChitto","files":-1,"time":1349802346,"description":"Folder Lock v7.1.5 + Serials\n\n.exe File Format (Setup File - Serials - Instructions)\n\n***********************************************************************************\n\nFolder Lock v7.1.5\n\nHomePage: http://www.newsoftwares.net/folderlock/\n\n\nLock! Encrypt! Backup! Anywhere. Anytime.\nFolder Lock is a full-suite data security solution for Windows 7.0, Vista and XP (including their 32 and 64 bit variants.) Folder Lock is the world leader in data protection with more than 25 million downloads so far. It is the most comprehensive solution for data security available on the internet.\nFolder Lock comes with a perfect combination of seven (7) security tools, letting you encrypt your important files using 256-bit on-the-fly encryption; back them up in real-time to an online storage, and store them to any portable device. The program also lets you lock files, folders and drives; save your personal information in Wallets; shred files and clean your Windows History.\nFolder Lock comes with additional security settings unheard before, including application level password security, stealth mode, hack security and auto protection. Folder Lock works under all flavors of 32-bit and 64-bit versions of Windows 7/Vista/XP and later.\n\nFeatures:\n==========\n-Fastest Encryption: With Folder Lock you can now encrypt your files faster than ever. The program creates Lockers, without taking up much space and grow as you dump files in it. Lockers are encrypted, resizable, portable and ready for backup.\n-Secure Backup: Folder Lock 7 allows you to optionally backup all files and folders you keep in your encrypted Lockers automatically while you continue to modify or access your encrypted files. Files remain encrypted at both ends.\n-Additional Security: Users can now achieve true portable security, application level password security, activate stealth options, shred files, make wallets, clean history, auto protect the application and all its files, use virtual keyboard to type passwords to prevent key logging of any kind and can prevent hacking and incorrect password attempts.\n-True Ease of Use: Folder Lock 7 leverages NewSoftware's highly regarded graphical user interface. Existing Folder Lock users will be immediately productive: it's the same great console they already know and love. New users will find Folder Lock 7 remarkably easy to configure and use. Even relative novices can use all features of the product without going through all the jargon and how tos.\n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n[Please Leave A Comment Confirming This Pack]","torrent":{"xt":"urn:btih:fb5f25b373e6aa8eaeaa15c9dd08c42f6389c06a","amp;dn":"Folder+Lock+v7.1.5+%2B+Serials+%5BChattChitto+RG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5f25b373e6aa8eaeaa15c9dd08c42f6389c06a","infoHashBuffer":{"type":"Buffer","data":[251,95,37,179,115,230,170,142,174,170,21,201,221,8,196,47,99,137,192,106]},"announce":[],"urlList":[]}}