{"title":"HISTORY OF POP AND ROCK MUSIC - part 379","uid":7201906,"size":854330292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fbb6cd6c08373ff5e042f79e5c29f589036cf61b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+379&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1334965503,"description":"\nPART  379\n\n\n\nTHE NEVILLE BROTHERS - Yellow Moon (1989)\nTHE NEVILLE BROTHERS - Bird on a Wire (1990) \nTHE NEVILLE BROTHERS - Tell It Like It Is (1992) \nAARON NEVILLE &amp; LINDA RONSTAD - When Something Is Wrong with My Baby (1990) \nAARON NEVILLE - For The Good Times (1995) \n\n\n\nThe Neville Brothers, an American R&amp;B and soul group, was formed in 1977 in New Orleans, Louisiana.The group notion started in 1976, when the four brothers of the Neville family, Art, Charles, Aaron and Cyril got together to take part in the recording session of The Wild Tchoupitoulas, a Mardi Gras Indian group led by their uncle Big Chief Jolly.This experience led them to form the group the following year. Their debut album was released from Capitol Records in 1978. In 1988, the group released Uptown featuring guests including Branford Marsalis, Keith Richards and Carlos Santana. The following year saw the release of Yellow Moon from A&amp;M Records produced by Daniel Lanois. The track &quot;Healing Chant&quot; from that album won best pop instrumental performance of the Grammy Awards.All brothers except Charles, who lived in Massachusetts, had been living in New Orleans; but following Hurricane Katrina in 2005 Cyril and Aaron moved out of the city. They had not been performing in New Orleans since Katrina hit the city. However, they finally returned to perform there at the New Orleans Jazz &amp; Heritage Festival in 2008, at the closing spot which had been reserved for them for years.\n\n\n&quot;Bird on the Wire&quot; is one of Leonard Cohen's signature songs. It was recorded 26 September 1968 in Nashville and included on his 1969 album &quot;Songs from a Room&quot;.Cohen has described &quot;Bird on the Wire&quot; as a simple country song, and the first recording, by Judy Collins, was indeed done in a country setting. He later made various minor changes, such as the modifications present on Cohen Live. Different renditions are included on all of his live albums.\nSeveral artists have covered the song, often as &quot;Bird on a Wire&quot; including The Neville Brothers on the album &quot;Brother's Keeper&quot; (1990),\n&quot;For the Good Times&quot; is a 1970 song penned by Kris Kristofferson that appeared on his debut album &quot;Kristofferson&quot;.The song has been recorded by many artists, including Aaron Neville (1995).\n&quot;When Something Is Wrong with My Baby&quot; is a popular hit song, a soul ballad, written by Isaac Hayes and David Porter, sung by Sam &amp; Dave, and first released in 1967 by Stax Records. The song was covered by Hall &amp; Oates with David Ruffin and Eddie Kendrick of the Temptations at their Apollo Theatre concert in New York City 1985; Linda Ronstadt and Aaron Neville as a duet in 1990 for the album &quot;Cry Like a Rainstorm, Howl Like the Wind&quot;, Johnny Gill on his 1983 self-titled debut album, and again by Patti LaBelle and Travis Tritt in 1994. \n\n","torrent":{"xt":"urn:btih:fbb6cd6c08373ff5e042f79e5c29f589036cf61b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+379","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbb6cd6c08373ff5e042f79e5c29f589036cf61b","infoHashBuffer":{"type":"Buffer","data":[251,182,205,108,8,55,63,245,224,66,247,158,92,41,245,137,3,108,246,27]},"announce":[],"urlList":[]}}