{"title":"Undercover: How I Went from Company Man to FBI Spy -- and Expose","uid":10770802,"size":873912,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc418e96596a6b96039e173775b4508ba3a51852&amp;dn=Undercover%3A+How+I+Went+from+Company+Man+to+FBI+Spy+--+and+Expose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1408072207,"description":"Book Description:\n\nWhen John Schilling, an unassuming mid-level accountant, went to work for the Columbia Hospital Corporation, he never expected to become the catalyst for the series of 'whistleblower' cases that ripped through the healthcare industry in the late 1990s. But when he unwittingly discovered that the company was siphoning billions of dollars away from Medicare and stealing from American taxpayers, he was faced with a choice: speak up for what he believed to be right, or remain silent. &quot;Whistleblower&quot; tells the story of Schilling's incredible, harrowing journey from ordinary citizen to federal informant, as he bravely stands up for the truth, treading a dangerous path against corrupt executives, and putting himself in serious personal jeopardy. The book recounts how Schilling, unable to confide in friends or family, allied himself with the FBI and the Justice Department and journeyed into an undercover world in which he learned to wear a wire, and mapped out offices for secret government raids. Suspenseful and provocative, &quot;Whistleblower&quot; chronicles the series of steps that eventually led to the resignation of high-level executives and forced Columbia to return 1.7 billion dollars to the federal government. A compelling account of one man's decision to risk everything for the greater good, this book reveals the personal side of a thankless role that resulted, ultimately, in justice.\n\nProduct Details:\n\nHardcover: 304 pages\nPublisher: AMACOM (April 16, 2008)\nLanguage: English\nISBN-10: 0814474500\nASIN: B001O0EHO0\n\n-------\nSeed - Share - Enjoy - Give me Thumbs Up\n-------","torrent":{"xt":"urn:btih:fc418e96596a6b96039e173775b4508ba3a51852","amp;dn":"Undercover%3A+How+I+Went+from+Company+Man+to+FBI+Spy+--+and+Expose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc418e96596a6b96039e173775b4508ba3a51852","infoHashBuffer":{"type":"Buffer","data":[252,65,142,150,89,106,107,150,3,158,23,55,117,180,80,139,163,165,24,82]},"announce":[],"urlList":[]}}