{"title":"Fady &amp; Mina - Connected 002 (2013-05-25)  [TRANCE]","uid":8516973,"size":144337176,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fc87c29ac724d119180e478b60322eefaf3b76a2&amp;dn=Fady+%26amp%3B+Mina+-+Connected+002+%282013-05-25%29++%5BTRANCE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"narrenpost","files":-1,"time":1369772712,"description":"Uplifting Trance | AH.fm 25-May-2013 | MP3 320 kbps mixed | 01:00:12 | 138 MB\n\nSorry, no tracklist available at this moment...\n\n\nBlabla Kenya:\n\nDj's Mina Alaa and Fady Hany A.K.A(Fady &amp; Mina) born in Cairo,(Egypt). From\nthe early years their talent for music was clear. Fady got his first keyboard\nat the age of 6 and Mina's first mix was at the age of 12 , They also began\nby listening to all kinds of music (Pop, Techno, Rnb, etc.), then started\nlistening to trance; they were both fascinated by the melodies, beats and\neverything about this music. They were taken by the tunes of great producers\nlike Paul van Dyk, Marco V, Tiesto and the Egyptian heroes(Aly and Fila).\n\nTrance is not only a music they have listened to, it was a lifestyle, after\nplaying some dark tribal, the music concept and culture has been completely\nchanged into the world of melodies and uplifting beats.. Following the steps\nof Aly &amp; Fila and Philippe el Sisi, bringing the energy back again to trance\nmusic, with the passion to create and innovate in the electronic music scene\nworld-wide. After that they decided to create their own music, so they've\nstarted to invade the trance scene by listening to all types of Trance music,\nand they've known the passion inside them towards this genre.\n\nThey performed in many parties and privately organized events for their\nfriends. By days, they were first introduced to people by (nile fm),their\nsets were aired on the local radio station, and they gained positive feedbacks\nfrom their friends and Djs. They started to set up their studio and they\nproduced a couple of tracks, and it was the start that never ends!\n\n","torrent":{"xt":"urn:btih:fc87c29ac724d119180e478b60322eefaf3b76a2","amp;dn":"Fady+%26amp%3B+Mina+-+Connected+002+%282013-05-25%29++%5BTRANCE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc87c29ac724d119180e478b60322eefaf3b76a2","infoHashBuffer":{"type":"Buffer","data":[252,135,194,154,199,36,209,25,24,14,71,139,96,50,46,239,175,59,118,162]},"announce":[],"urlList":[]}}