{"title":"Maori Fortifications","uid":11866485,"size":10317333,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd2e84ea737c3ddb0c116509b36a71b2857a19a9&amp;dn=Maori+Fortifications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1430369226,"description":"The Maori people of New Zealand were experienced field engineers even before they came into conflict with Europeans in the 19th Century. Warfare between rival groups was endemic in Maori society, and it was common practice to protect villages with surrounding entrenchments and wooden palisades, known as pas. As contact with the European world increased, the Maori responded by adopting firearms into their traditional armory. It was not until 1845, however, with the first fighting between the Maori and the British, that it became clear just how strong and sophisticated the Maori fortifications were. For the best part of 20 years, the Maori held off the dominant and technologically superior British forces, by adapting and developing their defenses in response to every new improvement in the British artillery. The complex network of trenches and sheltered 'bomb-proof' dug outs, designed to resist further British assaults, proved so effective that they had a strong influence on the trench warfare systems of World War I. This book explores the evolution and design of Maori fortifications, and charts the course of a conflict that would ultimately see the British break the Maori pas, leading to a bitter guerrilla bush war","torrent":{"xt":"urn:btih:fd2e84ea737c3ddb0c116509b36a71b2857a19a9","amp;dn":"Maori+Fortifications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd2e84ea737c3ddb0c116509b36a71b2857a19a9","infoHashBuffer":{"type":"Buffer","data":[253,46,132,234,115,124,61,219,12,17,101,9,179,106,113,178,133,122,25,169]},"announce":[],"urlList":[]}}