{"title":"Zetman [Manga Ita Cbr] vol. 01-18 [TNT Village]","uid":12843886,"size":1922130911,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fd47737747fb90378ec3f50fa5334832bb2c084a&amp;dn=Zetman+%5BManga+Ita+Cbr%5D+vol.+01-18+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"turchez90","files":18,"time":1448532467,"description":".:Locanda:.\r\n\r\n[img]http://i.imgur.com/x8JajJc.jpg[/img]\r\n\r\n.:Trama:.\r\n\r\nI player, mostri crudeli e pericolosi creati in laboratorio dalla misteriosa Amagi Corporation, sono utilizzati come bestie da combattimento per sadici giochi su cui scommettono numerosi magnati e personaggi facoltosi. Un giorno, senza preavviso, i player organizzano una ribellione, compiono una strage e riescono a fuggire dalla cattività arrivando a mescolarsi con la gente comune. Il presidente dalla Amagi Corporation, il vecchio Amagi, responsabile della sciagura, decide di dedicare il resto della sua vita a combattere i player, cercandoli e scovandoli con tutti i mezzi a sua disposizione, fino alla creazione di Z.E.T., un essere perfetto, forte, veloce ed imbattibile, con il solo scopo di eliminare tutti i player in circolazione. Il dottor Goro Kanzaki, uno degli scienziati di Amagi, riesce a dare vita al piccolo Jin, un bambino destinato a diventare Z.E.T., ma, ripensandoci, decide di fuggire con il bambino e sparire dalla circolazione. Il piccolo Jin si ritrova però presto solo, dopo che un player è riuscito a scovarli ed eliminare Kanzaki. Con la morte di Kanzaki si perde così il segreto di come trasformare Jin nell'essere perfetto, Z.E.T., essendo lo scienziato l'unico a conoscerne il procedimento. Il presidente Amagi, che negli anni non si è mai arreso, riesce a ritrovare un Jin ormai ragazzo, ma ogni tentativo di farlo trasformare si rivela un insuccesso. Intanto i player più evoluti hanno dato vita ad una misteriosa organizzazione, chiamata Evol, che intende liberarsi di Z.E.T., e dopo aver trovato il laboratorio nascosto di Amagi, lo attaccano distruggendolo, ma Jin riesce a salvarsi. Il presidente Amagi ha due nipoti, Konoha e Koga Amagi: Konoha, coetanea di Jin, lo aveva conosciuto da bambina e ne è da sempre segretamente innamorata; Koga invece cova l'ambizione di diventare un supereroe e a tale necessità si fa costruire un costume speciale a imitazione di un personaggio dei cartoni animati che guardava da bambino di nome Alphas.\r\n\r\n.:Dettagli:.\r\n\r\nAutore: Masakazu Katsura\r\nTitolo: Zetman\r\nTipologia: Manga\r\nPagine: 170~210 pagine ciascun volume\r\nVolumi: 20 - in corso\r\nAnno: 2003 - in corso\r\nNazionalità: Giappone\r\nGenere: Seinen - Fantascienza\r\nLingua: Italiano\r\nDimensione del file: 1,92 Gb\r\nFormato del file: CBR (JPG)\r\n\r\n.:Screenshots:.\r\n\r\n[img]http://i.imgur.com/pzzUTXw.jpg[/img]\r\n\r\n[img]http://i.imgur.com/oe9eP5b.jpg[/img]","torrent":{"xt":"urn:btih:fd47737747fb90378ec3f50fa5334832bb2c084a","amp;dn":"Zetman+%5BManga+Ita+Cbr%5D+vol.+01-18+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd47737747fb90378ec3f50fa5334832bb2c084a","infoHashBuffer":{"type":"Buffer","data":[253,71,115,119,71,251,144,55,142,195,245,15,165,51,72,50,187,44,8,74]},"announce":[],"urlList":[]}}