{"title":"Snow Leopard 911 Pro v1.5.1","uid":6746478,"size":2418689581,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:fdda7f011ad9f34cd6d998b620cb405d53a1595b&amp;dn=Snow+Leopard+911+Pro+v1.5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mike18xx2","files":2,"time":1318710301,"description":"What is it?\n\n- An OSX 10.6.7 Intel bootable disk image that can be copied to a 4 GB hard disk or Flash Drive. This is basically a lean and mean Snow Leopard OS X boot volume with all non-essential fluff deleted but the items deleted should NOT affect the performance or compatibility of the tools included. And I also basically turned off virtual memory swap files.\n\n- Special features of Snow Leo Pro include the flexibility of building up the stripped down OS X or customizing it to your heart's content, provided you have enough free space on the volume.\n\n- The ability to install future 10.6.x updates, install additional 10.6 add-ons like fonts, languages, printers , developer tools, etc. and add your own tools or update the existing ones easily!\n\n- Snow Leo Pro has also gone above and beyond what Apple did to make the OS X pure Intel only. I manually removed the PPC coding from dozens of 10.6 OS X components and from all the applications as well both Apple's along with the 3rd party ones.\n\n- Snow Leo Pro is also taking advantage of 10.6's &quot;HFS+ Compression&quot; feature by using this on-the-fly compression on any and all allowable files and folders on Snow Leo Pro.\n\n- Snow Leo 911 Pro is under 3 gigabytes (viewed on 10.6.x) to help try and squeeze it onto most 4GB Flash Drives. Which should still leave plenty of room for cache files !\n\n- Snow Leo Pro has the latest Apple OS X components and critical OS related updates.\n\n- All of the software should be fully working and registered. With the exceptions iDefrag and iPartition.\n\n- To license iPartition you will find a file called iPartition3.licenseKey on the root directory of Snow Leo 911 Pro\n\nTo license iDefrag you will use a special application which is basically a stand-alone Applescript applet I provided in the root directory. Run the iDefrag Residual File Cleaner v1.0.app then reboot back to Snow Leo Pro and launch iDefrag to create a fresh license file automatically. The special cleaning app will change the date to July 1 2010, remove a bunch of temp and cache files that iDefrag uses to monitor the date with to allow it to be licensed again. Make sure to set your date back to normal once you have created a licence file.     Please note that I have forcefully changed every single file on SLP to match July 1 2010 because this application will check many files and folders for this date stamp and it will not license itself without it    \n\n- The very first time you boot from Snow Leo Pro it will be a little slower than normal because it has to create all new caches and temp files. The next time you boot after that it , it should be much faster starting up.\n\n- This only comes in ENGLISH but if you copied this disk image to a large enough drive you can use the newest 10.6.x combo updater or 10.6 installer DVD to add additional languages and pick your own.\n\n- Little Snitch version 2.2.5 was installed and it may ask you to revert to default rules as a security warning the first time you start up after Snow Leo Pro was restored to a volume. Just ignore the warning and use it with the rules I pre-made.\n\n- Safari has a special bookmarks menu called Mac Help with links to many helpful sites. Bookmarks and idea courtesy of Lurker @ MSJ.\n\nLimitations And Known Bugs:\n\n\n  A feature was added for Mac users without plenty of physical memory installed in their machines. You can activate virtual memory by copying Snow Leo 911 Pro to the drive you want it on, then run the installer called Turn Virtual Memory ON.pkg to install a file onto the drive you copied the Snow Leo 911 Pro disk image onto. Virtual memory essentially wastes disk space using VM swap files when you launch multiple programs, but if you have 1 Gb or more ram, why waste the disk space unless you really need to launch more than 5-6 tools at one time.\n\n  For all wireless keyboard and mouse users like me, make sure to keep a USB mouse nearby in case the OS X didn't pair with your wireless keyboard or mouse. Once you use the Bluetooth preferences to pair them any restarts will be fine after that.\n\n  The user account Snow Leo 911 Pro will be using is the System Administrator (aka the &quot;root&quot;) and uses no password. So if you're asked for an admin password , just leave it blank since none was used!\n\n  Diskwarrior v4.3 has a serious bug. It will not run while you are logged in as the System Administrator (aka the &quot;root&quot;) user. You must log out and log back in using the admin account called slp911 or make your own own. And only then will Diskwarrior v4.3 launch without complaining about the preference file being corrupted. This is a wide spread issue and is not isolated to Snow Leo 911 alone. Diskwarrior v4.3 will fail to launch on any HD booted from 10.6.x while logged into the root account.\n\n\n\n  WARNING  \n\nSnow Leo 911 Pro and its contents are meant as an advanced diagnostic tool , please do some research on the included tools you want to use because you can destroy your data or drive.\n\nSnow Leo 911 Pro is using 10.6's &quot;HFS+ Compression&quot; feature. Which means you must be booted into 10.6.x to copy or modify files or folders , otherwise you will lose the compression and the file(s) will revert back to their original sizes.\n\nAs with all diagnostic tools, it is always recommended that you backup your important data before using them.\n\n\n\nOSX 10.6.7 - Apple Tools &amp; Programs\n\n\nActivity Monitor AirPort Utility Applescript Editor Audio MIDI Setup Automator Bluetooth File Exchange Console Disk Utility Firmware Password Utility Java Preferences Keychain Access Network Utility Preview QuickTime Player 7 Pro RAID Utility Reset Password Safari System Preferences System Profiler Terminal TextEdit VoiceOver Utility Plus many more OSX components\n\nCheck the Applications folder for additional programs not listed\n\n\n\n3rd Party Tools &amp; Programs\n\n\nA Better Finder Rename 8.80\nAirRadar 2.1.4\nAppleXsoft File Recovery 2.0.0.35\nBatChmod 1.6.3\nCarbon Copy Cloner 3.3.7\nCleanMyMac 1.9.5\nCocktail 4.9.1\nCopyCatX 5.0\nDaisyDisk 2.0.6\n Data Rescue 3.1\ndiglloydTools\nDiskTools Pro 3.6\nDiskWarrior 4.3\nDrive Genius 3.1\nDropDMG 3.0.6\nEasyFind 4.7.1\nFile Buddy 9.01\nFile Juicer 4.27\nFileSalvage 7.0.1\nHDCleanUp 1.8.5\nHide and Seek\niDefrag 2.0.5\niPartition 3.3.1\nLittle Snitch 2.3.5\nMacPilot 4.2.2\nmemtest 4.2.2\nOfficeSalvage 7.0.1\nPacifist 2.6.4\nPath Finder 5.7.3\nPCalc 3.6.1\nPiXel Check 1.2\nPopChar 5.2\nRember 0.3.6b (GUI memtest 4.2.2)\nSMART Utility 3.0\nSpeedTools Utilities Pro 3.6\nStellar Phoenix Data Recovery 4.1\nStellar Phoenix Photo Recovery 3.5\nSuperDuper! 2.6.2\nTechTool Pro 6.0.1\nTemperature Monitor 4.94\nTouvaly 1.2.7\nXslimmer 1.7.8\n\nKCNcrew 04-15-2011 and Serial Seeker with Serial Box 04-2011\n\n\n\nInstructions\n\n\nUse Apple's Disk Utility to restore the Snow Leo 911 Pro disk image to the volume you wish to copy it to. I would suggest allowing Disk Utility to erase the destination partition to avoid problems (provided you have no data on he destination volume). And make 100% sure your destination volume is the right drive or partition to avoid losing the wrong drive! The Snow Leo 911 Pro disk image has been configured as pre-scanned so you can restore it without being forced to scan it first with Apple's Disk Utility to save you time.\n\nOr you can use\n\nCarbon Copy Cloner or SuperDuper! to copy the contents of the Snow Leo 911 Pro disk image to your HD partition or Flash Drive . The volume (partition - HFS+ Extended non-journaled) should either be formatted as GUID for Intel only or an Apple Mac Partition to make it Universal for both PowerPC and Intel Mac's. Make sure when you finished copying everything to run Diskwarrior from a 10.6.x booted drive on the newly created Snow Leo Pro volume as a pre-caution that is OK.\n\nPlease note that although Carbon Copy Cloner is known to be very good at cloning and restoring data/drives, you may need to use Diskwarrior to verify if the restore went smoothly or use Apple's Disk Utility if Carbon Copy Cloner gives you any errors during the restore!\n\n\n\nRevision History\n\n\nVersion 1.5\n\nUpdated OS X to 10.6.7 Build 10J869\n\nUpdated lot's of tools. Check the 3rd part list for them.\n\nAdded 2 new tools upon request. DaisyDisk and AirRadar.\n\nRemoved TinkerTool System because there are enough other tools with similar functions and 300+ edits to crack it every update is just too much of a pain in the ass.\n\n\n\nVersion 1.4\n\nUpdated OS X to 10.6.5 Build 10H574\n\nUpdated tons of tools and a few new ones. Check the 3rd part list for them.\n\nNew Disk image icon courtesy of Hoplite @ MSJ\n\nA special invisible file called .metadata_never_index has been added to the root directory of Snow Leo Pro to stop SpotLight from indexing the volume. SpotLight by default is turned off to avoid slowdowns and background tasks which may interfere with diagnostics and repairs.\n\nVersion 1.3\n\nUpdated OS X to 10.6.4 Build 10F569\n\nUpdated tons of tools and updated the Little Snitch rules too\n\nVersion 1.2.1\n\nFixed permissions along with the errors below.\n\nFixed; -22 errors on FileSalvage and OfficeSalvage images, a couple of images from each were producing this error.\n\nFixed; ACL permissions errors with the root account and it's contents.\n\nAnd some system tweaking, turned off the option to create a sleep VM image file when portable Mac's go into hibernation mode and rebuilt root accounts contents.\n\nVersion 1.2\n\n10.6.3 combo applied bringing the OS to up to 10.6.3 build 10D573\n\nQuite a few of the tools were updated\n\nLicense files added for iDefrag and iPartition\n\nMac Help bookmark bar added courtesy of Lurker, it is a very extensive collection of bookmarks for everything related to Mac Help including links to the software contained on Snow Leo Pro.\n\nAnd a tool was added; TinkerTool System 2.2\n\n\n\nVersion 1.0.1\n\nFirst release was a flop since my first download of the 10.6.2 combo updater was corrupted and created a serious start up problem for many people where it would hang at a blue screen. Re-downloading the combo update and re-installing it fixed the issue for me and for those that tried it as well.\n\nAnd Serial Box 01-2010 was added\n\n\n\nVersion 1.0\n\nFirst release Christmas 2009.\n","torrent":{"xt":"urn:btih:fdda7f011ad9f34cd6d998b620cb405d53a1595b","amp;dn":"Snow+Leopard+911+Pro+v1.5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdda7f011ad9f34cd6d998b620cb405d53a1595b","infoHashBuffer":{"type":"Buffer","data":[253,218,127,1,26,217,243,76,214,217,152,182,32,203,64,93,83,161,89,91]},"announce":[],"urlList":[]}}